espressif/esp-idf/components/soc/esp32s31/register/soc/hp_peri1_pms_reg.h
/**
 * SPDX-FileCopyrightText: 2025 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0 OR MIT
 */
#pragma once

#include "soc/soc.h"
#ifdef __cplusplus
extern "C" {
#endif

/** HP_PERI1_PMS_HP_USBOTG_PHY_CTRL_REG register
 *  hp_usbotg_phy read/write control register
 */
#define HP_PERI1_PMS_HP_USBOTG_PHY_CTRL_REG (DR_REG_HP_PERI1_PMS_BASE + 0x0)
/** HP_PERI1_PMS_READ_TEE_HP_USBOTG_PHY : R/W; bitpos: [0]; default: 1;
 *  Configures hp_usbotg_phy registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_TEE_HP_USBOTG_PHY    (BIT(0))
#define HP_PERI1_PMS_READ_TEE_HP_USBOTG_PHY_M  (HP_PERI1_PMS_READ_TEE_HP_USBOTG_PHY_V << HP_PERI1_PMS_READ_TEE_HP_USBOTG_PHY_S)
#define HP_PERI1_PMS_READ_TEE_HP_USBOTG_PHY_V  0x00000001U
#define HP_PERI1_PMS_READ_TEE_HP_USBOTG_PHY_S  0
/** HP_PERI1_PMS_READ_REE0_HP_USBOTG_PHY : R/W; bitpos: [1]; default: 0;
 *  Configures hp_usbotg_phy registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_REE0_HP_USBOTG_PHY    (BIT(1))
#define HP_PERI1_PMS_READ_REE0_HP_USBOTG_PHY_M  (HP_PERI1_PMS_READ_REE0_HP_USBOTG_PHY_V << HP_PERI1_PMS_READ_REE0_HP_USBOTG_PHY_S)
#define HP_PERI1_PMS_READ_REE0_HP_USBOTG_PHY_V  0x00000001U
#define HP_PERI1_PMS_READ_REE0_HP_USBOTG_PHY_S  1
/** HP_PERI1_PMS_READ_REE1_HP_USBOTG_PHY : R/W; bitpos: [2]; default: 0;
 *  Configures hp_usbotg_phy registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_REE1_HP_USBOTG_PHY    (BIT(2))
#define HP_PERI1_PMS_READ_REE1_HP_USBOTG_PHY_M  (HP_PERI1_PMS_READ_REE1_HP_USBOTG_PHY_V << HP_PERI1_PMS_READ_REE1_HP_USBOTG_PHY_S)
#define HP_PERI1_PMS_READ_REE1_HP_USBOTG_PHY_V  0x00000001U
#define HP_PERI1_PMS_READ_REE1_HP_USBOTG_PHY_S  2
/** HP_PERI1_PMS_READ_REE2_HP_USBOTG_PHY : R/W; bitpos: [3]; default: 0;
 *  Configures hp_usbotg_phy registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_REE2_HP_USBOTG_PHY    (BIT(3))
#define HP_PERI1_PMS_READ_REE2_HP_USBOTG_PHY_M  (HP_PERI1_PMS_READ_REE2_HP_USBOTG_PHY_V << HP_PERI1_PMS_READ_REE2_HP_USBOTG_PHY_S)
#define HP_PERI1_PMS_READ_REE2_HP_USBOTG_PHY_V  0x00000001U
#define HP_PERI1_PMS_READ_REE2_HP_USBOTG_PHY_S  3
/** HP_PERI1_PMS_WRITE_TEE_HP_USBOTG_PHY : R/W; bitpos: [4]; default: 1;
 *  Configures hp_usbotg_phy registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_TEE_HP_USBOTG_PHY    (BIT(4))
#define HP_PERI1_PMS_WRITE_TEE_HP_USBOTG_PHY_M  (HP_PERI1_PMS_WRITE_TEE_HP_USBOTG_PHY_V << HP_PERI1_PMS_WRITE_TEE_HP_USBOTG_PHY_S)
#define HP_PERI1_PMS_WRITE_TEE_HP_USBOTG_PHY_V  0x00000001U
#define HP_PERI1_PMS_WRITE_TEE_HP_USBOTG_PHY_S  4
/** HP_PERI1_PMS_WRITE_REE0_HP_USBOTG_PHY : R/W; bitpos: [5]; default: 0;
 *  Configures hp_usbotg_phy registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_REE0_HP_USBOTG_PHY    (BIT(5))
#define HP_PERI1_PMS_WRITE_REE0_HP_USBOTG_PHY_M  (HP_PERI1_PMS_WRITE_REE0_HP_USBOTG_PHY_V << HP_PERI1_PMS_WRITE_REE0_HP_USBOTG_PHY_S)
#define HP_PERI1_PMS_WRITE_REE0_HP_USBOTG_PHY_V  0x00000001U
#define HP_PERI1_PMS_WRITE_REE0_HP_USBOTG_PHY_S  5
/** HP_PERI1_PMS_WRITE_REE1_HP_USBOTG_PHY : R/W; bitpos: [6]; default: 0;
 *  Configures hp_usbotg_phy registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_REE1_HP_USBOTG_PHY    (BIT(6))
#define HP_PERI1_PMS_WRITE_REE1_HP_USBOTG_PHY_M  (HP_PERI1_PMS_WRITE_REE1_HP_USBOTG_PHY_V << HP_PERI1_PMS_WRITE_REE1_HP_USBOTG_PHY_S)
#define HP_PERI1_PMS_WRITE_REE1_HP_USBOTG_PHY_V  0x00000001U
#define HP_PERI1_PMS_WRITE_REE1_HP_USBOTG_PHY_S  6
/** HP_PERI1_PMS_WRITE_REE2_HP_USBOTG_PHY : R/W; bitpos: [7]; default: 0;
 *  Configures hp_usbotg_phy registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_REE2_HP_USBOTG_PHY    (BIT(7))
#define HP_PERI1_PMS_WRITE_REE2_HP_USBOTG_PHY_M  (HP_PERI1_PMS_WRITE_REE2_HP_USBOTG_PHY_V << HP_PERI1_PMS_WRITE_REE2_HP_USBOTG_PHY_S)
#define HP_PERI1_PMS_WRITE_REE2_HP_USBOTG_PHY_V  0x00000001U
#define HP_PERI1_PMS_WRITE_REE2_HP_USBOTG_PHY_S  7
/** HP_PERI1_PMS_HP_USBOTG_PHY_LOCK : R/W; bitpos: [8]; default: 0;
 *  Set 1 to lock hp_usbotg_phy peri_apm configuration
 */
#define HP_PERI1_PMS_HP_USBOTG_PHY_LOCK    (BIT(8))
#define HP_PERI1_PMS_HP_USBOTG_PHY_LOCK_M  (HP_PERI1_PMS_HP_USBOTG_PHY_LOCK_V << HP_PERI1_PMS_HP_USBOTG_PHY_LOCK_S)
#define HP_PERI1_PMS_HP_USBOTG_PHY_LOCK_V  0x00000001U
#define HP_PERI1_PMS_HP_USBOTG_PHY_LOCK_S  8

/** HP_PERI1_PMS_HP_MCPWM0_CTRL_REG register
 *  hp_mcpwm0 read/write control register
 */
#define HP_PERI1_PMS_HP_MCPWM0_CTRL_REG (DR_REG_HP_PERI1_PMS_BASE + 0x4)
/** HP_PERI1_PMS_READ_TEE_HP_MCPWM0 : R/W; bitpos: [0]; default: 1;
 *  Configures hp_mcpwm0 registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_TEE_HP_MCPWM0    (BIT(0))
#define HP_PERI1_PMS_READ_TEE_HP_MCPWM0_M  (HP_PERI1_PMS_READ_TEE_HP_MCPWM0_V << HP_PERI1_PMS_READ_TEE_HP_MCPWM0_S)
#define HP_PERI1_PMS_READ_TEE_HP_MCPWM0_V  0x00000001U
#define HP_PERI1_PMS_READ_TEE_HP_MCPWM0_S  0
/** HP_PERI1_PMS_READ_REE0_HP_MCPWM0 : R/W; bitpos: [1]; default: 0;
 *  Configures hp_mcpwm0 registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_REE0_HP_MCPWM0    (BIT(1))
#define HP_PERI1_PMS_READ_REE0_HP_MCPWM0_M  (HP_PERI1_PMS_READ_REE0_HP_MCPWM0_V << HP_PERI1_PMS_READ_REE0_HP_MCPWM0_S)
#define HP_PERI1_PMS_READ_REE0_HP_MCPWM0_V  0x00000001U
#define HP_PERI1_PMS_READ_REE0_HP_MCPWM0_S  1
/** HP_PERI1_PMS_READ_REE1_HP_MCPWM0 : R/W; bitpos: [2]; default: 0;
 *  Configures hp_mcpwm0 registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_REE1_HP_MCPWM0    (BIT(2))
#define HP_PERI1_PMS_READ_REE1_HP_MCPWM0_M  (HP_PERI1_PMS_READ_REE1_HP_MCPWM0_V << HP_PERI1_PMS_READ_REE1_HP_MCPWM0_S)
#define HP_PERI1_PMS_READ_REE1_HP_MCPWM0_V  0x00000001U
#define HP_PERI1_PMS_READ_REE1_HP_MCPWM0_S  2
/** HP_PERI1_PMS_READ_REE2_HP_MCPWM0 : R/W; bitpos: [3]; default: 0;
 *  Configures hp_mcpwm0 registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_REE2_HP_MCPWM0    (BIT(3))
#define HP_PERI1_PMS_READ_REE2_HP_MCPWM0_M  (HP_PERI1_PMS_READ_REE2_HP_MCPWM0_V << HP_PERI1_PMS_READ_REE2_HP_MCPWM0_S)
#define HP_PERI1_PMS_READ_REE2_HP_MCPWM0_V  0x00000001U
#define HP_PERI1_PMS_READ_REE2_HP_MCPWM0_S  3
/** HP_PERI1_PMS_WRITE_TEE_HP_MCPWM0 : R/W; bitpos: [4]; default: 1;
 *  Configures hp_mcpwm0 registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_TEE_HP_MCPWM0    (BIT(4))
#define HP_PERI1_PMS_WRITE_TEE_HP_MCPWM0_M  (HP_PERI1_PMS_WRITE_TEE_HP_MCPWM0_V << HP_PERI1_PMS_WRITE_TEE_HP_MCPWM0_S)
#define HP_PERI1_PMS_WRITE_TEE_HP_MCPWM0_V  0x00000001U
#define HP_PERI1_PMS_WRITE_TEE_HP_MCPWM0_S  4
/** HP_PERI1_PMS_WRITE_REE0_HP_MCPWM0 : R/W; bitpos: [5]; default: 0;
 *  Configures hp_mcpwm0 registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_REE0_HP_MCPWM0    (BIT(5))
#define HP_PERI1_PMS_WRITE_REE0_HP_MCPWM0_M  (HP_PERI1_PMS_WRITE_REE0_HP_MCPWM0_V << HP_PERI1_PMS_WRITE_REE0_HP_MCPWM0_S)
#define HP_PERI1_PMS_WRITE_REE0_HP_MCPWM0_V  0x00000001U
#define HP_PERI1_PMS_WRITE_REE0_HP_MCPWM0_S  5
/** HP_PERI1_PMS_WRITE_REE1_HP_MCPWM0 : R/W; bitpos: [6]; default: 0;
 *  Configures hp_mcpwm0 registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_REE1_HP_MCPWM0    (BIT(6))
#define HP_PERI1_PMS_WRITE_REE1_HP_MCPWM0_M  (HP_PERI1_PMS_WRITE_REE1_HP_MCPWM0_V << HP_PERI1_PMS_WRITE_REE1_HP_MCPWM0_S)
#define HP_PERI1_PMS_WRITE_REE1_HP_MCPWM0_V  0x00000001U
#define HP_PERI1_PMS_WRITE_REE1_HP_MCPWM0_S  6
/** HP_PERI1_PMS_WRITE_REE2_HP_MCPWM0 : R/W; bitpos: [7]; default: 0;
 *  Configures hp_mcpwm0 registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_REE2_HP_MCPWM0    (BIT(7))
#define HP_PERI1_PMS_WRITE_REE2_HP_MCPWM0_M  (HP_PERI1_PMS_WRITE_REE2_HP_MCPWM0_V << HP_PERI1_PMS_WRITE_REE2_HP_MCPWM0_S)
#define HP_PERI1_PMS_WRITE_REE2_HP_MCPWM0_V  0x00000001U
#define HP_PERI1_PMS_WRITE_REE2_HP_MCPWM0_S  7
/** HP_PERI1_PMS_HP_MCPWM0_LOCK : R/W; bitpos: [8]; default: 0;
 *  Set 1 to lock hp_mcpwm0 peri_apm configuration
 */
#define HP_PERI1_PMS_HP_MCPWM0_LOCK    (BIT(8))
#define HP_PERI1_PMS_HP_MCPWM0_LOCK_M  (HP_PERI1_PMS_HP_MCPWM0_LOCK_V << HP_PERI1_PMS_HP_MCPWM0_LOCK_S)
#define HP_PERI1_PMS_HP_MCPWM0_LOCK_V  0x00000001U
#define HP_PERI1_PMS_HP_MCPWM0_LOCK_S  8

/** HP_PERI1_PMS_HP_MCPWM1_CTRL_REG register
 *  hp_mcpwm1 read/write control register
 */
#define HP_PERI1_PMS_HP_MCPWM1_CTRL_REG (DR_REG_HP_PERI1_PMS_BASE + 0x8)
/** HP_PERI1_PMS_READ_TEE_HP_MCPWM1 : R/W; bitpos: [0]; default: 1;
 *  Configures hp_mcpwm1 registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_TEE_HP_MCPWM1    (BIT(0))
#define HP_PERI1_PMS_READ_TEE_HP_MCPWM1_M  (HP_PERI1_PMS_READ_TEE_HP_MCPWM1_V << HP_PERI1_PMS_READ_TEE_HP_MCPWM1_S)
#define HP_PERI1_PMS_READ_TEE_HP_MCPWM1_V  0x00000001U
#define HP_PERI1_PMS_READ_TEE_HP_MCPWM1_S  0
/** HP_PERI1_PMS_READ_REE0_HP_MCPWM1 : R/W; bitpos: [1]; default: 0;
 *  Configures hp_mcpwm1 registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_REE0_HP_MCPWM1    (BIT(1))
#define HP_PERI1_PMS_READ_REE0_HP_MCPWM1_M  (HP_PERI1_PMS_READ_REE0_HP_MCPWM1_V << HP_PERI1_PMS_READ_REE0_HP_MCPWM1_S)
#define HP_PERI1_PMS_READ_REE0_HP_MCPWM1_V  0x00000001U
#define HP_PERI1_PMS_READ_REE0_HP_MCPWM1_S  1
/** HP_PERI1_PMS_READ_REE1_HP_MCPWM1 : R/W; bitpos: [2]; default: 0;
 *  Configures hp_mcpwm1 registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_REE1_HP_MCPWM1    (BIT(2))
#define HP_PERI1_PMS_READ_REE1_HP_MCPWM1_M  (HP_PERI1_PMS_READ_REE1_HP_MCPWM1_V << HP_PERI1_PMS_READ_REE1_HP_MCPWM1_S)
#define HP_PERI1_PMS_READ_REE1_HP_MCPWM1_V  0x00000001U
#define HP_PERI1_PMS_READ_REE1_HP_MCPWM1_S  2
/** HP_PERI1_PMS_READ_REE2_HP_MCPWM1 : R/W; bitpos: [3]; default: 0;
 *  Configures hp_mcpwm1 registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_REE2_HP_MCPWM1    (BIT(3))
#define HP_PERI1_PMS_READ_REE2_HP_MCPWM1_M  (HP_PERI1_PMS_READ_REE2_HP_MCPWM1_V << HP_PERI1_PMS_READ_REE2_HP_MCPWM1_S)
#define HP_PERI1_PMS_READ_REE2_HP_MCPWM1_V  0x00000001U
#define HP_PERI1_PMS_READ_REE2_HP_MCPWM1_S  3
/** HP_PERI1_PMS_WRITE_TEE_HP_MCPWM1 : R/W; bitpos: [4]; default: 1;
 *  Configures hp_mcpwm1 registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_TEE_HP_MCPWM1    (BIT(4))
#define HP_PERI1_PMS_WRITE_TEE_HP_MCPWM1_M  (HP_PERI1_PMS_WRITE_TEE_HP_MCPWM1_V << HP_PERI1_PMS_WRITE_TEE_HP_MCPWM1_S)
#define HP_PERI1_PMS_WRITE_TEE_HP_MCPWM1_V  0x00000001U
#define HP_PERI1_PMS_WRITE_TEE_HP_MCPWM1_S  4
/** HP_PERI1_PMS_WRITE_REE0_HP_MCPWM1 : R/W; bitpos: [5]; default: 0;
 *  Configures hp_mcpwm1 registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_REE0_HP_MCPWM1    (BIT(5))
#define HP_PERI1_PMS_WRITE_REE0_HP_MCPWM1_M  (HP_PERI1_PMS_WRITE_REE0_HP_MCPWM1_V << HP_PERI1_PMS_WRITE_REE0_HP_MCPWM1_S)
#define HP_PERI1_PMS_WRITE_REE0_HP_MCPWM1_V  0x00000001U
#define HP_PERI1_PMS_WRITE_REE0_HP_MCPWM1_S  5
/** HP_PERI1_PMS_WRITE_REE1_HP_MCPWM1 : R/W; bitpos: [6]; default: 0;
 *  Configures hp_mcpwm1 registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_REE1_HP_MCPWM1    (BIT(6))
#define HP_PERI1_PMS_WRITE_REE1_HP_MCPWM1_M  (HP_PERI1_PMS_WRITE_REE1_HP_MCPWM1_V << HP_PERI1_PMS_WRITE_REE1_HP_MCPWM1_S)
#define HP_PERI1_PMS_WRITE_REE1_HP_MCPWM1_V  0x00000001U
#define HP_PERI1_PMS_WRITE_REE1_HP_MCPWM1_S  6
/** HP_PERI1_PMS_WRITE_REE2_HP_MCPWM1 : R/W; bitpos: [7]; default: 0;
 *  Configures hp_mcpwm1 registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_REE2_HP_MCPWM1    (BIT(7))
#define HP_PERI1_PMS_WRITE_REE2_HP_MCPWM1_M  (HP_PERI1_PMS_WRITE_REE2_HP_MCPWM1_V << HP_PERI1_PMS_WRITE_REE2_HP_MCPWM1_S)
#define HP_PERI1_PMS_WRITE_REE2_HP_MCPWM1_V  0x00000001U
#define HP_PERI1_PMS_WRITE_REE2_HP_MCPWM1_S  7
/** HP_PERI1_PMS_HP_MCPWM1_LOCK : R/W; bitpos: [8]; default: 0;
 *  Set 1 to lock hp_mcpwm1 peri_apm configuration
 */
#define HP_PERI1_PMS_HP_MCPWM1_LOCK    (BIT(8))
#define HP_PERI1_PMS_HP_MCPWM1_LOCK_M  (HP_PERI1_PMS_HP_MCPWM1_LOCK_V << HP_PERI1_PMS_HP_MCPWM1_LOCK_S)
#define HP_PERI1_PMS_HP_MCPWM1_LOCK_V  0x00000001U
#define HP_PERI1_PMS_HP_MCPWM1_LOCK_S  8

/** HP_PERI1_PMS_HP_MCPWM2_CTRL_REG register
 *  hp_mcpwm2 read/write control register
 */
#define HP_PERI1_PMS_HP_MCPWM2_CTRL_REG (DR_REG_HP_PERI1_PMS_BASE + 0xc)
/** HP_PERI1_PMS_READ_TEE_HP_MCPWM2 : R/W; bitpos: [0]; default: 1;
 *  Configures hp_mcpwm2 registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_TEE_HP_MCPWM2    (BIT(0))
#define HP_PERI1_PMS_READ_TEE_HP_MCPWM2_M  (HP_PERI1_PMS_READ_TEE_HP_MCPWM2_V << HP_PERI1_PMS_READ_TEE_HP_MCPWM2_S)
#define HP_PERI1_PMS_READ_TEE_HP_MCPWM2_V  0x00000001U
#define HP_PERI1_PMS_READ_TEE_HP_MCPWM2_S  0
/** HP_PERI1_PMS_READ_REE0_HP_MCPWM2 : R/W; bitpos: [1]; default: 0;
 *  Configures hp_mcpwm2 registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_REE0_HP_MCPWM2    (BIT(1))
#define HP_PERI1_PMS_READ_REE0_HP_MCPWM2_M  (HP_PERI1_PMS_READ_REE0_HP_MCPWM2_V << HP_PERI1_PMS_READ_REE0_HP_MCPWM2_S)
#define HP_PERI1_PMS_READ_REE0_HP_MCPWM2_V  0x00000001U
#define HP_PERI1_PMS_READ_REE0_HP_MCPWM2_S  1
/** HP_PERI1_PMS_READ_REE1_HP_MCPWM2 : R/W; bitpos: [2]; default: 0;
 *  Configures hp_mcpwm2 registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_REE1_HP_MCPWM2    (BIT(2))
#define HP_PERI1_PMS_READ_REE1_HP_MCPWM2_M  (HP_PERI1_PMS_READ_REE1_HP_MCPWM2_V << HP_PERI1_PMS_READ_REE1_HP_MCPWM2_S)
#define HP_PERI1_PMS_READ_REE1_HP_MCPWM2_V  0x00000001U
#define HP_PERI1_PMS_READ_REE1_HP_MCPWM2_S  2
/** HP_PERI1_PMS_READ_REE2_HP_MCPWM2 : R/W; bitpos: [3]; default: 0;
 *  Configures hp_mcpwm2 registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_REE2_HP_MCPWM2    (BIT(3))
#define HP_PERI1_PMS_READ_REE2_HP_MCPWM2_M  (HP_PERI1_PMS_READ_REE2_HP_MCPWM2_V << HP_PERI1_PMS_READ_REE2_HP_MCPWM2_S)
#define HP_PERI1_PMS_READ_REE2_HP_MCPWM2_V  0x00000001U
#define HP_PERI1_PMS_READ_REE2_HP_MCPWM2_S  3
/** HP_PERI1_PMS_WRITE_TEE_HP_MCPWM2 : R/W; bitpos: [4]; default: 1;
 *  Configures hp_mcpwm2 registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_TEE_HP_MCPWM2    (BIT(4))
#define HP_PERI1_PMS_WRITE_TEE_HP_MCPWM2_M  (HP_PERI1_PMS_WRITE_TEE_HP_MCPWM2_V << HP_PERI1_PMS_WRITE_TEE_HP_MCPWM2_S)
#define HP_PERI1_PMS_WRITE_TEE_HP_MCPWM2_V  0x00000001U
#define HP_PERI1_PMS_WRITE_TEE_HP_MCPWM2_S  4
/** HP_PERI1_PMS_WRITE_REE0_HP_MCPWM2 : R/W; bitpos: [5]; default: 0;
 *  Configures hp_mcpwm2 registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_REE0_HP_MCPWM2    (BIT(5))
#define HP_PERI1_PMS_WRITE_REE0_HP_MCPWM2_M  (HP_PERI1_PMS_WRITE_REE0_HP_MCPWM2_V << HP_PERI1_PMS_WRITE_REE0_HP_MCPWM2_S)
#define HP_PERI1_PMS_WRITE_REE0_HP_MCPWM2_V  0x00000001U
#define HP_PERI1_PMS_WRITE_REE0_HP_MCPWM2_S  5
/** HP_PERI1_PMS_WRITE_REE1_HP_MCPWM2 : R/W; bitpos: [6]; default: 0;
 *  Configures hp_mcpwm2 registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_REE1_HP_MCPWM2    (BIT(6))
#define HP_PERI1_PMS_WRITE_REE1_HP_MCPWM2_M  (HP_PERI1_PMS_WRITE_REE1_HP_MCPWM2_V << HP_PERI1_PMS_WRITE_REE1_HP_MCPWM2_S)
#define HP_PERI1_PMS_WRITE_REE1_HP_MCPWM2_V  0x00000001U
#define HP_PERI1_PMS_WRITE_REE1_HP_MCPWM2_S  6
/** HP_PERI1_PMS_WRITE_REE2_HP_MCPWM2 : R/W; bitpos: [7]; default: 0;
 *  Configures hp_mcpwm2 registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_REE2_HP_MCPWM2    (BIT(7))
#define HP_PERI1_PMS_WRITE_REE2_HP_MCPWM2_M  (HP_PERI1_PMS_WRITE_REE2_HP_MCPWM2_V << HP_PERI1_PMS_WRITE_REE2_HP_MCPWM2_S)
#define HP_PERI1_PMS_WRITE_REE2_HP_MCPWM2_V  0x00000001U
#define HP_PERI1_PMS_WRITE_REE2_HP_MCPWM2_S  7
/** HP_PERI1_PMS_HP_MCPWM2_LOCK : R/W; bitpos: [8]; default: 0;
 *  Set 1 to lock hp_mcpwm2 peri_apm configuration
 */
#define HP_PERI1_PMS_HP_MCPWM2_LOCK    (BIT(8))
#define HP_PERI1_PMS_HP_MCPWM2_LOCK_M  (HP_PERI1_PMS_HP_MCPWM2_LOCK_V << HP_PERI1_PMS_HP_MCPWM2_LOCK_S)
#define HP_PERI1_PMS_HP_MCPWM2_LOCK_V  0x00000001U
#define HP_PERI1_PMS_HP_MCPWM2_LOCK_S  8

/** HP_PERI1_PMS_HP_MCPWM3_CTRL_REG register
 *  hp_mcpwm3 read/write control register
 */
#define HP_PERI1_PMS_HP_MCPWM3_CTRL_REG (DR_REG_HP_PERI1_PMS_BASE + 0x10)
/** HP_PERI1_PMS_READ_TEE_HP_MCPWM3 : R/W; bitpos: [0]; default: 1;
 *  Configures hp_mcpwm3 registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_TEE_HP_MCPWM3    (BIT(0))
#define HP_PERI1_PMS_READ_TEE_HP_MCPWM3_M  (HP_PERI1_PMS_READ_TEE_HP_MCPWM3_V << HP_PERI1_PMS_READ_TEE_HP_MCPWM3_S)
#define HP_PERI1_PMS_READ_TEE_HP_MCPWM3_V  0x00000001U
#define HP_PERI1_PMS_READ_TEE_HP_MCPWM3_S  0
/** HP_PERI1_PMS_READ_REE0_HP_MCPWM3 : R/W; bitpos: [1]; default: 0;
 *  Configures hp_mcpwm3 registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_REE0_HP_MCPWM3    (BIT(1))
#define HP_PERI1_PMS_READ_REE0_HP_MCPWM3_M  (HP_PERI1_PMS_READ_REE0_HP_MCPWM3_V << HP_PERI1_PMS_READ_REE0_HP_MCPWM3_S)
#define HP_PERI1_PMS_READ_REE0_HP_MCPWM3_V  0x00000001U
#define HP_PERI1_PMS_READ_REE0_HP_MCPWM3_S  1
/** HP_PERI1_PMS_READ_REE1_HP_MCPWM3 : R/W; bitpos: [2]; default: 0;
 *  Configures hp_mcpwm3 registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_REE1_HP_MCPWM3    (BIT(2))
#define HP_PERI1_PMS_READ_REE1_HP_MCPWM3_M  (HP_PERI1_PMS_READ_REE1_HP_MCPWM3_V << HP_PERI1_PMS_READ_REE1_HP_MCPWM3_S)
#define HP_PERI1_PMS_READ_REE1_HP_MCPWM3_V  0x00000001U
#define HP_PERI1_PMS_READ_REE1_HP_MCPWM3_S  2
/** HP_PERI1_PMS_READ_REE2_HP_MCPWM3 : R/W; bitpos: [3]; default: 0;
 *  Configures hp_mcpwm3 registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_REE2_HP_MCPWM3    (BIT(3))
#define HP_PERI1_PMS_READ_REE2_HP_MCPWM3_M  (HP_PERI1_PMS_READ_REE2_HP_MCPWM3_V << HP_PERI1_PMS_READ_REE2_HP_MCPWM3_S)
#define HP_PERI1_PMS_READ_REE2_HP_MCPWM3_V  0x00000001U
#define HP_PERI1_PMS_READ_REE2_HP_MCPWM3_S  3
/** HP_PERI1_PMS_WRITE_TEE_HP_MCPWM3 : R/W; bitpos: [4]; default: 1;
 *  Configures hp_mcpwm3 registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_TEE_HP_MCPWM3    (BIT(4))
#define HP_PERI1_PMS_WRITE_TEE_HP_MCPWM3_M  (HP_PERI1_PMS_WRITE_TEE_HP_MCPWM3_V << HP_PERI1_PMS_WRITE_TEE_HP_MCPWM3_S)
#define HP_PERI1_PMS_WRITE_TEE_HP_MCPWM3_V  0x00000001U
#define HP_PERI1_PMS_WRITE_TEE_HP_MCPWM3_S  4
/** HP_PERI1_PMS_WRITE_REE0_HP_MCPWM3 : R/W; bitpos: [5]; default: 0;
 *  Configures hp_mcpwm3 registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_REE0_HP_MCPWM3    (BIT(5))
#define HP_PERI1_PMS_WRITE_REE0_HP_MCPWM3_M  (HP_PERI1_PMS_WRITE_REE0_HP_MCPWM3_V << HP_PERI1_PMS_WRITE_REE0_HP_MCPWM3_S)
#define HP_PERI1_PMS_WRITE_REE0_HP_MCPWM3_V  0x00000001U
#define HP_PERI1_PMS_WRITE_REE0_HP_MCPWM3_S  5
/** HP_PERI1_PMS_WRITE_REE1_HP_MCPWM3 : R/W; bitpos: [6]; default: 0;
 *  Configures hp_mcpwm3 registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_REE1_HP_MCPWM3    (BIT(6))
#define HP_PERI1_PMS_WRITE_REE1_HP_MCPWM3_M  (HP_PERI1_PMS_WRITE_REE1_HP_MCPWM3_V << HP_PERI1_PMS_WRITE_REE1_HP_MCPWM3_S)
#define HP_PERI1_PMS_WRITE_REE1_HP_MCPWM3_V  0x00000001U
#define HP_PERI1_PMS_WRITE_REE1_HP_MCPWM3_S  6
/** HP_PERI1_PMS_WRITE_REE2_HP_MCPWM3 : R/W; bitpos: [7]; default: 0;
 *  Configures hp_mcpwm3 registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_REE2_HP_MCPWM3    (BIT(7))
#define HP_PERI1_PMS_WRITE_REE2_HP_MCPWM3_M  (HP_PERI1_PMS_WRITE_REE2_HP_MCPWM3_V << HP_PERI1_PMS_WRITE_REE2_HP_MCPWM3_S)
#define HP_PERI1_PMS_WRITE_REE2_HP_MCPWM3_V  0x00000001U
#define HP_PERI1_PMS_WRITE_REE2_HP_MCPWM3_S  7
/** HP_PERI1_PMS_HP_MCPWM3_LOCK : R/W; bitpos: [8]; default: 0;
 *  Set 1 to lock hp_mcpwm3 peri_apm configuration
 */
#define HP_PERI1_PMS_HP_MCPWM3_LOCK    (BIT(8))
#define HP_PERI1_PMS_HP_MCPWM3_LOCK_M  (HP_PERI1_PMS_HP_MCPWM3_LOCK_V << HP_PERI1_PMS_HP_MCPWM3_LOCK_S)
#define HP_PERI1_PMS_HP_MCPWM3_LOCK_V  0x00000001U
#define HP_PERI1_PMS_HP_MCPWM3_LOCK_S  8

