espressif/esp-idf/components/soc/esp32s31/register/soc/hp_peri1_pms_reg.h
/** HP_PERI1_PMS_HP_UART0_CTRL_REG register
 *  hp_uart0 read/write control register
 */
#define HP_PERI1_PMS_HP_UART0_CTRL_REG (DR_REG_HP_PERI1_PMS_BASE + 0x28)
/** HP_PERI1_PMS_READ_TEE_HP_UART0 : R/W; bitpos: [0]; default: 1;
 *  Configures hp_uart0 registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_TEE_HP_UART0    (BIT(0))
#define HP_PERI1_PMS_READ_TEE_HP_UART0_M  (HP_PERI1_PMS_READ_TEE_HP_UART0_V << HP_PERI1_PMS_READ_TEE_HP_UART0_S)
#define HP_PERI1_PMS_READ_TEE_HP_UART0_V  0x00000001U
#define HP_PERI1_PMS_READ_TEE_HP_UART0_S  0
/** HP_PERI1_PMS_READ_REE0_HP_UART0 : R/W; bitpos: [1]; default: 0;
 *  Configures hp_uart0 registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_REE0_HP_UART0    (BIT(1))
#define HP_PERI1_PMS_READ_REE0_HP_UART0_M  (HP_PERI1_PMS_READ_REE0_HP_UART0_V << HP_PERI1_PMS_READ_REE0_HP_UART0_S)
#define HP_PERI1_PMS_READ_REE0_HP_UART0_V  0x00000001U
#define HP_PERI1_PMS_READ_REE0_HP_UART0_S  1
/** HP_PERI1_PMS_READ_REE1_HP_UART0 : R/W; bitpos: [2]; default: 0;
 *  Configures hp_uart0 registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_REE1_HP_UART0    (BIT(2))
#define HP_PERI1_PMS_READ_REE1_HP_UART0_M  (HP_PERI1_PMS_READ_REE1_HP_UART0_V << HP_PERI1_PMS_READ_REE1_HP_UART0_S)
#define HP_PERI1_PMS_READ_REE1_HP_UART0_V  0x00000001U
#define HP_PERI1_PMS_READ_REE1_HP_UART0_S  2
/** HP_PERI1_PMS_READ_REE2_HP_UART0 : R/W; bitpos: [3]; default: 0;
 *  Configures hp_uart0 registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_REE2_HP_UART0    (BIT(3))
#define HP_PERI1_PMS_READ_REE2_HP_UART0_M  (HP_PERI1_PMS_READ_REE2_HP_UART0_V << HP_PERI1_PMS_READ_REE2_HP_UART0_S)
#define HP_PERI1_PMS_READ_REE2_HP_UART0_V  0x00000001U
#define HP_PERI1_PMS_READ_REE2_HP_UART0_S  3
/** HP_PERI1_PMS_WRITE_TEE_HP_UART0 : R/W; bitpos: [4]; default: 1;
 *  Configures hp_uart0 registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_TEE_HP_UART0    (BIT(4))
#define HP_PERI1_PMS_WRITE_TEE_HP_UART0_M  (HP_PERI1_PMS_WRITE_TEE_HP_UART0_V << HP_PERI1_PMS_WRITE_TEE_HP_UART0_S)
#define HP_PERI1_PMS_WRITE_TEE_HP_UART0_V  0x00000001U
#define HP_PERI1_PMS_WRITE_TEE_HP_UART0_S  4
/** HP_PERI1_PMS_WRITE_REE0_HP_UART0 : R/W; bitpos: [5]; default: 0;
 *  Configures hp_uart0 registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_REE0_HP_UART0    (BIT(5))
#define HP_PERI1_PMS_WRITE_REE0_HP_UART0_M  (HP_PERI1_PMS_WRITE_REE0_HP_UART0_V << HP_PERI1_PMS_WRITE_REE0_HP_UART0_S)
#define HP_PERI1_PMS_WRITE_REE0_HP_UART0_V  0x00000001U
#define HP_PERI1_PMS_WRITE_REE0_HP_UART0_S  5
/** HP_PERI1_PMS_WRITE_REE1_HP_UART0 : R/W; bitpos: [6]; default: 0;
 *  Configures hp_uart0 registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_REE1_HP_UART0    (BIT(6))
#define HP_PERI1_PMS_WRITE_REE1_HP_UART0_M  (HP_PERI1_PMS_WRITE_REE1_HP_UART0_V << HP_PERI1_PMS_WRITE_REE1_HP_UART0_S)
#define HP_PERI1_PMS_WRITE_REE1_HP_UART0_V  0x00000001U
#define HP_PERI1_PMS_WRITE_REE1_HP_UART0_S  6
/** HP_PERI1_PMS_WRITE_REE2_HP_UART0 : R/W; bitpos: [7]; default: 0;
 *  Configures hp_uart0 registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_REE2_HP_UART0    (BIT(7))
#define HP_PERI1_PMS_WRITE_REE2_HP_UART0_M  (HP_PERI1_PMS_WRITE_REE2_HP_UART0_V << HP_PERI1_PMS_WRITE_REE2_HP_UART0_S)
#define HP_PERI1_PMS_WRITE_REE2_HP_UART0_V  0x00000001U
#define HP_PERI1_PMS_WRITE_REE2_HP_UART0_S  7
/** HP_PERI1_PMS_HP_UART0_LOCK : R/W; bitpos: [8]; default: 0;
 *  Set 1 to lock hp_uart0 peri_apm configuration
 */
#define HP_PERI1_PMS_HP_UART0_LOCK    (BIT(8))
#define HP_PERI1_PMS_HP_UART0_LOCK_M  (HP_PERI1_PMS_HP_UART0_LOCK_V << HP_PERI1_PMS_HP_UART0_LOCK_S)
#define HP_PERI1_PMS_HP_UART0_LOCK_V  0x00000001U
#define HP_PERI1_PMS_HP_UART0_LOCK_S  8

/** HP_PERI1_PMS_HP_UART1_CTRL_REG register
 *  hp_uart1 read/write control register
 */
#define HP_PERI1_PMS_HP_UART1_CTRL_REG (DR_REG_HP_PERI1_PMS_BASE + 0x2c)
/** HP_PERI1_PMS_READ_TEE_HP_UART1 : R/W; bitpos: [0]; default: 1;
 *  Configures hp_uart1 registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_TEE_HP_UART1    (BIT(0))
#define HP_PERI1_PMS_READ_TEE_HP_UART1_M  (HP_PERI1_PMS_READ_TEE_HP_UART1_V << HP_PERI1_PMS_READ_TEE_HP_UART1_S)
#define HP_PERI1_PMS_READ_TEE_HP_UART1_V  0x00000001U
#define HP_PERI1_PMS_READ_TEE_HP_UART1_S  0
/** HP_PERI1_PMS_READ_REE0_HP_UART1 : R/W; bitpos: [1]; default: 0;
 *  Configures hp_uart1 registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_REE0_HP_UART1    (BIT(1))
#define HP_PERI1_PMS_READ_REE0_HP_UART1_M  (HP_PERI1_PMS_READ_REE0_HP_UART1_V << HP_PERI1_PMS_READ_REE0_HP_UART1_S)
#define HP_PERI1_PMS_READ_REE0_HP_UART1_V  0x00000001U
#define HP_PERI1_PMS_READ_REE0_HP_UART1_S  1
/** HP_PERI1_PMS_READ_REE1_HP_UART1 : R/W; bitpos: [2]; default: 0;
 *  Configures hp_uart1 registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_REE1_HP_UART1    (BIT(2))
#define HP_PERI1_PMS_READ_REE1_HP_UART1_M  (HP_PERI1_PMS_READ_REE1_HP_UART1_V << HP_PERI1_PMS_READ_REE1_HP_UART1_S)
#define HP_PERI1_PMS_READ_REE1_HP_UART1_V  0x00000001U
#define HP_PERI1_PMS_READ_REE1_HP_UART1_S  2
/** HP_PERI1_PMS_READ_REE2_HP_UART1 : R/W; bitpos: [3]; default: 0;
 *  Configures hp_uart1 registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_REE2_HP_UART1    (BIT(3))
#define HP_PERI1_PMS_READ_REE2_HP_UART1_M  (HP_PERI1_PMS_READ_REE2_HP_UART1_V << HP_PERI1_PMS_READ_REE2_HP_UART1_S)
#define HP_PERI1_PMS_READ_REE2_HP_UART1_V  0x00000001U
#define HP_PERI1_PMS_READ_REE2_HP_UART1_S  3
/** HP_PERI1_PMS_WRITE_TEE_HP_UART1 : R/W; bitpos: [4]; default: 1;
 *  Configures hp_uart1 registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_TEE_HP_UART1    (BIT(4))
#define HP_PERI1_PMS_WRITE_TEE_HP_UART1_M  (HP_PERI1_PMS_WRITE_TEE_HP_UART1_V << HP_PERI1_PMS_WRITE_TEE_HP_UART1_S)
#define HP_PERI1_PMS_WRITE_TEE_HP_UART1_V  0x00000001U
#define HP_PERI1_PMS_WRITE_TEE_HP_UART1_S  4
/** HP_PERI1_PMS_WRITE_REE0_HP_UART1 : R/W; bitpos: [5]; default: 0;
 *  Configures hp_uart1 registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_REE0_HP_UART1    (BIT(5))
#define HP_PERI1_PMS_WRITE_REE0_HP_UART1_M  (HP_PERI1_PMS_WRITE_REE0_HP_UART1_V << HP_PERI1_PMS_WRITE_REE0_HP_UART1_S)
#define HP_PERI1_PMS_WRITE_REE0_HP_UART1_V  0x00000001U
#define HP_PERI1_PMS_WRITE_REE0_HP_UART1_S  5
/** HP_PERI1_PMS_WRITE_REE1_HP_UART1 : R/W; bitpos: [6]; default: 0;
 *  Configures hp_uart1 registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_REE1_HP_UART1    (BIT(6))
#define HP_PERI1_PMS_WRITE_REE1_HP_UART1_M  (HP_PERI1_PMS_WRITE_REE1_HP_UART1_V << HP_PERI1_PMS_WRITE_REE1_HP_UART1_S)
#define HP_PERI1_PMS_WRITE_REE1_HP_UART1_V  0x00000001U
#define HP_PERI1_PMS_WRITE_REE1_HP_UART1_S  6
/** HP_PERI1_PMS_WRITE_REE2_HP_UART1 : R/W; bitpos: [7]; default: 0;
 *  Configures hp_uart1 registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_REE2_HP_UART1    (BIT(7))
#define HP_PERI1_PMS_WRITE_REE2_HP_UART1_M  (HP_PERI1_PMS_WRITE_REE2_HP_UART1_V << HP_PERI1_PMS_WRITE_REE2_HP_UART1_S)
#define HP_PERI1_PMS_WRITE_REE2_HP_UART1_V  0x00000001U
#define HP_PERI1_PMS_WRITE_REE2_HP_UART1_S  7
/** HP_PERI1_PMS_HP_UART1_LOCK : R/W; bitpos: [8]; default: 0;
 *  Set 1 to lock hp_uart1 peri_apm configuration
 */
#define HP_PERI1_PMS_HP_UART1_LOCK    (BIT(8))
#define HP_PERI1_PMS_HP_UART1_LOCK_M  (HP_PERI1_PMS_HP_UART1_LOCK_V << HP_PERI1_PMS_HP_UART1_LOCK_S)
#define HP_PERI1_PMS_HP_UART1_LOCK_V  0x00000001U
#define HP_PERI1_PMS_HP_UART1_LOCK_S  8

