espressif/esp-idf/components/soc/esp32s31/register/soc/hp_peri1_pms_reg.h
/** HP_PERI1_PMS_HP_UART2_CTRL_REG register
 *  hp_uart2 read/write control register
 */
#define HP_PERI1_PMS_HP_UART2_CTRL_REG (DR_REG_HP_PERI1_PMS_BASE + 0x30)
/** HP_PERI1_PMS_READ_TEE_HP_UART2 : R/W; bitpos: [0]; default: 1;
 *  Configures hp_uart2 registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_TEE_HP_UART2    (BIT(0))
#define HP_PERI1_PMS_READ_TEE_HP_UART2_M  (HP_PERI1_PMS_READ_TEE_HP_UART2_V << HP_PERI1_PMS_READ_TEE_HP_UART2_S)
#define HP_PERI1_PMS_READ_TEE_HP_UART2_V  0x00000001U
#define HP_PERI1_PMS_READ_TEE_HP_UART2_S  0
/** HP_PERI1_PMS_READ_REE0_HP_UART2 : R/W; bitpos: [1]; default: 0;
 *  Configures hp_uart2 registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_REE0_HP_UART2    (BIT(1))
#define HP_PERI1_PMS_READ_REE0_HP_UART2_M  (HP_PERI1_PMS_READ_REE0_HP_UART2_V << HP_PERI1_PMS_READ_REE0_HP_UART2_S)
#define HP_PERI1_PMS_READ_REE0_HP_UART2_V  0x00000001U
#define HP_PERI1_PMS_READ_REE0_HP_UART2_S  1
/** HP_PERI1_PMS_READ_REE1_HP_UART2 : R/W; bitpos: [2]; default: 0;
 *  Configures hp_uart2 registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_REE1_HP_UART2    (BIT(2))
#define HP_PERI1_PMS_READ_REE1_HP_UART2_M  (HP_PERI1_PMS_READ_REE1_HP_UART2_V << HP_PERI1_PMS_READ_REE1_HP_UART2_S)
#define HP_PERI1_PMS_READ_REE1_HP_UART2_V  0x00000001U
#define HP_PERI1_PMS_READ_REE1_HP_UART2_S  2
/** HP_PERI1_PMS_READ_REE2_HP_UART2 : R/W; bitpos: [3]; default: 0;
 *  Configures hp_uart2 registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_REE2_HP_UART2    (BIT(3))
#define HP_PERI1_PMS_READ_REE2_HP_UART2_M  (HP_PERI1_PMS_READ_REE2_HP_UART2_V << HP_PERI1_PMS_READ_REE2_HP_UART2_S)
#define HP_PERI1_PMS_READ_REE2_HP_UART2_V  0x00000001U
#define HP_PERI1_PMS_READ_REE2_HP_UART2_S  3
/** HP_PERI1_PMS_WRITE_TEE_HP_UART2 : R/W; bitpos: [4]; default: 1;
 *  Configures hp_uart2 registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_TEE_HP_UART2    (BIT(4))
#define HP_PERI1_PMS_WRITE_TEE_HP_UART2_M  (HP_PERI1_PMS_WRITE_TEE_HP_UART2_V << HP_PERI1_PMS_WRITE_TEE_HP_UART2_S)
#define HP_PERI1_PMS_WRITE_TEE_HP_UART2_V  0x00000001U
#define HP_PERI1_PMS_WRITE_TEE_HP_UART2_S  4
/** HP_PERI1_PMS_WRITE_REE0_HP_UART2 : R/W; bitpos: [5]; default: 0;
 *  Configures hp_uart2 registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_REE0_HP_UART2    (BIT(5))
#define HP_PERI1_PMS_WRITE_REE0_HP_UART2_M  (HP_PERI1_PMS_WRITE_REE0_HP_UART2_V << HP_PERI1_PMS_WRITE_REE0_HP_UART2_S)
#define HP_PERI1_PMS_WRITE_REE0_HP_UART2_V  0x00000001U
#define HP_PERI1_PMS_WRITE_REE0_HP_UART2_S  5
/** HP_PERI1_PMS_WRITE_REE1_HP_UART2 : R/W; bitpos: [6]; default: 0;
 *  Configures hp_uart2 registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_REE1_HP_UART2    (BIT(6))
#define HP_PERI1_PMS_WRITE_REE1_HP_UART2_M  (HP_PERI1_PMS_WRITE_REE1_HP_UART2_V << HP_PERI1_PMS_WRITE_REE1_HP_UART2_S)
#define HP_PERI1_PMS_WRITE_REE1_HP_UART2_V  0x00000001U
#define HP_PERI1_PMS_WRITE_REE1_HP_UART2_S  6
/** HP_PERI1_PMS_WRITE_REE2_HP_UART2 : R/W; bitpos: [7]; default: 0;
 *  Configures hp_uart2 registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_REE2_HP_UART2    (BIT(7))
#define HP_PERI1_PMS_WRITE_REE2_HP_UART2_M  (HP_PERI1_PMS_WRITE_REE2_HP_UART2_V << HP_PERI1_PMS_WRITE_REE2_HP_UART2_S)
#define HP_PERI1_PMS_WRITE_REE2_HP_UART2_V  0x00000001U
#define HP_PERI1_PMS_WRITE_REE2_HP_UART2_S  7
/** HP_PERI1_PMS_HP_UART2_LOCK : R/W; bitpos: [8]; default: 0;
 *  Set 1 to lock hp_uart2 peri_apm configuration
 */
#define HP_PERI1_PMS_HP_UART2_LOCK    (BIT(8))
#define HP_PERI1_PMS_HP_UART2_LOCK_M  (HP_PERI1_PMS_HP_UART2_LOCK_V << HP_PERI1_PMS_HP_UART2_LOCK_S)
#define HP_PERI1_PMS_HP_UART2_LOCK_V  0x00000001U
#define HP_PERI1_PMS_HP_UART2_LOCK_S  8

/** HP_PERI1_PMS_HP_UART3_CTRL_REG register
 *  hp_uart3 read/write control register
 */
#define HP_PERI1_PMS_HP_UART3_CTRL_REG (DR_REG_HP_PERI1_PMS_BASE + 0x34)
/** HP_PERI1_PMS_READ_TEE_HP_UART3 : R/W; bitpos: [0]; default: 1;
 *  Configures hp_uart3 registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_TEE_HP_UART3    (BIT(0))
#define HP_PERI1_PMS_READ_TEE_HP_UART3_M  (HP_PERI1_PMS_READ_TEE_HP_UART3_V << HP_PERI1_PMS_READ_TEE_HP_UART3_S)
#define HP_PERI1_PMS_READ_TEE_HP_UART3_V  0x00000001U
#define HP_PERI1_PMS_READ_TEE_HP_UART3_S  0
/** HP_PERI1_PMS_READ_REE0_HP_UART3 : R/W; bitpos: [1]; default: 0;
 *  Configures hp_uart3 registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_REE0_HP_UART3    (BIT(1))
#define HP_PERI1_PMS_READ_REE0_HP_UART3_M  (HP_PERI1_PMS_READ_REE0_HP_UART3_V << HP_PERI1_PMS_READ_REE0_HP_UART3_S)
#define HP_PERI1_PMS_READ_REE0_HP_UART3_V  0x00000001U
#define HP_PERI1_PMS_READ_REE0_HP_UART3_S  1
/** HP_PERI1_PMS_READ_REE1_HP_UART3 : R/W; bitpos: [2]; default: 0;
 *  Configures hp_uart3 registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_REE1_HP_UART3    (BIT(2))
#define HP_PERI1_PMS_READ_REE1_HP_UART3_M  (HP_PERI1_PMS_READ_REE1_HP_UART3_V << HP_PERI1_PMS_READ_REE1_HP_UART3_S)
#define HP_PERI1_PMS_READ_REE1_HP_UART3_V  0x00000001U
#define HP_PERI1_PMS_READ_REE1_HP_UART3_S  2
/** HP_PERI1_PMS_READ_REE2_HP_UART3 : R/W; bitpos: [3]; default: 0;
 *  Configures hp_uart3 registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_REE2_HP_UART3    (BIT(3))
#define HP_PERI1_PMS_READ_REE2_HP_UART3_M  (HP_PERI1_PMS_READ_REE2_HP_UART3_V << HP_PERI1_PMS_READ_REE2_HP_UART3_S)
#define HP_PERI1_PMS_READ_REE2_HP_UART3_V  0x00000001U
#define HP_PERI1_PMS_READ_REE2_HP_UART3_S  3
/** HP_PERI1_PMS_WRITE_TEE_HP_UART3 : R/W; bitpos: [4]; default: 1;
 *  Configures hp_uart3 registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_TEE_HP_UART3    (BIT(4))
#define HP_PERI1_PMS_WRITE_TEE_HP_UART3_M  (HP_PERI1_PMS_WRITE_TEE_HP_UART3_V << HP_PERI1_PMS_WRITE_TEE_HP_UART3_S)
#define HP_PERI1_PMS_WRITE_TEE_HP_UART3_V  0x00000001U
#define HP_PERI1_PMS_WRITE_TEE_HP_UART3_S  4
/** HP_PERI1_PMS_WRITE_REE0_HP_UART3 : R/W; bitpos: [5]; default: 0;
 *  Configures hp_uart3 registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_REE0_HP_UART3    (BIT(5))
#define HP_PERI1_PMS_WRITE_REE0_HP_UART3_M  (HP_PERI1_PMS_WRITE_REE0_HP_UART3_V << HP_PERI1_PMS_WRITE_REE0_HP_UART3_S)
#define HP_PERI1_PMS_WRITE_REE0_HP_UART3_V  0x00000001U
#define HP_PERI1_PMS_WRITE_REE0_HP_UART3_S  5
/** HP_PERI1_PMS_WRITE_REE1_HP_UART3 : R/W; bitpos: [6]; default: 0;
 *  Configures hp_uart3 registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_REE1_HP_UART3    (BIT(6))
#define HP_PERI1_PMS_WRITE_REE1_HP_UART3_M  (HP_PERI1_PMS_WRITE_REE1_HP_UART3_V << HP_PERI1_PMS_WRITE_REE1_HP_UART3_S)
#define HP_PERI1_PMS_WRITE_REE1_HP_UART3_V  0x00000001U
#define HP_PERI1_PMS_WRITE_REE1_HP_UART3_S  6
/** HP_PERI1_PMS_WRITE_REE2_HP_UART3 : R/W; bitpos: [7]; default: 0;
 *  Configures hp_uart3 registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_REE2_HP_UART3    (BIT(7))
#define HP_PERI1_PMS_WRITE_REE2_HP_UART3_M  (HP_PERI1_PMS_WRITE_REE2_HP_UART3_V << HP_PERI1_PMS_WRITE_REE2_HP_UART3_S)
#define HP_PERI1_PMS_WRITE_REE2_HP_UART3_V  0x00000001U
#define HP_PERI1_PMS_WRITE_REE2_HP_UART3_S  7
/** HP_PERI1_PMS_HP_UART3_LOCK : R/W; bitpos: [8]; default: 0;
 *  Set 1 to lock hp_uart3 peri_apm configuration
 */
#define HP_PERI1_PMS_HP_UART3_LOCK    (BIT(8))
#define HP_PERI1_PMS_HP_UART3_LOCK_M  (HP_PERI1_PMS_HP_UART3_LOCK_V << HP_PERI1_PMS_HP_UART3_LOCK_S)
#define HP_PERI1_PMS_HP_UART3_LOCK_V  0x00000001U
#define HP_PERI1_PMS_HP_UART3_LOCK_S  8

/** HP_PERI1_PMS_HP_PARLIO_CTRL_REG register
 *  hp_parlio read/write control register
 */
#define HP_PERI1_PMS_HP_PARLIO_CTRL_REG (DR_REG_HP_PERI1_PMS_BASE + 0x38)
/** HP_PERI1_PMS_READ_TEE_HP_PARLIO : R/W; bitpos: [0]; default: 1;
 *  Configures hp_parlio registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_TEE_HP_PARLIO    (BIT(0))
#define HP_PERI1_PMS_READ_TEE_HP_PARLIO_M  (HP_PERI1_PMS_READ_TEE_HP_PARLIO_V << HP_PERI1_PMS_READ_TEE_HP_PARLIO_S)
#define HP_PERI1_PMS_READ_TEE_HP_PARLIO_V  0x00000001U
#define HP_PERI1_PMS_READ_TEE_HP_PARLIO_S  0
/** HP_PERI1_PMS_READ_REE0_HP_PARLIO : R/W; bitpos: [1]; default: 0;
 *  Configures hp_parlio registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_REE0_HP_PARLIO    (BIT(1))
#define HP_PERI1_PMS_READ_REE0_HP_PARLIO_M  (HP_PERI1_PMS_READ_REE0_HP_PARLIO_V << HP_PERI1_PMS_READ_REE0_HP_PARLIO_S)
#define HP_PERI1_PMS_READ_REE0_HP_PARLIO_V  0x00000001U
#define HP_PERI1_PMS_READ_REE0_HP_PARLIO_S  1
/** HP_PERI1_PMS_READ_REE1_HP_PARLIO : R/W; bitpos: [2]; default: 0;
 *  Configures hp_parlio registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_REE1_HP_PARLIO    (BIT(2))
#define HP_PERI1_PMS_READ_REE1_HP_PARLIO_M  (HP_PERI1_PMS_READ_REE1_HP_PARLIO_V << HP_PERI1_PMS_READ_REE1_HP_PARLIO_S)
#define HP_PERI1_PMS_READ_REE1_HP_PARLIO_V  0x00000001U
#define HP_PERI1_PMS_READ_REE1_HP_PARLIO_S  2
/** HP_PERI1_PMS_READ_REE2_HP_PARLIO : R/W; bitpos: [3]; default: 0;
 *  Configures hp_parlio registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_REE2_HP_PARLIO    (BIT(3))
#define HP_PERI1_PMS_READ_REE2_HP_PARLIO_M  (HP_PERI1_PMS_READ_REE2_HP_PARLIO_V << HP_PERI1_PMS_READ_REE2_HP_PARLIO_S)
#define HP_PERI1_PMS_READ_REE2_HP_PARLIO_V  0x00000001U
#define HP_PERI1_PMS_READ_REE2_HP_PARLIO_S  3
/** HP_PERI1_PMS_WRITE_TEE_HP_PARLIO : R/W; bitpos: [4]; default: 1;
 *  Configures hp_parlio registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_TEE_HP_PARLIO    (BIT(4))
#define HP_PERI1_PMS_WRITE_TEE_HP_PARLIO_M  (HP_PERI1_PMS_WRITE_TEE_HP_PARLIO_V << HP_PERI1_PMS_WRITE_TEE_HP_PARLIO_S)
#define HP_PERI1_PMS_WRITE_TEE_HP_PARLIO_V  0x00000001U
#define HP_PERI1_PMS_WRITE_TEE_HP_PARLIO_S  4
/** HP_PERI1_PMS_WRITE_REE0_HP_PARLIO : R/W; bitpos: [5]; default: 0;
 *  Configures hp_parlio registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_REE0_HP_PARLIO    (BIT(5))
#define HP_PERI1_PMS_WRITE_REE0_HP_PARLIO_M  (HP_PERI1_PMS_WRITE_REE0_HP_PARLIO_V << HP_PERI1_PMS_WRITE_REE0_HP_PARLIO_S)
#define HP_PERI1_PMS_WRITE_REE0_HP_PARLIO_V  0x00000001U
#define HP_PERI1_PMS_WRITE_REE0_HP_PARLIO_S  5
/** HP_PERI1_PMS_WRITE_REE1_HP_PARLIO : R/W; bitpos: [6]; default: 0;
 *  Configures hp_parlio registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_REE1_HP_PARLIO    (BIT(6))
#define HP_PERI1_PMS_WRITE_REE1_HP_PARLIO_M  (HP_PERI1_PMS_WRITE_REE1_HP_PARLIO_V << HP_PERI1_PMS_WRITE_REE1_HP_PARLIO_S)
#define HP_PERI1_PMS_WRITE_REE1_HP_PARLIO_V  0x00000001U
#define HP_PERI1_PMS_WRITE_REE1_HP_PARLIO_S  6
/** HP_PERI1_PMS_WRITE_REE2_HP_PARLIO : R/W; bitpos: [7]; default: 0;
 *  Configures hp_parlio registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_REE2_HP_PARLIO    (BIT(7))
#define HP_PERI1_PMS_WRITE_REE2_HP_PARLIO_M  (HP_PERI1_PMS_WRITE_REE2_HP_PARLIO_V << HP_PERI1_PMS_WRITE_REE2_HP_PARLIO_S)
#define HP_PERI1_PMS_WRITE_REE2_HP_PARLIO_V  0x00000001U
#define HP_PERI1_PMS_WRITE_REE2_HP_PARLIO_S  7
/** HP_PERI1_PMS_HP_PARLIO_LOCK : R/W; bitpos: [8]; default: 0;
 *  Set 1 to lock hp_parlio peri_apm configuration
 */
#define HP_PERI1_PMS_HP_PARLIO_LOCK    (BIT(8))
#define HP_PERI1_PMS_HP_PARLIO_LOCK_M  (HP_PERI1_PMS_HP_PARLIO_LOCK_V << HP_PERI1_PMS_HP_PARLIO_LOCK_S)
#define HP_PERI1_PMS_HP_PARLIO_LOCK_V  0x00000001U
#define HP_PERI1_PMS_HP_PARLIO_LOCK_S  8

/** HP_PERI1_PMS_HP_GPSPI2_CTRL_REG register
 *  hp_gpspi2 read/write control register
 */
#define HP_PERI1_PMS_HP_GPSPI2_CTRL_REG (DR_REG_HP_PERI1_PMS_BASE + 0x3c)
/** HP_PERI1_PMS_READ_TEE_HP_GPSPI2 : R/W; bitpos: [0]; default: 1;
 *  Configures hp_gpspi2 registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_TEE_HP_GPSPI2    (BIT(0))
#define HP_PERI1_PMS_READ_TEE_HP_GPSPI2_M  (HP_PERI1_PMS_READ_TEE_HP_GPSPI2_V << HP_PERI1_PMS_READ_TEE_HP_GPSPI2_S)
#define HP_PERI1_PMS_READ_TEE_HP_GPSPI2_V  0x00000001U
#define HP_PERI1_PMS_READ_TEE_HP_GPSPI2_S  0
/** HP_PERI1_PMS_READ_REE0_HP_GPSPI2 : R/W; bitpos: [1]; default: 0;
 *  Configures hp_gpspi2 registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_REE0_HP_GPSPI2    (BIT(1))
#define HP_PERI1_PMS_READ_REE0_HP_GPSPI2_M  (HP_PERI1_PMS_READ_REE0_HP_GPSPI2_V << HP_PERI1_PMS_READ_REE0_HP_GPSPI2_S)
#define HP_PERI1_PMS_READ_REE0_HP_GPSPI2_V  0x00000001U
#define HP_PERI1_PMS_READ_REE0_HP_GPSPI2_S  1
/** HP_PERI1_PMS_READ_REE1_HP_GPSPI2 : R/W; bitpos: [2]; default: 0;
 *  Configures hp_gpspi2 registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_REE1_HP_GPSPI2    (BIT(2))
#define HP_PERI1_PMS_READ_REE1_HP_GPSPI2_M  (HP_PERI1_PMS_READ_REE1_HP_GPSPI2_V << HP_PERI1_PMS_READ_REE1_HP_GPSPI2_S)
#define HP_PERI1_PMS_READ_REE1_HP_GPSPI2_V  0x00000001U
#define HP_PERI1_PMS_READ_REE1_HP_GPSPI2_S  2
/** HP_PERI1_PMS_READ_REE2_HP_GPSPI2 : R/W; bitpos: [3]; default: 0;
 *  Configures hp_gpspi2 registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_REE2_HP_GPSPI2    (BIT(3))
#define HP_PERI1_PMS_READ_REE2_HP_GPSPI2_M  (HP_PERI1_PMS_READ_REE2_HP_GPSPI2_V << HP_PERI1_PMS_READ_REE2_HP_GPSPI2_S)
#define HP_PERI1_PMS_READ_REE2_HP_GPSPI2_V  0x00000001U
#define HP_PERI1_PMS_READ_REE2_HP_GPSPI2_S  3
/** HP_PERI1_PMS_WRITE_TEE_HP_GPSPI2 : R/W; bitpos: [4]; default: 1;
 *  Configures hp_gpspi2 registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_TEE_HP_GPSPI2    (BIT(4))
#define HP_PERI1_PMS_WRITE_TEE_HP_GPSPI2_M  (HP_PERI1_PMS_WRITE_TEE_HP_GPSPI2_V << HP_PERI1_PMS_WRITE_TEE_HP_GPSPI2_S)
#define HP_PERI1_PMS_WRITE_TEE_HP_GPSPI2_V  0x00000001U
#define HP_PERI1_PMS_WRITE_TEE_HP_GPSPI2_S  4
/** HP_PERI1_PMS_WRITE_REE0_HP_GPSPI2 : R/W; bitpos: [5]; default: 0;
 *  Configures hp_gpspi2 registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_REE0_HP_GPSPI2    (BIT(5))
#define HP_PERI1_PMS_WRITE_REE0_HP_GPSPI2_M  (HP_PERI1_PMS_WRITE_REE0_HP_GPSPI2_V << HP_PERI1_PMS_WRITE_REE0_HP_GPSPI2_S)
#define HP_PERI1_PMS_WRITE_REE0_HP_GPSPI2_V  0x00000001U
#define HP_PERI1_PMS_WRITE_REE0_HP_GPSPI2_S  5
/** HP_PERI1_PMS_WRITE_REE1_HP_GPSPI2 : R/W; bitpos: [6]; default: 0;
 *  Configures hp_gpspi2 registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_REE1_HP_GPSPI2    (BIT(6))
#define HP_PERI1_PMS_WRITE_REE1_HP_GPSPI2_M  (HP_PERI1_PMS_WRITE_REE1_HP_GPSPI2_V << HP_PERI1_PMS_WRITE_REE1_HP_GPSPI2_S)
#define HP_PERI1_PMS_WRITE_REE1_HP_GPSPI2_V  0x00000001U
#define HP_PERI1_PMS_WRITE_REE1_HP_GPSPI2_S  6
/** HP_PERI1_PMS_WRITE_REE2_HP_GPSPI2 : R/W; bitpos: [7]; default: 0;
 *  Configures hp_gpspi2 registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_REE2_HP_GPSPI2    (BIT(7))
#define HP_PERI1_PMS_WRITE_REE2_HP_GPSPI2_M  (HP_PERI1_PMS_WRITE_REE2_HP_GPSPI2_V << HP_PERI1_PMS_WRITE_REE2_HP_GPSPI2_S)
#define HP_PERI1_PMS_WRITE_REE2_HP_GPSPI2_V  0x00000001U
#define HP_PERI1_PMS_WRITE_REE2_HP_GPSPI2_S  7
/** HP_PERI1_PMS_HP_GPSPI2_LOCK : R/W; bitpos: [8]; default: 0;
 *  Set 1 to lock hp_gpspi2 peri_apm configuration
 */
#define HP_PERI1_PMS_HP_GPSPI2_LOCK    (BIT(8))
#define HP_PERI1_PMS_HP_GPSPI2_LOCK_M  (HP_PERI1_PMS_HP_GPSPI2_LOCK_V << HP_PERI1_PMS_HP_GPSPI2_LOCK_S)
#define HP_PERI1_PMS_HP_GPSPI2_LOCK_V  0x00000001U
#define HP_PERI1_PMS_HP_GPSPI2_LOCK_S  8

/** HP_PERI1_PMS_HP_GPSPI3_CTRL_REG register
 *  hp_gpspi3 read/write control register
 */
#define HP_PERI1_PMS_HP_GPSPI3_CTRL_REG (DR_REG_HP_PERI1_PMS_BASE + 0x40)
/** HP_PERI1_PMS_READ_TEE_HP_GPSPI3 : R/W; bitpos: [0]; default: 1;
 *  Configures hp_gpspi3 registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_TEE_HP_GPSPI3    (BIT(0))
#define HP_PERI1_PMS_READ_TEE_HP_GPSPI3_M  (HP_PERI1_PMS_READ_TEE_HP_GPSPI3_V << HP_PERI1_PMS_READ_TEE_HP_GPSPI3_S)
#define HP_PERI1_PMS_READ_TEE_HP_GPSPI3_V  0x00000001U
#define HP_PERI1_PMS_READ_TEE_HP_GPSPI3_S  0
/** HP_PERI1_PMS_READ_REE0_HP_GPSPI3 : R/W; bitpos: [1]; default: 0;
 *  Configures hp_gpspi3 registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_REE0_HP_GPSPI3    (BIT(1))
#define HP_PERI1_PMS_READ_REE0_HP_GPSPI3_M  (HP_PERI1_PMS_READ_REE0_HP_GPSPI3_V << HP_PERI1_PMS_READ_REE0_HP_GPSPI3_S)
#define HP_PERI1_PMS_READ_REE0_HP_GPSPI3_V  0x00000001U
#define HP_PERI1_PMS_READ_REE0_HP_GPSPI3_S  1
/** HP_PERI1_PMS_READ_REE1_HP_GPSPI3 : R/W; bitpos: [2]; default: 0;
 *  Configures hp_gpspi3 registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_REE1_HP_GPSPI3    (BIT(2))
#define HP_PERI1_PMS_READ_REE1_HP_GPSPI3_M  (HP_PERI1_PMS_READ_REE1_HP_GPSPI3_V << HP_PERI1_PMS_READ_REE1_HP_GPSPI3_S)
#define HP_PERI1_PMS_READ_REE1_HP_GPSPI3_V  0x00000001U
#define HP_PERI1_PMS_READ_REE1_HP_GPSPI3_S  2
/** HP_PERI1_PMS_READ_REE2_HP_GPSPI3 : R/W; bitpos: [3]; default: 0;
 *  Configures hp_gpspi3 registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_REE2_HP_GPSPI3    (BIT(3))
#define HP_PERI1_PMS_READ_REE2_HP_GPSPI3_M  (HP_PERI1_PMS_READ_REE2_HP_GPSPI3_V << HP_PERI1_PMS_READ_REE2_HP_GPSPI3_S)
#define HP_PERI1_PMS_READ_REE2_HP_GPSPI3_V  0x00000001U
#define HP_PERI1_PMS_READ_REE2_HP_GPSPI3_S  3
/** HP_PERI1_PMS_WRITE_TEE_HP_GPSPI3 : R/W; bitpos: [4]; default: 1;
 *  Configures hp_gpspi3 registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_TEE_HP_GPSPI3    (BIT(4))
#define HP_PERI1_PMS_WRITE_TEE_HP_GPSPI3_M  (HP_PERI1_PMS_WRITE_TEE_HP_GPSPI3_V << HP_PERI1_PMS_WRITE_TEE_HP_GPSPI3_S)
#define HP_PERI1_PMS_WRITE_TEE_HP_GPSPI3_V  0x00000001U
#define HP_PERI1_PMS_WRITE_TEE_HP_GPSPI3_S  4
/** HP_PERI1_PMS_WRITE_REE0_HP_GPSPI3 : R/W; bitpos: [5]; default: 0;
 *  Configures hp_gpspi3 registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_REE0_HP_GPSPI3    (BIT(5))
#define HP_PERI1_PMS_WRITE_REE0_HP_GPSPI3_M  (HP_PERI1_PMS_WRITE_REE0_HP_GPSPI3_V << HP_PERI1_PMS_WRITE_REE0_HP_GPSPI3_S)
#define HP_PERI1_PMS_WRITE_REE0_HP_GPSPI3_V  0x00000001U
#define HP_PERI1_PMS_WRITE_REE0_HP_GPSPI3_S  5
/** HP_PERI1_PMS_WRITE_REE1_HP_GPSPI3 : R/W; bitpos: [6]; default: 0;
 *  Configures hp_gpspi3 registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_REE1_HP_GPSPI3    (BIT(6))
#define HP_PERI1_PMS_WRITE_REE1_HP_GPSPI3_M  (HP_PERI1_PMS_WRITE_REE1_HP_GPSPI3_V << HP_PERI1_PMS_WRITE_REE1_HP_GPSPI3_S)
#define HP_PERI1_PMS_WRITE_REE1_HP_GPSPI3_V  0x00000001U
#define HP_PERI1_PMS_WRITE_REE1_HP_GPSPI3_S  6
/** HP_PERI1_PMS_WRITE_REE2_HP_GPSPI3 : R/W; bitpos: [7]; default: 0;
 *  Configures hp_gpspi3 registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_REE2_HP_GPSPI3    (BIT(7))
#define HP_PERI1_PMS_WRITE_REE2_HP_GPSPI3_M  (HP_PERI1_PMS_WRITE_REE2_HP_GPSPI3_V << HP_PERI1_PMS_WRITE_REE2_HP_GPSPI3_S)
#define HP_PERI1_PMS_WRITE_REE2_HP_GPSPI3_V  0x00000001U
#define HP_PERI1_PMS_WRITE_REE2_HP_GPSPI3_S  7
/** HP_PERI1_PMS_HP_GPSPI3_LOCK : R/W; bitpos: [8]; default: 0;
 *  Set 1 to lock hp_gpspi3 peri_apm configuration
 */
#define HP_PERI1_PMS_HP_GPSPI3_LOCK    (BIT(8))
#define HP_PERI1_PMS_HP_GPSPI3_LOCK_M  (HP_PERI1_PMS_HP_GPSPI3_LOCK_V << HP_PERI1_PMS_HP_GPSPI3_LOCK_S)
#define HP_PERI1_PMS_HP_GPSPI3_LOCK_V  0x00000001U
#define HP_PERI1_PMS_HP_GPSPI3_LOCK_S  8

