espressif/esp-idf/components/soc/esp32s31/register/soc/hp_peri1_pms_reg.h
/** HP_PERI1_PMS_HP_USBDEVICE_CTRL_REG register
 *  hp_usbdevice read/write control register
 */
#define HP_PERI1_PMS_HP_USBDEVICE_CTRL_REG (DR_REG_HP_PERI1_PMS_BASE + 0x44)
/** HP_PERI1_PMS_READ_TEE_HP_USBDEVICE : R/W; bitpos: [0]; default: 1;
 *  Configures hp_usbdevice registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_TEE_HP_USBDEVICE    (BIT(0))
#define HP_PERI1_PMS_READ_TEE_HP_USBDEVICE_M  (HP_PERI1_PMS_READ_TEE_HP_USBDEVICE_V << HP_PERI1_PMS_READ_TEE_HP_USBDEVICE_S)
#define HP_PERI1_PMS_READ_TEE_HP_USBDEVICE_V  0x00000001U
#define HP_PERI1_PMS_READ_TEE_HP_USBDEVICE_S  0
/** HP_PERI1_PMS_READ_REE0_HP_USBDEVICE : R/W; bitpos: [1]; default: 0;
 *  Configures hp_usbdevice registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_REE0_HP_USBDEVICE    (BIT(1))
#define HP_PERI1_PMS_READ_REE0_HP_USBDEVICE_M  (HP_PERI1_PMS_READ_REE0_HP_USBDEVICE_V << HP_PERI1_PMS_READ_REE0_HP_USBDEVICE_S)
#define HP_PERI1_PMS_READ_REE0_HP_USBDEVICE_V  0x00000001U
#define HP_PERI1_PMS_READ_REE0_HP_USBDEVICE_S  1
/** HP_PERI1_PMS_READ_REE1_HP_USBDEVICE : R/W; bitpos: [2]; default: 0;
 *  Configures hp_usbdevice registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_REE1_HP_USBDEVICE    (BIT(2))
#define HP_PERI1_PMS_READ_REE1_HP_USBDEVICE_M  (HP_PERI1_PMS_READ_REE1_HP_USBDEVICE_V << HP_PERI1_PMS_READ_REE1_HP_USBDEVICE_S)
#define HP_PERI1_PMS_READ_REE1_HP_USBDEVICE_V  0x00000001U
#define HP_PERI1_PMS_READ_REE1_HP_USBDEVICE_S  2
/** HP_PERI1_PMS_READ_REE2_HP_USBDEVICE : R/W; bitpos: [3]; default: 0;
 *  Configures hp_usbdevice registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_REE2_HP_USBDEVICE    (BIT(3))
#define HP_PERI1_PMS_READ_REE2_HP_USBDEVICE_M  (HP_PERI1_PMS_READ_REE2_HP_USBDEVICE_V << HP_PERI1_PMS_READ_REE2_HP_USBDEVICE_S)
#define HP_PERI1_PMS_READ_REE2_HP_USBDEVICE_V  0x00000001U
#define HP_PERI1_PMS_READ_REE2_HP_USBDEVICE_S  3
/** HP_PERI1_PMS_WRITE_TEE_HP_USBDEVICE : R/W; bitpos: [4]; default: 1;
 *  Configures hp_usbdevice registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_TEE_HP_USBDEVICE    (BIT(4))
#define HP_PERI1_PMS_WRITE_TEE_HP_USBDEVICE_M  (HP_PERI1_PMS_WRITE_TEE_HP_USBDEVICE_V << HP_PERI1_PMS_WRITE_TEE_HP_USBDEVICE_S)
#define HP_PERI1_PMS_WRITE_TEE_HP_USBDEVICE_V  0x00000001U
#define HP_PERI1_PMS_WRITE_TEE_HP_USBDEVICE_S  4
/** HP_PERI1_PMS_WRITE_REE0_HP_USBDEVICE : R/W; bitpos: [5]; default: 0;
 *  Configures hp_usbdevice registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_REE0_HP_USBDEVICE    (BIT(5))
#define HP_PERI1_PMS_WRITE_REE0_HP_USBDEVICE_M  (HP_PERI1_PMS_WRITE_REE0_HP_USBDEVICE_V << HP_PERI1_PMS_WRITE_REE0_HP_USBDEVICE_S)
#define HP_PERI1_PMS_WRITE_REE0_HP_USBDEVICE_V  0x00000001U
#define HP_PERI1_PMS_WRITE_REE0_HP_USBDEVICE_S  5
/** HP_PERI1_PMS_WRITE_REE1_HP_USBDEVICE : R/W; bitpos: [6]; default: 0;
 *  Configures hp_usbdevice registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_REE1_HP_USBDEVICE    (BIT(6))
#define HP_PERI1_PMS_WRITE_REE1_HP_USBDEVICE_M  (HP_PERI1_PMS_WRITE_REE1_HP_USBDEVICE_V << HP_PERI1_PMS_WRITE_REE1_HP_USBDEVICE_S)
#define HP_PERI1_PMS_WRITE_REE1_HP_USBDEVICE_V  0x00000001U
#define HP_PERI1_PMS_WRITE_REE1_HP_USBDEVICE_S  6
/** HP_PERI1_PMS_WRITE_REE2_HP_USBDEVICE : R/W; bitpos: [7]; default: 0;
 *  Configures hp_usbdevice registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_REE2_HP_USBDEVICE    (BIT(7))
#define HP_PERI1_PMS_WRITE_REE2_HP_USBDEVICE_M  (HP_PERI1_PMS_WRITE_REE2_HP_USBDEVICE_V << HP_PERI1_PMS_WRITE_REE2_HP_USBDEVICE_S)
#define HP_PERI1_PMS_WRITE_REE2_HP_USBDEVICE_V  0x00000001U
#define HP_PERI1_PMS_WRITE_REE2_HP_USBDEVICE_S  7
/** HP_PERI1_PMS_HP_USBDEVICE_LOCK : R/W; bitpos: [8]; default: 0;
 *  Set 1 to lock hp_usbdevice peri_apm configuration
 */
#define HP_PERI1_PMS_HP_USBDEVICE_LOCK    (BIT(8))
#define HP_PERI1_PMS_HP_USBDEVICE_LOCK_M  (HP_PERI1_PMS_HP_USBDEVICE_LOCK_V << HP_PERI1_PMS_HP_USBDEVICE_LOCK_S)
#define HP_PERI1_PMS_HP_USBDEVICE_LOCK_V  0x00000001U
#define HP_PERI1_PMS_HP_USBDEVICE_LOCK_S  8

/** HP_PERI1_PMS_HP_LEDC0_CTRL_REG register
 *  hp_ledc0 read/write control register
 */
#define HP_PERI1_PMS_HP_LEDC0_CTRL_REG (DR_REG_HP_PERI1_PMS_BASE + 0x48)
/** HP_PERI1_PMS_READ_TEE_HP_LEDC0 : R/W; bitpos: [0]; default: 1;
 *  Configures hp_ledc0 registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_TEE_HP_LEDC0    (BIT(0))
#define HP_PERI1_PMS_READ_TEE_HP_LEDC0_M  (HP_PERI1_PMS_READ_TEE_HP_LEDC0_V << HP_PERI1_PMS_READ_TEE_HP_LEDC0_S)
#define HP_PERI1_PMS_READ_TEE_HP_LEDC0_V  0x00000001U
#define HP_PERI1_PMS_READ_TEE_HP_LEDC0_S  0
/** HP_PERI1_PMS_READ_REE0_HP_LEDC0 : R/W; bitpos: [1]; default: 0;
 *  Configures hp_ledc0 registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_REE0_HP_LEDC0    (BIT(1))
#define HP_PERI1_PMS_READ_REE0_HP_LEDC0_M  (HP_PERI1_PMS_READ_REE0_HP_LEDC0_V << HP_PERI1_PMS_READ_REE0_HP_LEDC0_S)
#define HP_PERI1_PMS_READ_REE0_HP_LEDC0_V  0x00000001U
#define HP_PERI1_PMS_READ_REE0_HP_LEDC0_S  1
/** HP_PERI1_PMS_READ_REE1_HP_LEDC0 : R/W; bitpos: [2]; default: 0;
 *  Configures hp_ledc0 registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_REE1_HP_LEDC0    (BIT(2))
#define HP_PERI1_PMS_READ_REE1_HP_LEDC0_M  (HP_PERI1_PMS_READ_REE1_HP_LEDC0_V << HP_PERI1_PMS_READ_REE1_HP_LEDC0_S)
#define HP_PERI1_PMS_READ_REE1_HP_LEDC0_V  0x00000001U
#define HP_PERI1_PMS_READ_REE1_HP_LEDC0_S  2
/** HP_PERI1_PMS_READ_REE2_HP_LEDC0 : R/W; bitpos: [3]; default: 0;
 *  Configures hp_ledc0 registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_REE2_HP_LEDC0    (BIT(3))
#define HP_PERI1_PMS_READ_REE2_HP_LEDC0_M  (HP_PERI1_PMS_READ_REE2_HP_LEDC0_V << HP_PERI1_PMS_READ_REE2_HP_LEDC0_S)
#define HP_PERI1_PMS_READ_REE2_HP_LEDC0_V  0x00000001U
#define HP_PERI1_PMS_READ_REE2_HP_LEDC0_S  3
/** HP_PERI1_PMS_WRITE_TEE_HP_LEDC0 : R/W; bitpos: [4]; default: 1;
 *  Configures hp_ledc0 registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_TEE_HP_LEDC0    (BIT(4))
#define HP_PERI1_PMS_WRITE_TEE_HP_LEDC0_M  (HP_PERI1_PMS_WRITE_TEE_HP_LEDC0_V << HP_PERI1_PMS_WRITE_TEE_HP_LEDC0_S)
#define HP_PERI1_PMS_WRITE_TEE_HP_LEDC0_V  0x00000001U
#define HP_PERI1_PMS_WRITE_TEE_HP_LEDC0_S  4
/** HP_PERI1_PMS_WRITE_REE0_HP_LEDC0 : R/W; bitpos: [5]; default: 0;
 *  Configures hp_ledc0 registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_REE0_HP_LEDC0    (BIT(5))
#define HP_PERI1_PMS_WRITE_REE0_HP_LEDC0_M  (HP_PERI1_PMS_WRITE_REE0_HP_LEDC0_V << HP_PERI1_PMS_WRITE_REE0_HP_LEDC0_S)
#define HP_PERI1_PMS_WRITE_REE0_HP_LEDC0_V  0x00000001U
#define HP_PERI1_PMS_WRITE_REE0_HP_LEDC0_S  5
/** HP_PERI1_PMS_WRITE_REE1_HP_LEDC0 : R/W; bitpos: [6]; default: 0;
 *  Configures hp_ledc0 registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_REE1_HP_LEDC0    (BIT(6))
#define HP_PERI1_PMS_WRITE_REE1_HP_LEDC0_M  (HP_PERI1_PMS_WRITE_REE1_HP_LEDC0_V << HP_PERI1_PMS_WRITE_REE1_HP_LEDC0_S)
#define HP_PERI1_PMS_WRITE_REE1_HP_LEDC0_V  0x00000001U
#define HP_PERI1_PMS_WRITE_REE1_HP_LEDC0_S  6
/** HP_PERI1_PMS_WRITE_REE2_HP_LEDC0 : R/W; bitpos: [7]; default: 0;
 *  Configures hp_ledc0 registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_REE2_HP_LEDC0    (BIT(7))
#define HP_PERI1_PMS_WRITE_REE2_HP_LEDC0_M  (HP_PERI1_PMS_WRITE_REE2_HP_LEDC0_V << HP_PERI1_PMS_WRITE_REE2_HP_LEDC0_S)
#define HP_PERI1_PMS_WRITE_REE2_HP_LEDC0_V  0x00000001U
#define HP_PERI1_PMS_WRITE_REE2_HP_LEDC0_S  7
/** HP_PERI1_PMS_HP_LEDC0_LOCK : R/W; bitpos: [8]; default: 0;
 *  Set 1 to lock hp_ledc0 peri_apm configuration
 */
#define HP_PERI1_PMS_HP_LEDC0_LOCK    (BIT(8))
#define HP_PERI1_PMS_HP_LEDC0_LOCK_M  (HP_PERI1_PMS_HP_LEDC0_LOCK_V << HP_PERI1_PMS_HP_LEDC0_LOCK_S)
#define HP_PERI1_PMS_HP_LEDC0_LOCK_V  0x00000001U
#define HP_PERI1_PMS_HP_LEDC0_LOCK_S  8

/** HP_PERI1_PMS_HP_ETM_CTRL_REG register
 *  hp_etm read/write control register
 */
#define HP_PERI1_PMS_HP_ETM_CTRL_REG (DR_REG_HP_PERI1_PMS_BASE + 0x4c)
/** HP_PERI1_PMS_READ_TEE_HP_ETM : R/W; bitpos: [0]; default: 1;
 *  Configures hp_etm registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_TEE_HP_ETM    (BIT(0))
#define HP_PERI1_PMS_READ_TEE_HP_ETM_M  (HP_PERI1_PMS_READ_TEE_HP_ETM_V << HP_PERI1_PMS_READ_TEE_HP_ETM_S)
#define HP_PERI1_PMS_READ_TEE_HP_ETM_V  0x00000001U
#define HP_PERI1_PMS_READ_TEE_HP_ETM_S  0
/** HP_PERI1_PMS_READ_REE0_HP_ETM : R/W; bitpos: [1]; default: 0;
 *  Configures hp_etm registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_REE0_HP_ETM    (BIT(1))
#define HP_PERI1_PMS_READ_REE0_HP_ETM_M  (HP_PERI1_PMS_READ_REE0_HP_ETM_V << HP_PERI1_PMS_READ_REE0_HP_ETM_S)
#define HP_PERI1_PMS_READ_REE0_HP_ETM_V  0x00000001U
#define HP_PERI1_PMS_READ_REE0_HP_ETM_S  1
/** HP_PERI1_PMS_READ_REE1_HP_ETM : R/W; bitpos: [2]; default: 0;
 *  Configures hp_etm registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_REE1_HP_ETM    (BIT(2))
#define HP_PERI1_PMS_READ_REE1_HP_ETM_M  (HP_PERI1_PMS_READ_REE1_HP_ETM_V << HP_PERI1_PMS_READ_REE1_HP_ETM_S)
#define HP_PERI1_PMS_READ_REE1_HP_ETM_V  0x00000001U
#define HP_PERI1_PMS_READ_REE1_HP_ETM_S  2
/** HP_PERI1_PMS_READ_REE2_HP_ETM : R/W; bitpos: [3]; default: 0;
 *  Configures hp_etm registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_REE2_HP_ETM    (BIT(3))
#define HP_PERI1_PMS_READ_REE2_HP_ETM_M  (HP_PERI1_PMS_READ_REE2_HP_ETM_V << HP_PERI1_PMS_READ_REE2_HP_ETM_S)
#define HP_PERI1_PMS_READ_REE2_HP_ETM_V  0x00000001U
#define HP_PERI1_PMS_READ_REE2_HP_ETM_S  3
/** HP_PERI1_PMS_WRITE_TEE_HP_ETM : R/W; bitpos: [4]; default: 1;
 *  Configures hp_etm registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_TEE_HP_ETM    (BIT(4))
#define HP_PERI1_PMS_WRITE_TEE_HP_ETM_M  (HP_PERI1_PMS_WRITE_TEE_HP_ETM_V << HP_PERI1_PMS_WRITE_TEE_HP_ETM_S)
#define HP_PERI1_PMS_WRITE_TEE_HP_ETM_V  0x00000001U
#define HP_PERI1_PMS_WRITE_TEE_HP_ETM_S  4
/** HP_PERI1_PMS_WRITE_REE0_HP_ETM : R/W; bitpos: [5]; default: 0;
 *  Configures hp_etm registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_REE0_HP_ETM    (BIT(5))
#define HP_PERI1_PMS_WRITE_REE0_HP_ETM_M  (HP_PERI1_PMS_WRITE_REE0_HP_ETM_V << HP_PERI1_PMS_WRITE_REE0_HP_ETM_S)
#define HP_PERI1_PMS_WRITE_REE0_HP_ETM_V  0x00000001U
#define HP_PERI1_PMS_WRITE_REE0_HP_ETM_S  5
/** HP_PERI1_PMS_WRITE_REE1_HP_ETM : R/W; bitpos: [6]; default: 0;
 *  Configures hp_etm registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_REE1_HP_ETM    (BIT(6))
#define HP_PERI1_PMS_WRITE_REE1_HP_ETM_M  (HP_PERI1_PMS_WRITE_REE1_HP_ETM_V << HP_PERI1_PMS_WRITE_REE1_HP_ETM_S)
#define HP_PERI1_PMS_WRITE_REE1_HP_ETM_V  0x00000001U
#define HP_PERI1_PMS_WRITE_REE1_HP_ETM_S  6
/** HP_PERI1_PMS_WRITE_REE2_HP_ETM : R/W; bitpos: [7]; default: 0;
 *  Configures hp_etm registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_REE2_HP_ETM    (BIT(7))
#define HP_PERI1_PMS_WRITE_REE2_HP_ETM_M  (HP_PERI1_PMS_WRITE_REE2_HP_ETM_V << HP_PERI1_PMS_WRITE_REE2_HP_ETM_S)
#define HP_PERI1_PMS_WRITE_REE2_HP_ETM_V  0x00000001U
#define HP_PERI1_PMS_WRITE_REE2_HP_ETM_S  7
/** HP_PERI1_PMS_HP_ETM_LOCK : R/W; bitpos: [8]; default: 0;
 *  Set 1 to lock hp_etm peri_apm configuration
 */
#define HP_PERI1_PMS_HP_ETM_LOCK    (BIT(8))
#define HP_PERI1_PMS_HP_ETM_LOCK_M  (HP_PERI1_PMS_HP_ETM_LOCK_V << HP_PERI1_PMS_HP_ETM_LOCK_S)
#define HP_PERI1_PMS_HP_ETM_LOCK_V  0x00000001U
#define HP_PERI1_PMS_HP_ETM_LOCK_S  8

/** HP_PERI1_PMS_HP_TWAI0_CTRL_REG register
 *  hp_twai0 read/write control register
 */
#define HP_PERI1_PMS_HP_TWAI0_CTRL_REG (DR_REG_HP_PERI1_PMS_BASE + 0x50)
/** HP_PERI1_PMS_READ_TEE_HP_TWAI0 : R/W; bitpos: [0]; default: 1;
 *  Configures hp_twai0 registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_TEE_HP_TWAI0    (BIT(0))
#define HP_PERI1_PMS_READ_TEE_HP_TWAI0_M  (HP_PERI1_PMS_READ_TEE_HP_TWAI0_V << HP_PERI1_PMS_READ_TEE_HP_TWAI0_S)
#define HP_PERI1_PMS_READ_TEE_HP_TWAI0_V  0x00000001U
#define HP_PERI1_PMS_READ_TEE_HP_TWAI0_S  0
/** HP_PERI1_PMS_READ_REE0_HP_TWAI0 : R/W; bitpos: [1]; default: 0;
 *  Configures hp_twai0 registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_REE0_HP_TWAI0    (BIT(1))
#define HP_PERI1_PMS_READ_REE0_HP_TWAI0_M  (HP_PERI1_PMS_READ_REE0_HP_TWAI0_V << HP_PERI1_PMS_READ_REE0_HP_TWAI0_S)
#define HP_PERI1_PMS_READ_REE0_HP_TWAI0_V  0x00000001U
#define HP_PERI1_PMS_READ_REE0_HP_TWAI0_S  1
/** HP_PERI1_PMS_READ_REE1_HP_TWAI0 : R/W; bitpos: [2]; default: 0;
 *  Configures hp_twai0 registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_REE1_HP_TWAI0    (BIT(2))
#define HP_PERI1_PMS_READ_REE1_HP_TWAI0_M  (HP_PERI1_PMS_READ_REE1_HP_TWAI0_V << HP_PERI1_PMS_READ_REE1_HP_TWAI0_S)
#define HP_PERI1_PMS_READ_REE1_HP_TWAI0_V  0x00000001U
#define HP_PERI1_PMS_READ_REE1_HP_TWAI0_S  2
/** HP_PERI1_PMS_READ_REE2_HP_TWAI0 : R/W; bitpos: [3]; default: 0;
 *  Configures hp_twai0 registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_REE2_HP_TWAI0    (BIT(3))
#define HP_PERI1_PMS_READ_REE2_HP_TWAI0_M  (HP_PERI1_PMS_READ_REE2_HP_TWAI0_V << HP_PERI1_PMS_READ_REE2_HP_TWAI0_S)
#define HP_PERI1_PMS_READ_REE2_HP_TWAI0_V  0x00000001U
#define HP_PERI1_PMS_READ_REE2_HP_TWAI0_S  3
/** HP_PERI1_PMS_WRITE_TEE_HP_TWAI0 : R/W; bitpos: [4]; default: 1;
 *  Configures hp_twai0 registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_TEE_HP_TWAI0    (BIT(4))
#define HP_PERI1_PMS_WRITE_TEE_HP_TWAI0_M  (HP_PERI1_PMS_WRITE_TEE_HP_TWAI0_V << HP_PERI1_PMS_WRITE_TEE_HP_TWAI0_S)
#define HP_PERI1_PMS_WRITE_TEE_HP_TWAI0_V  0x00000001U
#define HP_PERI1_PMS_WRITE_TEE_HP_TWAI0_S  4
/** HP_PERI1_PMS_WRITE_REE0_HP_TWAI0 : R/W; bitpos: [5]; default: 0;
 *  Configures hp_twai0 registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_REE0_HP_TWAI0    (BIT(5))
#define HP_PERI1_PMS_WRITE_REE0_HP_TWAI0_M  (HP_PERI1_PMS_WRITE_REE0_HP_TWAI0_V << HP_PERI1_PMS_WRITE_REE0_HP_TWAI0_S)
#define HP_PERI1_PMS_WRITE_REE0_HP_TWAI0_V  0x00000001U
#define HP_PERI1_PMS_WRITE_REE0_HP_TWAI0_S  5
/** HP_PERI1_PMS_WRITE_REE1_HP_TWAI0 : R/W; bitpos: [6]; default: 0;
 *  Configures hp_twai0 registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_REE1_HP_TWAI0    (BIT(6))
#define HP_PERI1_PMS_WRITE_REE1_HP_TWAI0_M  (HP_PERI1_PMS_WRITE_REE1_HP_TWAI0_V << HP_PERI1_PMS_WRITE_REE1_HP_TWAI0_S)
#define HP_PERI1_PMS_WRITE_REE1_HP_TWAI0_V  0x00000001U
#define HP_PERI1_PMS_WRITE_REE1_HP_TWAI0_S  6
/** HP_PERI1_PMS_WRITE_REE2_HP_TWAI0 : R/W; bitpos: [7]; default: 0;
 *  Configures hp_twai0 registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_REE2_HP_TWAI0    (BIT(7))
#define HP_PERI1_PMS_WRITE_REE2_HP_TWAI0_M  (HP_PERI1_PMS_WRITE_REE2_HP_TWAI0_V << HP_PERI1_PMS_WRITE_REE2_HP_TWAI0_S)
#define HP_PERI1_PMS_WRITE_REE2_HP_TWAI0_V  0x00000001U
#define HP_PERI1_PMS_WRITE_REE2_HP_TWAI0_S  7
/** HP_PERI1_PMS_HP_TWAI0_LOCK : R/W; bitpos: [8]; default: 0;
 *  Set 1 to lock hp_twai0 peri_apm configuration
 */
#define HP_PERI1_PMS_HP_TWAI0_LOCK    (BIT(8))
#define HP_PERI1_PMS_HP_TWAI0_LOCK_M  (HP_PERI1_PMS_HP_TWAI0_LOCK_V << HP_PERI1_PMS_HP_TWAI0_LOCK_S)
#define HP_PERI1_PMS_HP_TWAI0_LOCK_V  0x00000001U
#define HP_PERI1_PMS_HP_TWAI0_LOCK_S  8

/** HP_PERI1_PMS_HP_TWAI1_CTRL_REG register
 *  hp_twai1 read/write control register
 */
#define HP_PERI1_PMS_HP_TWAI1_CTRL_REG (DR_REG_HP_PERI1_PMS_BASE + 0x54)
/** HP_PERI1_PMS_READ_TEE_HP_TWAI1 : R/W; bitpos: [0]; default: 1;
 *  Configures hp_twai1 registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_TEE_HP_TWAI1    (BIT(0))
#define HP_PERI1_PMS_READ_TEE_HP_TWAI1_M  (HP_PERI1_PMS_READ_TEE_HP_TWAI1_V << HP_PERI1_PMS_READ_TEE_HP_TWAI1_S)
#define HP_PERI1_PMS_READ_TEE_HP_TWAI1_V  0x00000001U
#define HP_PERI1_PMS_READ_TEE_HP_TWAI1_S  0
/** HP_PERI1_PMS_READ_REE0_HP_TWAI1 : R/W; bitpos: [1]; default: 0;
 *  Configures hp_twai1 registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_REE0_HP_TWAI1    (BIT(1))
#define HP_PERI1_PMS_READ_REE0_HP_TWAI1_M  (HP_PERI1_PMS_READ_REE0_HP_TWAI1_V << HP_PERI1_PMS_READ_REE0_HP_TWAI1_S)
#define HP_PERI1_PMS_READ_REE0_HP_TWAI1_V  0x00000001U
#define HP_PERI1_PMS_READ_REE0_HP_TWAI1_S  1
/** HP_PERI1_PMS_READ_REE1_HP_TWAI1 : R/W; bitpos: [2]; default: 0;
 *  Configures hp_twai1 registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_REE1_HP_TWAI1    (BIT(2))
#define HP_PERI1_PMS_READ_REE1_HP_TWAI1_M  (HP_PERI1_PMS_READ_REE1_HP_TWAI1_V << HP_PERI1_PMS_READ_REE1_HP_TWAI1_S)
#define HP_PERI1_PMS_READ_REE1_HP_TWAI1_V  0x00000001U
#define HP_PERI1_PMS_READ_REE1_HP_TWAI1_S  2
/** HP_PERI1_PMS_READ_REE2_HP_TWAI1 : R/W; bitpos: [3]; default: 0;
 *  Configures hp_twai1 registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_REE2_HP_TWAI1    (BIT(3))
#define HP_PERI1_PMS_READ_REE2_HP_TWAI1_M  (HP_PERI1_PMS_READ_REE2_HP_TWAI1_V << HP_PERI1_PMS_READ_REE2_HP_TWAI1_S)
#define HP_PERI1_PMS_READ_REE2_HP_TWAI1_V  0x00000001U
#define HP_PERI1_PMS_READ_REE2_HP_TWAI1_S  3
/** HP_PERI1_PMS_WRITE_TEE_HP_TWAI1 : R/W; bitpos: [4]; default: 1;
 *  Configures hp_twai1 registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_TEE_HP_TWAI1    (BIT(4))
#define HP_PERI1_PMS_WRITE_TEE_HP_TWAI1_M  (HP_PERI1_PMS_WRITE_TEE_HP_TWAI1_V << HP_PERI1_PMS_WRITE_TEE_HP_TWAI1_S)
#define HP_PERI1_PMS_WRITE_TEE_HP_TWAI1_V  0x00000001U
#define HP_PERI1_PMS_WRITE_TEE_HP_TWAI1_S  4
/** HP_PERI1_PMS_WRITE_REE0_HP_TWAI1 : R/W; bitpos: [5]; default: 0;
 *  Configures hp_twai1 registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_REE0_HP_TWAI1    (BIT(5))
#define HP_PERI1_PMS_WRITE_REE0_HP_TWAI1_M  (HP_PERI1_PMS_WRITE_REE0_HP_TWAI1_V << HP_PERI1_PMS_WRITE_REE0_HP_TWAI1_S)
#define HP_PERI1_PMS_WRITE_REE0_HP_TWAI1_V  0x00000001U
#define HP_PERI1_PMS_WRITE_REE0_HP_TWAI1_S  5
/** HP_PERI1_PMS_WRITE_REE1_HP_TWAI1 : R/W; bitpos: [6]; default: 0;
 *  Configures hp_twai1 registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_REE1_HP_TWAI1    (BIT(6))
#define HP_PERI1_PMS_WRITE_REE1_HP_TWAI1_M  (HP_PERI1_PMS_WRITE_REE1_HP_TWAI1_V << HP_PERI1_PMS_WRITE_REE1_HP_TWAI1_S)
#define HP_PERI1_PMS_WRITE_REE1_HP_TWAI1_V  0x00000001U
#define HP_PERI1_PMS_WRITE_REE1_HP_TWAI1_S  6
/** HP_PERI1_PMS_WRITE_REE2_HP_TWAI1 : R/W; bitpos: [7]; default: 0;
 *  Configures hp_twai1 registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_REE2_HP_TWAI1    (BIT(7))
#define HP_PERI1_PMS_WRITE_REE2_HP_TWAI1_M  (HP_PERI1_PMS_WRITE_REE2_HP_TWAI1_V << HP_PERI1_PMS_WRITE_REE2_HP_TWAI1_S)
#define HP_PERI1_PMS_WRITE_REE2_HP_TWAI1_V  0x00000001U
#define HP_PERI1_PMS_WRITE_REE2_HP_TWAI1_S  7
/** HP_PERI1_PMS_HP_TWAI1_LOCK : R/W; bitpos: [8]; default: 0;
 *  Set 1 to lock hp_twai1 peri_apm configuration
 */
#define HP_PERI1_PMS_HP_TWAI1_LOCK    (BIT(8))
#define HP_PERI1_PMS_HP_TWAI1_LOCK_M  (HP_PERI1_PMS_HP_TWAI1_LOCK_V << HP_PERI1_PMS_HP_TWAI1_LOCK_S)
#define HP_PERI1_PMS_HP_TWAI1_LOCK_V  0x00000001U
#define HP_PERI1_PMS_HP_TWAI1_LOCK_S  8

