espressif/esp-idf/components/soc/esp32s31/register/soc/hp_peri1_pms_reg.h
/** HP_PERI1_PMS_HP_LCDCAM_CTRL_REG register
 *  hp_lcdcam read/write control register
 */
#define HP_PERI1_PMS_HP_LCDCAM_CTRL_REG (DR_REG_HP_PERI1_PMS_BASE + 0x58)
/** HP_PERI1_PMS_READ_TEE_HP_LCDCAM : R/W; bitpos: [0]; default: 1;
 *  Configures hp_lcdcam registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_TEE_HP_LCDCAM    (BIT(0))
#define HP_PERI1_PMS_READ_TEE_HP_LCDCAM_M  (HP_PERI1_PMS_READ_TEE_HP_LCDCAM_V << HP_PERI1_PMS_READ_TEE_HP_LCDCAM_S)
#define HP_PERI1_PMS_READ_TEE_HP_LCDCAM_V  0x00000001U
#define HP_PERI1_PMS_READ_TEE_HP_LCDCAM_S  0
/** HP_PERI1_PMS_READ_REE0_HP_LCDCAM : R/W; bitpos: [1]; default: 0;
 *  Configures hp_lcdcam registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_REE0_HP_LCDCAM    (BIT(1))
#define HP_PERI1_PMS_READ_REE0_HP_LCDCAM_M  (HP_PERI1_PMS_READ_REE0_HP_LCDCAM_V << HP_PERI1_PMS_READ_REE0_HP_LCDCAM_S)
#define HP_PERI1_PMS_READ_REE0_HP_LCDCAM_V  0x00000001U
#define HP_PERI1_PMS_READ_REE0_HP_LCDCAM_S  1
/** HP_PERI1_PMS_READ_REE1_HP_LCDCAM : R/W; bitpos: [2]; default: 0;
 *  Configures hp_lcdcam registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_REE1_HP_LCDCAM    (BIT(2))
#define HP_PERI1_PMS_READ_REE1_HP_LCDCAM_M  (HP_PERI1_PMS_READ_REE1_HP_LCDCAM_V << HP_PERI1_PMS_READ_REE1_HP_LCDCAM_S)
#define HP_PERI1_PMS_READ_REE1_HP_LCDCAM_V  0x00000001U
#define HP_PERI1_PMS_READ_REE1_HP_LCDCAM_S  2
/** HP_PERI1_PMS_READ_REE2_HP_LCDCAM : R/W; bitpos: [3]; default: 0;
 *  Configures hp_lcdcam registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_REE2_HP_LCDCAM    (BIT(3))
#define HP_PERI1_PMS_READ_REE2_HP_LCDCAM_M  (HP_PERI1_PMS_READ_REE2_HP_LCDCAM_V << HP_PERI1_PMS_READ_REE2_HP_LCDCAM_S)
#define HP_PERI1_PMS_READ_REE2_HP_LCDCAM_V  0x00000001U
#define HP_PERI1_PMS_READ_REE2_HP_LCDCAM_S  3
/** HP_PERI1_PMS_WRITE_TEE_HP_LCDCAM : R/W; bitpos: [4]; default: 1;
 *  Configures hp_lcdcam registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_TEE_HP_LCDCAM    (BIT(4))
#define HP_PERI1_PMS_WRITE_TEE_HP_LCDCAM_M  (HP_PERI1_PMS_WRITE_TEE_HP_LCDCAM_V << HP_PERI1_PMS_WRITE_TEE_HP_LCDCAM_S)
#define HP_PERI1_PMS_WRITE_TEE_HP_LCDCAM_V  0x00000001U
#define HP_PERI1_PMS_WRITE_TEE_HP_LCDCAM_S  4
/** HP_PERI1_PMS_WRITE_REE0_HP_LCDCAM : R/W; bitpos: [5]; default: 0;
 *  Configures hp_lcdcam registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_REE0_HP_LCDCAM    (BIT(5))
#define HP_PERI1_PMS_WRITE_REE0_HP_LCDCAM_M  (HP_PERI1_PMS_WRITE_REE0_HP_LCDCAM_V << HP_PERI1_PMS_WRITE_REE0_HP_LCDCAM_S)
#define HP_PERI1_PMS_WRITE_REE0_HP_LCDCAM_V  0x00000001U
#define HP_PERI1_PMS_WRITE_REE0_HP_LCDCAM_S  5
/** HP_PERI1_PMS_WRITE_REE1_HP_LCDCAM : R/W; bitpos: [6]; default: 0;
 *  Configures hp_lcdcam registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_REE1_HP_LCDCAM    (BIT(6))
#define HP_PERI1_PMS_WRITE_REE1_HP_LCDCAM_M  (HP_PERI1_PMS_WRITE_REE1_HP_LCDCAM_V << HP_PERI1_PMS_WRITE_REE1_HP_LCDCAM_S)
#define HP_PERI1_PMS_WRITE_REE1_HP_LCDCAM_V  0x00000001U
#define HP_PERI1_PMS_WRITE_REE1_HP_LCDCAM_S  6
/** HP_PERI1_PMS_WRITE_REE2_HP_LCDCAM : R/W; bitpos: [7]; default: 0;
 *  Configures hp_lcdcam registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_REE2_HP_LCDCAM    (BIT(7))
#define HP_PERI1_PMS_WRITE_REE2_HP_LCDCAM_M  (HP_PERI1_PMS_WRITE_REE2_HP_LCDCAM_V << HP_PERI1_PMS_WRITE_REE2_HP_LCDCAM_S)
#define HP_PERI1_PMS_WRITE_REE2_HP_LCDCAM_V  0x00000001U
#define HP_PERI1_PMS_WRITE_REE2_HP_LCDCAM_S  7
/** HP_PERI1_PMS_HP_LCDCAM_LOCK : R/W; bitpos: [8]; default: 0;
 *  Set 1 to lock hp_lcdcam peri_apm configuration
 */
#define HP_PERI1_PMS_HP_LCDCAM_LOCK    (BIT(8))
#define HP_PERI1_PMS_HP_LCDCAM_LOCK_M  (HP_PERI1_PMS_HP_LCDCAM_LOCK_V << HP_PERI1_PMS_HP_LCDCAM_LOCK_S)
#define HP_PERI1_PMS_HP_LCDCAM_LOCK_V  0x00000001U
#define HP_PERI1_PMS_HP_LCDCAM_LOCK_S  8

/** HP_PERI1_PMS_HP_UHCI_CTRL_REG register
 *  hp_uhci read/write control register
 */
#define HP_PERI1_PMS_HP_UHCI_CTRL_REG (DR_REG_HP_PERI1_PMS_BASE + 0x5c)
/** HP_PERI1_PMS_READ_TEE_HP_UHCI : R/W; bitpos: [0]; default: 1;
 *  Configures hp_uhci registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_TEE_HP_UHCI    (BIT(0))
#define HP_PERI1_PMS_READ_TEE_HP_UHCI_M  (HP_PERI1_PMS_READ_TEE_HP_UHCI_V << HP_PERI1_PMS_READ_TEE_HP_UHCI_S)
#define HP_PERI1_PMS_READ_TEE_HP_UHCI_V  0x00000001U
#define HP_PERI1_PMS_READ_TEE_HP_UHCI_S  0
/** HP_PERI1_PMS_READ_REE0_HP_UHCI : R/W; bitpos: [1]; default: 0;
 *  Configures hp_uhci registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_REE0_HP_UHCI    (BIT(1))
#define HP_PERI1_PMS_READ_REE0_HP_UHCI_M  (HP_PERI1_PMS_READ_REE0_HP_UHCI_V << HP_PERI1_PMS_READ_REE0_HP_UHCI_S)
#define HP_PERI1_PMS_READ_REE0_HP_UHCI_V  0x00000001U
#define HP_PERI1_PMS_READ_REE0_HP_UHCI_S  1
/** HP_PERI1_PMS_READ_REE1_HP_UHCI : R/W; bitpos: [2]; default: 0;
 *  Configures hp_uhci registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_REE1_HP_UHCI    (BIT(2))
#define HP_PERI1_PMS_READ_REE1_HP_UHCI_M  (HP_PERI1_PMS_READ_REE1_HP_UHCI_V << HP_PERI1_PMS_READ_REE1_HP_UHCI_S)
#define HP_PERI1_PMS_READ_REE1_HP_UHCI_V  0x00000001U
#define HP_PERI1_PMS_READ_REE1_HP_UHCI_S  2
/** HP_PERI1_PMS_READ_REE2_HP_UHCI : R/W; bitpos: [3]; default: 0;
 *  Configures hp_uhci registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_REE2_HP_UHCI    (BIT(3))
#define HP_PERI1_PMS_READ_REE2_HP_UHCI_M  (HP_PERI1_PMS_READ_REE2_HP_UHCI_V << HP_PERI1_PMS_READ_REE2_HP_UHCI_S)
#define HP_PERI1_PMS_READ_REE2_HP_UHCI_V  0x00000001U
#define HP_PERI1_PMS_READ_REE2_HP_UHCI_S  3
/** HP_PERI1_PMS_WRITE_TEE_HP_UHCI : R/W; bitpos: [4]; default: 1;
 *  Configures hp_uhci registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_TEE_HP_UHCI    (BIT(4))
#define HP_PERI1_PMS_WRITE_TEE_HP_UHCI_M  (HP_PERI1_PMS_WRITE_TEE_HP_UHCI_V << HP_PERI1_PMS_WRITE_TEE_HP_UHCI_S)
#define HP_PERI1_PMS_WRITE_TEE_HP_UHCI_V  0x00000001U
#define HP_PERI1_PMS_WRITE_TEE_HP_UHCI_S  4
/** HP_PERI1_PMS_WRITE_REE0_HP_UHCI : R/W; bitpos: [5]; default: 0;
 *  Configures hp_uhci registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_REE0_HP_UHCI    (BIT(5))
#define HP_PERI1_PMS_WRITE_REE0_HP_UHCI_M  (HP_PERI1_PMS_WRITE_REE0_HP_UHCI_V << HP_PERI1_PMS_WRITE_REE0_HP_UHCI_S)
#define HP_PERI1_PMS_WRITE_REE0_HP_UHCI_V  0x00000001U
#define HP_PERI1_PMS_WRITE_REE0_HP_UHCI_S  5
/** HP_PERI1_PMS_WRITE_REE1_HP_UHCI : R/W; bitpos: [6]; default: 0;
 *  Configures hp_uhci registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_REE1_HP_UHCI    (BIT(6))
#define HP_PERI1_PMS_WRITE_REE1_HP_UHCI_M  (HP_PERI1_PMS_WRITE_REE1_HP_UHCI_V << HP_PERI1_PMS_WRITE_REE1_HP_UHCI_S)
#define HP_PERI1_PMS_WRITE_REE1_HP_UHCI_V  0x00000001U
#define HP_PERI1_PMS_WRITE_REE1_HP_UHCI_S  6
/** HP_PERI1_PMS_WRITE_REE2_HP_UHCI : R/W; bitpos: [7]; default: 0;
 *  Configures hp_uhci registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_REE2_HP_UHCI    (BIT(7))
#define HP_PERI1_PMS_WRITE_REE2_HP_UHCI_M  (HP_PERI1_PMS_WRITE_REE2_HP_UHCI_V << HP_PERI1_PMS_WRITE_REE2_HP_UHCI_S)
#define HP_PERI1_PMS_WRITE_REE2_HP_UHCI_V  0x00000001U
#define HP_PERI1_PMS_WRITE_REE2_HP_UHCI_S  7
/** HP_PERI1_PMS_HP_UHCI_LOCK : R/W; bitpos: [8]; default: 0;
 *  Set 1 to lock hp_uhci peri_apm configuration
 */
#define HP_PERI1_PMS_HP_UHCI_LOCK    (BIT(8))
#define HP_PERI1_PMS_HP_UHCI_LOCK_M  (HP_PERI1_PMS_HP_UHCI_LOCK_V << HP_PERI1_PMS_HP_UHCI_LOCK_S)
#define HP_PERI1_PMS_HP_UHCI_LOCK_V  0x00000001U
#define HP_PERI1_PMS_HP_UHCI_LOCK_S  8

/** HP_PERI1_PMS_HP_SYSTIMER_CTRL_REG register
 *  hp_systimer read/write control register
 */
#define HP_PERI1_PMS_HP_SYSTIMER_CTRL_REG (DR_REG_HP_PERI1_PMS_BASE + 0x60)
/** HP_PERI1_PMS_READ_TEE_HP_SYSTIMER : R/W; bitpos: [0]; default: 1;
 *  Configures hp_systimer registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_TEE_HP_SYSTIMER    (BIT(0))
#define HP_PERI1_PMS_READ_TEE_HP_SYSTIMER_M  (HP_PERI1_PMS_READ_TEE_HP_SYSTIMER_V << HP_PERI1_PMS_READ_TEE_HP_SYSTIMER_S)
#define HP_PERI1_PMS_READ_TEE_HP_SYSTIMER_V  0x00000001U
#define HP_PERI1_PMS_READ_TEE_HP_SYSTIMER_S  0
/** HP_PERI1_PMS_READ_REE0_HP_SYSTIMER : R/W; bitpos: [1]; default: 0;
 *  Configures hp_systimer registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_REE0_HP_SYSTIMER    (BIT(1))
#define HP_PERI1_PMS_READ_REE0_HP_SYSTIMER_M  (HP_PERI1_PMS_READ_REE0_HP_SYSTIMER_V << HP_PERI1_PMS_READ_REE0_HP_SYSTIMER_S)
#define HP_PERI1_PMS_READ_REE0_HP_SYSTIMER_V  0x00000001U
#define HP_PERI1_PMS_READ_REE0_HP_SYSTIMER_S  1
/** HP_PERI1_PMS_READ_REE1_HP_SYSTIMER : R/W; bitpos: [2]; default: 0;
 *  Configures hp_systimer registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_REE1_HP_SYSTIMER    (BIT(2))
#define HP_PERI1_PMS_READ_REE1_HP_SYSTIMER_M  (HP_PERI1_PMS_READ_REE1_HP_SYSTIMER_V << HP_PERI1_PMS_READ_REE1_HP_SYSTIMER_S)
#define HP_PERI1_PMS_READ_REE1_HP_SYSTIMER_V  0x00000001U
#define HP_PERI1_PMS_READ_REE1_HP_SYSTIMER_S  2
/** HP_PERI1_PMS_READ_REE2_HP_SYSTIMER : R/W; bitpos: [3]; default: 0;
 *  Configures hp_systimer registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_REE2_HP_SYSTIMER    (BIT(3))
#define HP_PERI1_PMS_READ_REE2_HP_SYSTIMER_M  (HP_PERI1_PMS_READ_REE2_HP_SYSTIMER_V << HP_PERI1_PMS_READ_REE2_HP_SYSTIMER_S)
#define HP_PERI1_PMS_READ_REE2_HP_SYSTIMER_V  0x00000001U
#define HP_PERI1_PMS_READ_REE2_HP_SYSTIMER_S  3
/** HP_PERI1_PMS_WRITE_TEE_HP_SYSTIMER : R/W; bitpos: [4]; default: 1;
 *  Configures hp_systimer registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_TEE_HP_SYSTIMER    (BIT(4))
#define HP_PERI1_PMS_WRITE_TEE_HP_SYSTIMER_M  (HP_PERI1_PMS_WRITE_TEE_HP_SYSTIMER_V << HP_PERI1_PMS_WRITE_TEE_HP_SYSTIMER_S)
#define HP_PERI1_PMS_WRITE_TEE_HP_SYSTIMER_V  0x00000001U
#define HP_PERI1_PMS_WRITE_TEE_HP_SYSTIMER_S  4
/** HP_PERI1_PMS_WRITE_REE0_HP_SYSTIMER : R/W; bitpos: [5]; default: 0;
 *  Configures hp_systimer registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_REE0_HP_SYSTIMER    (BIT(5))
#define HP_PERI1_PMS_WRITE_REE0_HP_SYSTIMER_M  (HP_PERI1_PMS_WRITE_REE0_HP_SYSTIMER_V << HP_PERI1_PMS_WRITE_REE0_HP_SYSTIMER_S)
#define HP_PERI1_PMS_WRITE_REE0_HP_SYSTIMER_V  0x00000001U
#define HP_PERI1_PMS_WRITE_REE0_HP_SYSTIMER_S  5
/** HP_PERI1_PMS_WRITE_REE1_HP_SYSTIMER : R/W; bitpos: [6]; default: 0;
 *  Configures hp_systimer registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_REE1_HP_SYSTIMER    (BIT(6))
#define HP_PERI1_PMS_WRITE_REE1_HP_SYSTIMER_M  (HP_PERI1_PMS_WRITE_REE1_HP_SYSTIMER_V << HP_PERI1_PMS_WRITE_REE1_HP_SYSTIMER_S)
#define HP_PERI1_PMS_WRITE_REE1_HP_SYSTIMER_V  0x00000001U
#define HP_PERI1_PMS_WRITE_REE1_HP_SYSTIMER_S  6
/** HP_PERI1_PMS_WRITE_REE2_HP_SYSTIMER : R/W; bitpos: [7]; default: 0;
 *  Configures hp_systimer registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_REE2_HP_SYSTIMER    (BIT(7))
#define HP_PERI1_PMS_WRITE_REE2_HP_SYSTIMER_M  (HP_PERI1_PMS_WRITE_REE2_HP_SYSTIMER_V << HP_PERI1_PMS_WRITE_REE2_HP_SYSTIMER_S)
#define HP_PERI1_PMS_WRITE_REE2_HP_SYSTIMER_V  0x00000001U
#define HP_PERI1_PMS_WRITE_REE2_HP_SYSTIMER_S  7
/** HP_PERI1_PMS_HP_SYSTIMER_LOCK : R/W; bitpos: [8]; default: 0;
 *  Set 1 to lock hp_systimer peri_apm configuration
 */
#define HP_PERI1_PMS_HP_SYSTIMER_LOCK    (BIT(8))
#define HP_PERI1_PMS_HP_SYSTIMER_LOCK_M  (HP_PERI1_PMS_HP_SYSTIMER_LOCK_V << HP_PERI1_PMS_HP_SYSTIMER_LOCK_S)
#define HP_PERI1_PMS_HP_SYSTIMER_LOCK_V  0x00000001U
#define HP_PERI1_PMS_HP_SYSTIMER_LOCK_S  8

/** HP_PERI1_PMS_HP_ZERO_DET_CTRL_REG register
 *  hp_zero_det read/write control register
 */
#define HP_PERI1_PMS_HP_ZERO_DET_CTRL_REG (DR_REG_HP_PERI1_PMS_BASE + 0x64)
/** HP_PERI1_PMS_READ_TEE_HP_ZERO_DET : R/W; bitpos: [0]; default: 1;
 *  Configures hp_zero_det registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_TEE_HP_ZERO_DET    (BIT(0))
#define HP_PERI1_PMS_READ_TEE_HP_ZERO_DET_M  (HP_PERI1_PMS_READ_TEE_HP_ZERO_DET_V << HP_PERI1_PMS_READ_TEE_HP_ZERO_DET_S)
#define HP_PERI1_PMS_READ_TEE_HP_ZERO_DET_V  0x00000001U
#define HP_PERI1_PMS_READ_TEE_HP_ZERO_DET_S  0
/** HP_PERI1_PMS_READ_REE0_HP_ZERO_DET : R/W; bitpos: [1]; default: 0;
 *  Configures hp_zero_det registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_REE0_HP_ZERO_DET    (BIT(1))
#define HP_PERI1_PMS_READ_REE0_HP_ZERO_DET_M  (HP_PERI1_PMS_READ_REE0_HP_ZERO_DET_V << HP_PERI1_PMS_READ_REE0_HP_ZERO_DET_S)
#define HP_PERI1_PMS_READ_REE0_HP_ZERO_DET_V  0x00000001U
#define HP_PERI1_PMS_READ_REE0_HP_ZERO_DET_S  1
/** HP_PERI1_PMS_READ_REE1_HP_ZERO_DET : R/W; bitpos: [2]; default: 0;
 *  Configures hp_zero_det registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_REE1_HP_ZERO_DET    (BIT(2))
#define HP_PERI1_PMS_READ_REE1_HP_ZERO_DET_M  (HP_PERI1_PMS_READ_REE1_HP_ZERO_DET_V << HP_PERI1_PMS_READ_REE1_HP_ZERO_DET_S)
#define HP_PERI1_PMS_READ_REE1_HP_ZERO_DET_V  0x00000001U
#define HP_PERI1_PMS_READ_REE1_HP_ZERO_DET_S  2
/** HP_PERI1_PMS_READ_REE2_HP_ZERO_DET : R/W; bitpos: [3]; default: 0;
 *  Configures hp_zero_det registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_REE2_HP_ZERO_DET    (BIT(3))
#define HP_PERI1_PMS_READ_REE2_HP_ZERO_DET_M  (HP_PERI1_PMS_READ_REE2_HP_ZERO_DET_V << HP_PERI1_PMS_READ_REE2_HP_ZERO_DET_S)
#define HP_PERI1_PMS_READ_REE2_HP_ZERO_DET_V  0x00000001U
#define HP_PERI1_PMS_READ_REE2_HP_ZERO_DET_S  3
/** HP_PERI1_PMS_WRITE_TEE_HP_ZERO_DET : R/W; bitpos: [4]; default: 1;
 *  Configures hp_zero_det registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_TEE_HP_ZERO_DET    (BIT(4))
#define HP_PERI1_PMS_WRITE_TEE_HP_ZERO_DET_M  (HP_PERI1_PMS_WRITE_TEE_HP_ZERO_DET_V << HP_PERI1_PMS_WRITE_TEE_HP_ZERO_DET_S)
#define HP_PERI1_PMS_WRITE_TEE_HP_ZERO_DET_V  0x00000001U
#define HP_PERI1_PMS_WRITE_TEE_HP_ZERO_DET_S  4
/** HP_PERI1_PMS_WRITE_REE0_HP_ZERO_DET : R/W; bitpos: [5]; default: 0;
 *  Configures hp_zero_det registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_REE0_HP_ZERO_DET    (BIT(5))
#define HP_PERI1_PMS_WRITE_REE0_HP_ZERO_DET_M  (HP_PERI1_PMS_WRITE_REE0_HP_ZERO_DET_V << HP_PERI1_PMS_WRITE_REE0_HP_ZERO_DET_S)
#define HP_PERI1_PMS_WRITE_REE0_HP_ZERO_DET_V  0x00000001U
#define HP_PERI1_PMS_WRITE_REE0_HP_ZERO_DET_S  5
/** HP_PERI1_PMS_WRITE_REE1_HP_ZERO_DET : R/W; bitpos: [6]; default: 0;
 *  Configures hp_zero_det registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_REE1_HP_ZERO_DET    (BIT(6))
#define HP_PERI1_PMS_WRITE_REE1_HP_ZERO_DET_M  (HP_PERI1_PMS_WRITE_REE1_HP_ZERO_DET_V << HP_PERI1_PMS_WRITE_REE1_HP_ZERO_DET_S)
#define HP_PERI1_PMS_WRITE_REE1_HP_ZERO_DET_V  0x00000001U
#define HP_PERI1_PMS_WRITE_REE1_HP_ZERO_DET_S  6
/** HP_PERI1_PMS_WRITE_REE2_HP_ZERO_DET : R/W; bitpos: [7]; default: 0;
 *  Configures hp_zero_det registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_REE2_HP_ZERO_DET    (BIT(7))
#define HP_PERI1_PMS_WRITE_REE2_HP_ZERO_DET_M  (HP_PERI1_PMS_WRITE_REE2_HP_ZERO_DET_V << HP_PERI1_PMS_WRITE_REE2_HP_ZERO_DET_S)
#define HP_PERI1_PMS_WRITE_REE2_HP_ZERO_DET_V  0x00000001U
#define HP_PERI1_PMS_WRITE_REE2_HP_ZERO_DET_S  7
/** HP_PERI1_PMS_HP_ZERO_DET_LOCK : R/W; bitpos: [8]; default: 0;
 *  Set 1 to lock hp_zero_det peri_apm configuration
 */
#define HP_PERI1_PMS_HP_ZERO_DET_LOCK    (BIT(8))
#define HP_PERI1_PMS_HP_ZERO_DET_LOCK_M  (HP_PERI1_PMS_HP_ZERO_DET_LOCK_V << HP_PERI1_PMS_HP_ZERO_DET_LOCK_S)
#define HP_PERI1_PMS_HP_ZERO_DET_LOCK_V  0x00000001U
#define HP_PERI1_PMS_HP_ZERO_DET_LOCK_S  8

/** HP_PERI1_PMS_HP_CORDIC_CTRL_REG register
 *  hp_cordic read/write control register
 */
#define HP_PERI1_PMS_HP_CORDIC_CTRL_REG (DR_REG_HP_PERI1_PMS_BASE + 0x68)
/** HP_PERI1_PMS_READ_TEE_HP_CORDIC : R/W; bitpos: [0]; default: 1;
 *  Configures hp_cordic registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_TEE_HP_CORDIC    (BIT(0))
#define HP_PERI1_PMS_READ_TEE_HP_CORDIC_M  (HP_PERI1_PMS_READ_TEE_HP_CORDIC_V << HP_PERI1_PMS_READ_TEE_HP_CORDIC_S)
#define HP_PERI1_PMS_READ_TEE_HP_CORDIC_V  0x00000001U
#define HP_PERI1_PMS_READ_TEE_HP_CORDIC_S  0
/** HP_PERI1_PMS_READ_REE0_HP_CORDIC : R/W; bitpos: [1]; default: 0;
 *  Configures hp_cordic registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_REE0_HP_CORDIC    (BIT(1))
#define HP_PERI1_PMS_READ_REE0_HP_CORDIC_M  (HP_PERI1_PMS_READ_REE0_HP_CORDIC_V << HP_PERI1_PMS_READ_REE0_HP_CORDIC_S)
#define HP_PERI1_PMS_READ_REE0_HP_CORDIC_V  0x00000001U
#define HP_PERI1_PMS_READ_REE0_HP_CORDIC_S  1
/** HP_PERI1_PMS_READ_REE1_HP_CORDIC : R/W; bitpos: [2]; default: 0;
 *  Configures hp_cordic registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_REE1_HP_CORDIC    (BIT(2))
#define HP_PERI1_PMS_READ_REE1_HP_CORDIC_M  (HP_PERI1_PMS_READ_REE1_HP_CORDIC_V << HP_PERI1_PMS_READ_REE1_HP_CORDIC_S)
#define HP_PERI1_PMS_READ_REE1_HP_CORDIC_V  0x00000001U
#define HP_PERI1_PMS_READ_REE1_HP_CORDIC_S  2
/** HP_PERI1_PMS_READ_REE2_HP_CORDIC : R/W; bitpos: [3]; default: 0;
 *  Configures hp_cordic registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_REE2_HP_CORDIC    (BIT(3))
#define HP_PERI1_PMS_READ_REE2_HP_CORDIC_M  (HP_PERI1_PMS_READ_REE2_HP_CORDIC_V << HP_PERI1_PMS_READ_REE2_HP_CORDIC_S)
#define HP_PERI1_PMS_READ_REE2_HP_CORDIC_V  0x00000001U
#define HP_PERI1_PMS_READ_REE2_HP_CORDIC_S  3
/** HP_PERI1_PMS_WRITE_TEE_HP_CORDIC : R/W; bitpos: [4]; default: 1;
 *  Configures hp_cordic registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_TEE_HP_CORDIC    (BIT(4))
#define HP_PERI1_PMS_WRITE_TEE_HP_CORDIC_M  (HP_PERI1_PMS_WRITE_TEE_HP_CORDIC_V << HP_PERI1_PMS_WRITE_TEE_HP_CORDIC_S)
#define HP_PERI1_PMS_WRITE_TEE_HP_CORDIC_V  0x00000001U
#define HP_PERI1_PMS_WRITE_TEE_HP_CORDIC_S  4
/** HP_PERI1_PMS_WRITE_REE0_HP_CORDIC : R/W; bitpos: [5]; default: 0;
 *  Configures hp_cordic registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_REE0_HP_CORDIC    (BIT(5))
#define HP_PERI1_PMS_WRITE_REE0_HP_CORDIC_M  (HP_PERI1_PMS_WRITE_REE0_HP_CORDIC_V << HP_PERI1_PMS_WRITE_REE0_HP_CORDIC_S)
#define HP_PERI1_PMS_WRITE_REE0_HP_CORDIC_V  0x00000001U
#define HP_PERI1_PMS_WRITE_REE0_HP_CORDIC_S  5
/** HP_PERI1_PMS_WRITE_REE1_HP_CORDIC : R/W; bitpos: [6]; default: 0;
 *  Configures hp_cordic registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_REE1_HP_CORDIC    (BIT(6))
#define HP_PERI1_PMS_WRITE_REE1_HP_CORDIC_M  (HP_PERI1_PMS_WRITE_REE1_HP_CORDIC_V << HP_PERI1_PMS_WRITE_REE1_HP_CORDIC_S)
#define HP_PERI1_PMS_WRITE_REE1_HP_CORDIC_V  0x00000001U
#define HP_PERI1_PMS_WRITE_REE1_HP_CORDIC_S  6
/** HP_PERI1_PMS_WRITE_REE2_HP_CORDIC : R/W; bitpos: [7]; default: 0;
 *  Configures hp_cordic registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_REE2_HP_CORDIC    (BIT(7))
#define HP_PERI1_PMS_WRITE_REE2_HP_CORDIC_M  (HP_PERI1_PMS_WRITE_REE2_HP_CORDIC_V << HP_PERI1_PMS_WRITE_REE2_HP_CORDIC_S)
#define HP_PERI1_PMS_WRITE_REE2_HP_CORDIC_V  0x00000001U
#define HP_PERI1_PMS_WRITE_REE2_HP_CORDIC_S  7
/** HP_PERI1_PMS_HP_CORDIC_LOCK : R/W; bitpos: [8]; default: 0;
 *  Set 1 to lock hp_cordic peri_apm configuration
 */
#define HP_PERI1_PMS_HP_CORDIC_LOCK    (BIT(8))
#define HP_PERI1_PMS_HP_CORDIC_LOCK_M  (HP_PERI1_PMS_HP_CORDIC_LOCK_V << HP_PERI1_PMS_HP_CORDIC_LOCK_S)
#define HP_PERI1_PMS_HP_CORDIC_LOCK_V  0x00000001U
#define HP_PERI1_PMS_HP_CORDIC_LOCK_S  8

