espressif/esp-idf/components/soc/esp32s31/register/soc/hp_peri1_pms_reg.h
/** HP_PERI1_PMS_HP_LEDC1_CTRL_REG register
 *  hp_ledc1 read/write control register
 */
#define HP_PERI1_PMS_HP_LEDC1_CTRL_REG (DR_REG_HP_PERI1_PMS_BASE + 0x6c)
/** HP_PERI1_PMS_READ_TEE_HP_LEDC1 : R/W; bitpos: [0]; default: 1;
 *  Configures hp_ledc1 registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_TEE_HP_LEDC1    (BIT(0))
#define HP_PERI1_PMS_READ_TEE_HP_LEDC1_M  (HP_PERI1_PMS_READ_TEE_HP_LEDC1_V << HP_PERI1_PMS_READ_TEE_HP_LEDC1_S)
#define HP_PERI1_PMS_READ_TEE_HP_LEDC1_V  0x00000001U
#define HP_PERI1_PMS_READ_TEE_HP_LEDC1_S  0
/** HP_PERI1_PMS_READ_REE0_HP_LEDC1 : R/W; bitpos: [1]; default: 0;
 *  Configures hp_ledc1 registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_REE0_HP_LEDC1    (BIT(1))
#define HP_PERI1_PMS_READ_REE0_HP_LEDC1_M  (HP_PERI1_PMS_READ_REE0_HP_LEDC1_V << HP_PERI1_PMS_READ_REE0_HP_LEDC1_S)
#define HP_PERI1_PMS_READ_REE0_HP_LEDC1_V  0x00000001U
#define HP_PERI1_PMS_READ_REE0_HP_LEDC1_S  1
/** HP_PERI1_PMS_READ_REE1_HP_LEDC1 : R/W; bitpos: [2]; default: 0;
 *  Configures hp_ledc1 registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_REE1_HP_LEDC1    (BIT(2))
#define HP_PERI1_PMS_READ_REE1_HP_LEDC1_M  (HP_PERI1_PMS_READ_REE1_HP_LEDC1_V << HP_PERI1_PMS_READ_REE1_HP_LEDC1_S)
#define HP_PERI1_PMS_READ_REE1_HP_LEDC1_V  0x00000001U
#define HP_PERI1_PMS_READ_REE1_HP_LEDC1_S  2
/** HP_PERI1_PMS_READ_REE2_HP_LEDC1 : R/W; bitpos: [3]; default: 0;
 *  Configures hp_ledc1 registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_REE2_HP_LEDC1    (BIT(3))
#define HP_PERI1_PMS_READ_REE2_HP_LEDC1_M  (HP_PERI1_PMS_READ_REE2_HP_LEDC1_V << HP_PERI1_PMS_READ_REE2_HP_LEDC1_S)
#define HP_PERI1_PMS_READ_REE2_HP_LEDC1_V  0x00000001U
#define HP_PERI1_PMS_READ_REE2_HP_LEDC1_S  3
/** HP_PERI1_PMS_WRITE_TEE_HP_LEDC1 : R/W; bitpos: [4]; default: 1;
 *  Configures hp_ledc1 registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_TEE_HP_LEDC1    (BIT(4))
#define HP_PERI1_PMS_WRITE_TEE_HP_LEDC1_M  (HP_PERI1_PMS_WRITE_TEE_HP_LEDC1_V << HP_PERI1_PMS_WRITE_TEE_HP_LEDC1_S)
#define HP_PERI1_PMS_WRITE_TEE_HP_LEDC1_V  0x00000001U
#define HP_PERI1_PMS_WRITE_TEE_HP_LEDC1_S  4
/** HP_PERI1_PMS_WRITE_REE0_HP_LEDC1 : R/W; bitpos: [5]; default: 0;
 *  Configures hp_ledc1 registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_REE0_HP_LEDC1    (BIT(5))
#define HP_PERI1_PMS_WRITE_REE0_HP_LEDC1_M  (HP_PERI1_PMS_WRITE_REE0_HP_LEDC1_V << HP_PERI1_PMS_WRITE_REE0_HP_LEDC1_S)
#define HP_PERI1_PMS_WRITE_REE0_HP_LEDC1_V  0x00000001U
#define HP_PERI1_PMS_WRITE_REE0_HP_LEDC1_S  5
/** HP_PERI1_PMS_WRITE_REE1_HP_LEDC1 : R/W; bitpos: [6]; default: 0;
 *  Configures hp_ledc1 registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_REE1_HP_LEDC1    (BIT(6))
#define HP_PERI1_PMS_WRITE_REE1_HP_LEDC1_M  (HP_PERI1_PMS_WRITE_REE1_HP_LEDC1_V << HP_PERI1_PMS_WRITE_REE1_HP_LEDC1_S)
#define HP_PERI1_PMS_WRITE_REE1_HP_LEDC1_V  0x00000001U
#define HP_PERI1_PMS_WRITE_REE1_HP_LEDC1_S  6
/** HP_PERI1_PMS_WRITE_REE2_HP_LEDC1 : R/W; bitpos: [7]; default: 0;
 *  Configures hp_ledc1 registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_REE2_HP_LEDC1    (BIT(7))
#define HP_PERI1_PMS_WRITE_REE2_HP_LEDC1_M  (HP_PERI1_PMS_WRITE_REE2_HP_LEDC1_V << HP_PERI1_PMS_WRITE_REE2_HP_LEDC1_S)
#define HP_PERI1_PMS_WRITE_REE2_HP_LEDC1_V  0x00000001U
#define HP_PERI1_PMS_WRITE_REE2_HP_LEDC1_S  7
/** HP_PERI1_PMS_HP_LEDC1_LOCK : R/W; bitpos: [8]; default: 0;
 *  Set 1 to lock hp_ledc1 peri_apm configuration
 */
#define HP_PERI1_PMS_HP_LEDC1_LOCK    (BIT(8))
#define HP_PERI1_PMS_HP_LEDC1_LOCK_M  (HP_PERI1_PMS_HP_LEDC1_LOCK_V << HP_PERI1_PMS_HP_LEDC1_LOCK_S)
#define HP_PERI1_PMS_HP_LEDC1_LOCK_V  0x00000001U
#define HP_PERI1_PMS_HP_LEDC1_LOCK_S  8

/** HP_PERI1_PMS_HP_PCNT1_CTRL_REG register
 *  hp_pcnt1 read/write control register
 */
#define HP_PERI1_PMS_HP_PCNT1_CTRL_REG (DR_REG_HP_PERI1_PMS_BASE + 0x70)
/** HP_PERI1_PMS_READ_TEE_HP_PCNT1 : R/W; bitpos: [0]; default: 1;
 *  Configures hp_pcnt1 registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_TEE_HP_PCNT1    (BIT(0))
#define HP_PERI1_PMS_READ_TEE_HP_PCNT1_M  (HP_PERI1_PMS_READ_TEE_HP_PCNT1_V << HP_PERI1_PMS_READ_TEE_HP_PCNT1_S)
#define HP_PERI1_PMS_READ_TEE_HP_PCNT1_V  0x00000001U
#define HP_PERI1_PMS_READ_TEE_HP_PCNT1_S  0
/** HP_PERI1_PMS_READ_REE0_HP_PCNT1 : R/W; bitpos: [1]; default: 0;
 *  Configures hp_pcnt1 registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_REE0_HP_PCNT1    (BIT(1))
#define HP_PERI1_PMS_READ_REE0_HP_PCNT1_M  (HP_PERI1_PMS_READ_REE0_HP_PCNT1_V << HP_PERI1_PMS_READ_REE0_HP_PCNT1_S)
#define HP_PERI1_PMS_READ_REE0_HP_PCNT1_V  0x00000001U
#define HP_PERI1_PMS_READ_REE0_HP_PCNT1_S  1
/** HP_PERI1_PMS_READ_REE1_HP_PCNT1 : R/W; bitpos: [2]; default: 0;
 *  Configures hp_pcnt1 registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_REE1_HP_PCNT1    (BIT(2))
#define HP_PERI1_PMS_READ_REE1_HP_PCNT1_M  (HP_PERI1_PMS_READ_REE1_HP_PCNT1_V << HP_PERI1_PMS_READ_REE1_HP_PCNT1_S)
#define HP_PERI1_PMS_READ_REE1_HP_PCNT1_V  0x00000001U
#define HP_PERI1_PMS_READ_REE1_HP_PCNT1_S  2
/** HP_PERI1_PMS_READ_REE2_HP_PCNT1 : R/W; bitpos: [3]; default: 0;
 *  Configures hp_pcnt1 registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_REE2_HP_PCNT1    (BIT(3))
#define HP_PERI1_PMS_READ_REE2_HP_PCNT1_M  (HP_PERI1_PMS_READ_REE2_HP_PCNT1_V << HP_PERI1_PMS_READ_REE2_HP_PCNT1_S)
#define HP_PERI1_PMS_READ_REE2_HP_PCNT1_V  0x00000001U
#define HP_PERI1_PMS_READ_REE2_HP_PCNT1_S  3
/** HP_PERI1_PMS_WRITE_TEE_HP_PCNT1 : R/W; bitpos: [4]; default: 1;
 *  Configures hp_pcnt1 registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_TEE_HP_PCNT1    (BIT(4))
#define HP_PERI1_PMS_WRITE_TEE_HP_PCNT1_M  (HP_PERI1_PMS_WRITE_TEE_HP_PCNT1_V << HP_PERI1_PMS_WRITE_TEE_HP_PCNT1_S)
#define HP_PERI1_PMS_WRITE_TEE_HP_PCNT1_V  0x00000001U
#define HP_PERI1_PMS_WRITE_TEE_HP_PCNT1_S  4
/** HP_PERI1_PMS_WRITE_REE0_HP_PCNT1 : R/W; bitpos: [5]; default: 0;
 *  Configures hp_pcnt1 registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_REE0_HP_PCNT1    (BIT(5))
#define HP_PERI1_PMS_WRITE_REE0_HP_PCNT1_M  (HP_PERI1_PMS_WRITE_REE0_HP_PCNT1_V << HP_PERI1_PMS_WRITE_REE0_HP_PCNT1_S)
#define HP_PERI1_PMS_WRITE_REE0_HP_PCNT1_V  0x00000001U
#define HP_PERI1_PMS_WRITE_REE0_HP_PCNT1_S  5
/** HP_PERI1_PMS_WRITE_REE1_HP_PCNT1 : R/W; bitpos: [6]; default: 0;
 *  Configures hp_pcnt1 registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_REE1_HP_PCNT1    (BIT(6))
#define HP_PERI1_PMS_WRITE_REE1_HP_PCNT1_M  (HP_PERI1_PMS_WRITE_REE1_HP_PCNT1_V << HP_PERI1_PMS_WRITE_REE1_HP_PCNT1_S)
#define HP_PERI1_PMS_WRITE_REE1_HP_PCNT1_V  0x00000001U
#define HP_PERI1_PMS_WRITE_REE1_HP_PCNT1_S  6
/** HP_PERI1_PMS_WRITE_REE2_HP_PCNT1 : R/W; bitpos: [7]; default: 0;
 *  Configures hp_pcnt1 registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_REE2_HP_PCNT1    (BIT(7))
#define HP_PERI1_PMS_WRITE_REE2_HP_PCNT1_M  (HP_PERI1_PMS_WRITE_REE2_HP_PCNT1_V << HP_PERI1_PMS_WRITE_REE2_HP_PCNT1_S)
#define HP_PERI1_PMS_WRITE_REE2_HP_PCNT1_V  0x00000001U
#define HP_PERI1_PMS_WRITE_REE2_HP_PCNT1_S  7
/** HP_PERI1_PMS_HP_PCNT1_LOCK : R/W; bitpos: [8]; default: 0;
 *  Set 1 to lock hp_pcnt1 peri_apm configuration
 */
#define HP_PERI1_PMS_HP_PCNT1_LOCK    (BIT(8))
#define HP_PERI1_PMS_HP_PCNT1_LOCK_M  (HP_PERI1_PMS_HP_PCNT1_LOCK_V << HP_PERI1_PMS_HP_PCNT1_LOCK_S)
#define HP_PERI1_PMS_HP_PCNT1_LOCK_V  0x00000001U
#define HP_PERI1_PMS_HP_PCNT1_LOCK_S  8

