espressif/esp-idf/components/soc/esp32s31/register/soc/hp_peri1_pms_reg.h
/** HP_PERI1_PMS_HP_TIMER_GROUP0_CTRL_REG register
 *  hp_timer_group0 read/write control register
 */
#define HP_PERI1_PMS_HP_TIMER_GROUP0_CTRL_REG (DR_REG_HP_PERI1_PMS_BASE + 0x74)
/** HP_PERI1_PMS_READ_TEE_HP_TIMER_GROUP0 : R/W; bitpos: [0]; default: 1;
 *  Configures hp_timer_group0 registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_TEE_HP_TIMER_GROUP0    (BIT(0))
#define HP_PERI1_PMS_READ_TEE_HP_TIMER_GROUP0_M  (HP_PERI1_PMS_READ_TEE_HP_TIMER_GROUP0_V << HP_PERI1_PMS_READ_TEE_HP_TIMER_GROUP0_S)
#define HP_PERI1_PMS_READ_TEE_HP_TIMER_GROUP0_V  0x00000001U
#define HP_PERI1_PMS_READ_TEE_HP_TIMER_GROUP0_S  0
/** HP_PERI1_PMS_READ_REE0_HP_TIMER_GROUP0 : R/W; bitpos: [1]; default: 0;
 *  Configures hp_timer_group0 registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_REE0_HP_TIMER_GROUP0    (BIT(1))
#define HP_PERI1_PMS_READ_REE0_HP_TIMER_GROUP0_M  (HP_PERI1_PMS_READ_REE0_HP_TIMER_GROUP0_V << HP_PERI1_PMS_READ_REE0_HP_TIMER_GROUP0_S)
#define HP_PERI1_PMS_READ_REE0_HP_TIMER_GROUP0_V  0x00000001U
#define HP_PERI1_PMS_READ_REE0_HP_TIMER_GROUP0_S  1
/** HP_PERI1_PMS_READ_REE1_HP_TIMER_GROUP0 : R/W; bitpos: [2]; default: 0;
 *  Configures hp_timer_group0 registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_REE1_HP_TIMER_GROUP0    (BIT(2))
#define HP_PERI1_PMS_READ_REE1_HP_TIMER_GROUP0_M  (HP_PERI1_PMS_READ_REE1_HP_TIMER_GROUP0_V << HP_PERI1_PMS_READ_REE1_HP_TIMER_GROUP0_S)
#define HP_PERI1_PMS_READ_REE1_HP_TIMER_GROUP0_V  0x00000001U
#define HP_PERI1_PMS_READ_REE1_HP_TIMER_GROUP0_S  2
/** HP_PERI1_PMS_READ_REE2_HP_TIMER_GROUP0 : R/W; bitpos: [3]; default: 0;
 *  Configures hp_timer_group0 registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_REE2_HP_TIMER_GROUP0    (BIT(3))
#define HP_PERI1_PMS_READ_REE2_HP_TIMER_GROUP0_M  (HP_PERI1_PMS_READ_REE2_HP_TIMER_GROUP0_V << HP_PERI1_PMS_READ_REE2_HP_TIMER_GROUP0_S)
#define HP_PERI1_PMS_READ_REE2_HP_TIMER_GROUP0_V  0x00000001U
#define HP_PERI1_PMS_READ_REE2_HP_TIMER_GROUP0_S  3
/** HP_PERI1_PMS_WRITE_TEE_HP_TIMER_GROUP0 : R/W; bitpos: [4]; default: 1;
 *  Configures hp_timer_group0 registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_TEE_HP_TIMER_GROUP0    (BIT(4))
#define HP_PERI1_PMS_WRITE_TEE_HP_TIMER_GROUP0_M  (HP_PERI1_PMS_WRITE_TEE_HP_TIMER_GROUP0_V << HP_PERI1_PMS_WRITE_TEE_HP_TIMER_GROUP0_S)
#define HP_PERI1_PMS_WRITE_TEE_HP_TIMER_GROUP0_V  0x00000001U
#define HP_PERI1_PMS_WRITE_TEE_HP_TIMER_GROUP0_S  4
/** HP_PERI1_PMS_WRITE_REE0_HP_TIMER_GROUP0 : R/W; bitpos: [5]; default: 0;
 *  Configures hp_timer_group0 registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_REE0_HP_TIMER_GROUP0    (BIT(5))
#define HP_PERI1_PMS_WRITE_REE0_HP_TIMER_GROUP0_M  (HP_PERI1_PMS_WRITE_REE0_HP_TIMER_GROUP0_V << HP_PERI1_PMS_WRITE_REE0_HP_TIMER_GROUP0_S)
#define HP_PERI1_PMS_WRITE_REE0_HP_TIMER_GROUP0_V  0x00000001U
#define HP_PERI1_PMS_WRITE_REE0_HP_TIMER_GROUP0_S  5
/** HP_PERI1_PMS_WRITE_REE1_HP_TIMER_GROUP0 : R/W; bitpos: [6]; default: 0;
 *  Configures hp_timer_group0 registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_REE1_HP_TIMER_GROUP0    (BIT(6))
#define HP_PERI1_PMS_WRITE_REE1_HP_TIMER_GROUP0_M  (HP_PERI1_PMS_WRITE_REE1_HP_TIMER_GROUP0_V << HP_PERI1_PMS_WRITE_REE1_HP_TIMER_GROUP0_S)
#define HP_PERI1_PMS_WRITE_REE1_HP_TIMER_GROUP0_V  0x00000001U
#define HP_PERI1_PMS_WRITE_REE1_HP_TIMER_GROUP0_S  6
/** HP_PERI1_PMS_WRITE_REE2_HP_TIMER_GROUP0 : R/W; bitpos: [7]; default: 0;
 *  Configures hp_timer_group0 registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_REE2_HP_TIMER_GROUP0    (BIT(7))
#define HP_PERI1_PMS_WRITE_REE2_HP_TIMER_GROUP0_M  (HP_PERI1_PMS_WRITE_REE2_HP_TIMER_GROUP0_V << HP_PERI1_PMS_WRITE_REE2_HP_TIMER_GROUP0_S)
#define HP_PERI1_PMS_WRITE_REE2_HP_TIMER_GROUP0_V  0x00000001U
#define HP_PERI1_PMS_WRITE_REE2_HP_TIMER_GROUP0_S  7
/** HP_PERI1_PMS_HP_TIMER_GROUP0_LOCK : R/W; bitpos: [8]; default: 0;
 *  Set 1 to lock hp_timer_group0 peri_apm configuration
 */
#define HP_PERI1_PMS_HP_TIMER_GROUP0_LOCK    (BIT(8))
#define HP_PERI1_PMS_HP_TIMER_GROUP0_LOCK_M  (HP_PERI1_PMS_HP_TIMER_GROUP0_LOCK_V << HP_PERI1_PMS_HP_TIMER_GROUP0_LOCK_S)
#define HP_PERI1_PMS_HP_TIMER_GROUP0_LOCK_V  0x00000001U
#define HP_PERI1_PMS_HP_TIMER_GROUP0_LOCK_S  8

/** HP_PERI1_PMS_HP_TIMER_GROUP1_CTRL_REG register
 *  hp_timer_group1 read/write control register
 */
#define HP_PERI1_PMS_HP_TIMER_GROUP1_CTRL_REG (DR_REG_HP_PERI1_PMS_BASE + 0x78)
/** HP_PERI1_PMS_READ_TEE_HP_TIMER_GROUP1 : R/W; bitpos: [0]; default: 1;
 *  Configures hp_timer_group1 registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_TEE_HP_TIMER_GROUP1    (BIT(0))
#define HP_PERI1_PMS_READ_TEE_HP_TIMER_GROUP1_M  (HP_PERI1_PMS_READ_TEE_HP_TIMER_GROUP1_V << HP_PERI1_PMS_READ_TEE_HP_TIMER_GROUP1_S)
#define HP_PERI1_PMS_READ_TEE_HP_TIMER_GROUP1_V  0x00000001U
#define HP_PERI1_PMS_READ_TEE_HP_TIMER_GROUP1_S  0
/** HP_PERI1_PMS_READ_REE0_HP_TIMER_GROUP1 : R/W; bitpos: [1]; default: 0;
 *  Configures hp_timer_group1 registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_REE0_HP_TIMER_GROUP1    (BIT(1))
#define HP_PERI1_PMS_READ_REE0_HP_TIMER_GROUP1_M  (HP_PERI1_PMS_READ_REE0_HP_TIMER_GROUP1_V << HP_PERI1_PMS_READ_REE0_HP_TIMER_GROUP1_S)
#define HP_PERI1_PMS_READ_REE0_HP_TIMER_GROUP1_V  0x00000001U
#define HP_PERI1_PMS_READ_REE0_HP_TIMER_GROUP1_S  1
/** HP_PERI1_PMS_READ_REE1_HP_TIMER_GROUP1 : R/W; bitpos: [2]; default: 0;
 *  Configures hp_timer_group1 registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_REE1_HP_TIMER_GROUP1    (BIT(2))
#define HP_PERI1_PMS_READ_REE1_HP_TIMER_GROUP1_M  (HP_PERI1_PMS_READ_REE1_HP_TIMER_GROUP1_V << HP_PERI1_PMS_READ_REE1_HP_TIMER_GROUP1_S)
#define HP_PERI1_PMS_READ_REE1_HP_TIMER_GROUP1_V  0x00000001U
#define HP_PERI1_PMS_READ_REE1_HP_TIMER_GROUP1_S  2
/** HP_PERI1_PMS_READ_REE2_HP_TIMER_GROUP1 : R/W; bitpos: [3]; default: 0;
 *  Configures hp_timer_group1 registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_REE2_HP_TIMER_GROUP1    (BIT(3))
#define HP_PERI1_PMS_READ_REE2_HP_TIMER_GROUP1_M  (HP_PERI1_PMS_READ_REE2_HP_TIMER_GROUP1_V << HP_PERI1_PMS_READ_REE2_HP_TIMER_GROUP1_S)
#define HP_PERI1_PMS_READ_REE2_HP_TIMER_GROUP1_V  0x00000001U
#define HP_PERI1_PMS_READ_REE2_HP_TIMER_GROUP1_S  3
/** HP_PERI1_PMS_WRITE_TEE_HP_TIMER_GROUP1 : R/W; bitpos: [4]; default: 1;
 *  Configures hp_timer_group1 registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_TEE_HP_TIMER_GROUP1    (BIT(4))
#define HP_PERI1_PMS_WRITE_TEE_HP_TIMER_GROUP1_M  (HP_PERI1_PMS_WRITE_TEE_HP_TIMER_GROUP1_V << HP_PERI1_PMS_WRITE_TEE_HP_TIMER_GROUP1_S)
#define HP_PERI1_PMS_WRITE_TEE_HP_TIMER_GROUP1_V  0x00000001U
#define HP_PERI1_PMS_WRITE_TEE_HP_TIMER_GROUP1_S  4
/** HP_PERI1_PMS_WRITE_REE0_HP_TIMER_GROUP1 : R/W; bitpos: [5]; default: 0;
 *  Configures hp_timer_group1 registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_REE0_HP_TIMER_GROUP1    (BIT(5))
#define HP_PERI1_PMS_WRITE_REE0_HP_TIMER_GROUP1_M  (HP_PERI1_PMS_WRITE_REE0_HP_TIMER_GROUP1_V << HP_PERI1_PMS_WRITE_REE0_HP_TIMER_GROUP1_S)
#define HP_PERI1_PMS_WRITE_REE0_HP_TIMER_GROUP1_V  0x00000001U
#define HP_PERI1_PMS_WRITE_REE0_HP_TIMER_GROUP1_S  5
/** HP_PERI1_PMS_WRITE_REE1_HP_TIMER_GROUP1 : R/W; bitpos: [6]; default: 0;
 *  Configures hp_timer_group1 registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_REE1_HP_TIMER_GROUP1    (BIT(6))
#define HP_PERI1_PMS_WRITE_REE1_HP_TIMER_GROUP1_M  (HP_PERI1_PMS_WRITE_REE1_HP_TIMER_GROUP1_V << HP_PERI1_PMS_WRITE_REE1_HP_TIMER_GROUP1_S)
#define HP_PERI1_PMS_WRITE_REE1_HP_TIMER_GROUP1_V  0x00000001U
#define HP_PERI1_PMS_WRITE_REE1_HP_TIMER_GROUP1_S  6
/** HP_PERI1_PMS_WRITE_REE2_HP_TIMER_GROUP1 : R/W; bitpos: [7]; default: 0;
 *  Configures hp_timer_group1 registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_REE2_HP_TIMER_GROUP1    (BIT(7))
#define HP_PERI1_PMS_WRITE_REE2_HP_TIMER_GROUP1_M  (HP_PERI1_PMS_WRITE_REE2_HP_TIMER_GROUP1_V << HP_PERI1_PMS_WRITE_REE2_HP_TIMER_GROUP1_S)
#define HP_PERI1_PMS_WRITE_REE2_HP_TIMER_GROUP1_V  0x00000001U
#define HP_PERI1_PMS_WRITE_REE2_HP_TIMER_GROUP1_S  7
/** HP_PERI1_PMS_HP_TIMER_GROUP1_LOCK : R/W; bitpos: [8]; default: 0;
 *  Set 1 to lock hp_timer_group1 peri_apm configuration
 */
#define HP_PERI1_PMS_HP_TIMER_GROUP1_LOCK    (BIT(8))
#define HP_PERI1_PMS_HP_TIMER_GROUP1_LOCK_M  (HP_PERI1_PMS_HP_TIMER_GROUP1_LOCK_V << HP_PERI1_PMS_HP_TIMER_GROUP1_LOCK_S)
#define HP_PERI1_PMS_HP_TIMER_GROUP1_LOCK_V  0x00000001U
#define HP_PERI1_PMS_HP_TIMER_GROUP1_LOCK_S  8

/** HP_PERI1_PMS_HP_IOMUX_CTRL_REG register
 *  hp_iomux read/write control register
 */
#define HP_PERI1_PMS_HP_IOMUX_CTRL_REG (DR_REG_HP_PERI1_PMS_BASE + 0x7c)
/** HP_PERI1_PMS_READ_TEE_HP_IOMUX : R/W; bitpos: [0]; default: 1;
 *  Configures hp_iomux registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_TEE_HP_IOMUX    (BIT(0))
#define HP_PERI1_PMS_READ_TEE_HP_IOMUX_M  (HP_PERI1_PMS_READ_TEE_HP_IOMUX_V << HP_PERI1_PMS_READ_TEE_HP_IOMUX_S)
#define HP_PERI1_PMS_READ_TEE_HP_IOMUX_V  0x00000001U
#define HP_PERI1_PMS_READ_TEE_HP_IOMUX_S  0
/** HP_PERI1_PMS_READ_REE0_HP_IOMUX : R/W; bitpos: [1]; default: 0;
 *  Configures hp_iomux registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_REE0_HP_IOMUX    (BIT(1))
#define HP_PERI1_PMS_READ_REE0_HP_IOMUX_M  (HP_PERI1_PMS_READ_REE0_HP_IOMUX_V << HP_PERI1_PMS_READ_REE0_HP_IOMUX_S)
#define HP_PERI1_PMS_READ_REE0_HP_IOMUX_V  0x00000001U
#define HP_PERI1_PMS_READ_REE0_HP_IOMUX_S  1
/** HP_PERI1_PMS_READ_REE1_HP_IOMUX : R/W; bitpos: [2]; default: 0;
 *  Configures hp_iomux registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_REE1_HP_IOMUX    (BIT(2))
#define HP_PERI1_PMS_READ_REE1_HP_IOMUX_M  (HP_PERI1_PMS_READ_REE1_HP_IOMUX_V << HP_PERI1_PMS_READ_REE1_HP_IOMUX_S)
#define HP_PERI1_PMS_READ_REE1_HP_IOMUX_V  0x00000001U
#define HP_PERI1_PMS_READ_REE1_HP_IOMUX_S  2
/** HP_PERI1_PMS_READ_REE2_HP_IOMUX : R/W; bitpos: [3]; default: 0;
 *  Configures hp_iomux registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_REE2_HP_IOMUX    (BIT(3))
#define HP_PERI1_PMS_READ_REE2_HP_IOMUX_M  (HP_PERI1_PMS_READ_REE2_HP_IOMUX_V << HP_PERI1_PMS_READ_REE2_HP_IOMUX_S)
#define HP_PERI1_PMS_READ_REE2_HP_IOMUX_V  0x00000001U
#define HP_PERI1_PMS_READ_REE2_HP_IOMUX_S  3
/** HP_PERI1_PMS_WRITE_TEE_HP_IOMUX : R/W; bitpos: [4]; default: 1;
 *  Configures hp_iomux registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_TEE_HP_IOMUX    (BIT(4))
#define HP_PERI1_PMS_WRITE_TEE_HP_IOMUX_M  (HP_PERI1_PMS_WRITE_TEE_HP_IOMUX_V << HP_PERI1_PMS_WRITE_TEE_HP_IOMUX_S)
#define HP_PERI1_PMS_WRITE_TEE_HP_IOMUX_V  0x00000001U
#define HP_PERI1_PMS_WRITE_TEE_HP_IOMUX_S  4
/** HP_PERI1_PMS_WRITE_REE0_HP_IOMUX : R/W; bitpos: [5]; default: 0;
 *  Configures hp_iomux registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_REE0_HP_IOMUX    (BIT(5))
#define HP_PERI1_PMS_WRITE_REE0_HP_IOMUX_M  (HP_PERI1_PMS_WRITE_REE0_HP_IOMUX_V << HP_PERI1_PMS_WRITE_REE0_HP_IOMUX_S)
#define HP_PERI1_PMS_WRITE_REE0_HP_IOMUX_V  0x00000001U
#define HP_PERI1_PMS_WRITE_REE0_HP_IOMUX_S  5
/** HP_PERI1_PMS_WRITE_REE1_HP_IOMUX : R/W; bitpos: [6]; default: 0;
 *  Configures hp_iomux registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_REE1_HP_IOMUX    (BIT(6))
#define HP_PERI1_PMS_WRITE_REE1_HP_IOMUX_M  (HP_PERI1_PMS_WRITE_REE1_HP_IOMUX_V << HP_PERI1_PMS_WRITE_REE1_HP_IOMUX_S)
#define HP_PERI1_PMS_WRITE_REE1_HP_IOMUX_V  0x00000001U
#define HP_PERI1_PMS_WRITE_REE1_HP_IOMUX_S  6
/** HP_PERI1_PMS_WRITE_REE2_HP_IOMUX : R/W; bitpos: [7]; default: 0;
 *  Configures hp_iomux registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_REE2_HP_IOMUX    (BIT(7))
#define HP_PERI1_PMS_WRITE_REE2_HP_IOMUX_M  (HP_PERI1_PMS_WRITE_REE2_HP_IOMUX_V << HP_PERI1_PMS_WRITE_REE2_HP_IOMUX_S)
#define HP_PERI1_PMS_WRITE_REE2_HP_IOMUX_V  0x00000001U
#define HP_PERI1_PMS_WRITE_REE2_HP_IOMUX_S  7
/** HP_PERI1_PMS_HP_IOMUX_LOCK : R/W; bitpos: [8]; default: 0;
 *  Set 1 to lock hp_iomux peri_apm configuration
 */
#define HP_PERI1_PMS_HP_IOMUX_LOCK    (BIT(8))
#define HP_PERI1_PMS_HP_IOMUX_LOCK_M  (HP_PERI1_PMS_HP_IOMUX_LOCK_V << HP_PERI1_PMS_HP_IOMUX_LOCK_S)
#define HP_PERI1_PMS_HP_IOMUX_LOCK_V  0x00000001U
#define HP_PERI1_PMS_HP_IOMUX_LOCK_S  8

/** HP_PERI1_PMS_HP_MSPI_PADCTRL_CTRL_REG register
 *  hp_mspi_padctrl read/write control register
 */
#define HP_PERI1_PMS_HP_MSPI_PADCTRL_CTRL_REG (DR_REG_HP_PERI1_PMS_BASE + 0x80)
/** HP_PERI1_PMS_READ_TEE_HP_MSPI_PADCTRL : R/W; bitpos: [0]; default: 1;
 *  Configures hp_mspi_padctrl registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_TEE_HP_MSPI_PADCTRL    (BIT(0))
#define HP_PERI1_PMS_READ_TEE_HP_MSPI_PADCTRL_M  (HP_PERI1_PMS_READ_TEE_HP_MSPI_PADCTRL_V << HP_PERI1_PMS_READ_TEE_HP_MSPI_PADCTRL_S)
#define HP_PERI1_PMS_READ_TEE_HP_MSPI_PADCTRL_V  0x00000001U
#define HP_PERI1_PMS_READ_TEE_HP_MSPI_PADCTRL_S  0
/** HP_PERI1_PMS_READ_REE0_HP_MSPI_PADCTRL : R/W; bitpos: [1]; default: 0;
 *  Configures hp_mspi_padctrl registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_REE0_HP_MSPI_PADCTRL    (BIT(1))
#define HP_PERI1_PMS_READ_REE0_HP_MSPI_PADCTRL_M  (HP_PERI1_PMS_READ_REE0_HP_MSPI_PADCTRL_V << HP_PERI1_PMS_READ_REE0_HP_MSPI_PADCTRL_S)
#define HP_PERI1_PMS_READ_REE0_HP_MSPI_PADCTRL_V  0x00000001U
#define HP_PERI1_PMS_READ_REE0_HP_MSPI_PADCTRL_S  1
/** HP_PERI1_PMS_READ_REE1_HP_MSPI_PADCTRL : R/W; bitpos: [2]; default: 0;
 *  Configures hp_mspi_padctrl registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_REE1_HP_MSPI_PADCTRL    (BIT(2))
#define HP_PERI1_PMS_READ_REE1_HP_MSPI_PADCTRL_M  (HP_PERI1_PMS_READ_REE1_HP_MSPI_PADCTRL_V << HP_PERI1_PMS_READ_REE1_HP_MSPI_PADCTRL_S)
#define HP_PERI1_PMS_READ_REE1_HP_MSPI_PADCTRL_V  0x00000001U
#define HP_PERI1_PMS_READ_REE1_HP_MSPI_PADCTRL_S  2
/** HP_PERI1_PMS_READ_REE2_HP_MSPI_PADCTRL : R/W; bitpos: [3]; default: 0;
 *  Configures hp_mspi_padctrl registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_REE2_HP_MSPI_PADCTRL    (BIT(3))
#define HP_PERI1_PMS_READ_REE2_HP_MSPI_PADCTRL_M  (HP_PERI1_PMS_READ_REE2_HP_MSPI_PADCTRL_V << HP_PERI1_PMS_READ_REE2_HP_MSPI_PADCTRL_S)
#define HP_PERI1_PMS_READ_REE2_HP_MSPI_PADCTRL_V  0x00000001U
#define HP_PERI1_PMS_READ_REE2_HP_MSPI_PADCTRL_S  3
/** HP_PERI1_PMS_WRITE_TEE_HP_MSPI_PADCTRL : R/W; bitpos: [4]; default: 1;
 *  Configures hp_mspi_padctrl registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_TEE_HP_MSPI_PADCTRL    (BIT(4))
#define HP_PERI1_PMS_WRITE_TEE_HP_MSPI_PADCTRL_M  (HP_PERI1_PMS_WRITE_TEE_HP_MSPI_PADCTRL_V << HP_PERI1_PMS_WRITE_TEE_HP_MSPI_PADCTRL_S)
#define HP_PERI1_PMS_WRITE_TEE_HP_MSPI_PADCTRL_V  0x00000001U
#define HP_PERI1_PMS_WRITE_TEE_HP_MSPI_PADCTRL_S  4
/** HP_PERI1_PMS_WRITE_REE0_HP_MSPI_PADCTRL : R/W; bitpos: [5]; default: 0;
 *  Configures hp_mspi_padctrl registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_REE0_HP_MSPI_PADCTRL    (BIT(5))
#define HP_PERI1_PMS_WRITE_REE0_HP_MSPI_PADCTRL_M  (HP_PERI1_PMS_WRITE_REE0_HP_MSPI_PADCTRL_V << HP_PERI1_PMS_WRITE_REE0_HP_MSPI_PADCTRL_S)
#define HP_PERI1_PMS_WRITE_REE0_HP_MSPI_PADCTRL_V  0x00000001U
#define HP_PERI1_PMS_WRITE_REE0_HP_MSPI_PADCTRL_S  5
/** HP_PERI1_PMS_WRITE_REE1_HP_MSPI_PADCTRL : R/W; bitpos: [6]; default: 0;
 *  Configures hp_mspi_padctrl registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_REE1_HP_MSPI_PADCTRL    (BIT(6))
#define HP_PERI1_PMS_WRITE_REE1_HP_MSPI_PADCTRL_M  (HP_PERI1_PMS_WRITE_REE1_HP_MSPI_PADCTRL_V << HP_PERI1_PMS_WRITE_REE1_HP_MSPI_PADCTRL_S)
#define HP_PERI1_PMS_WRITE_REE1_HP_MSPI_PADCTRL_V  0x00000001U
#define HP_PERI1_PMS_WRITE_REE1_HP_MSPI_PADCTRL_S  6
/** HP_PERI1_PMS_WRITE_REE2_HP_MSPI_PADCTRL : R/W; bitpos: [7]; default: 0;
 *  Configures hp_mspi_padctrl registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_REE2_HP_MSPI_PADCTRL    (BIT(7))
#define HP_PERI1_PMS_WRITE_REE2_HP_MSPI_PADCTRL_M  (HP_PERI1_PMS_WRITE_REE2_HP_MSPI_PADCTRL_V << HP_PERI1_PMS_WRITE_REE2_HP_MSPI_PADCTRL_S)
#define HP_PERI1_PMS_WRITE_REE2_HP_MSPI_PADCTRL_V  0x00000001U
#define HP_PERI1_PMS_WRITE_REE2_HP_MSPI_PADCTRL_S  7
/** HP_PERI1_PMS_HP_MSPI_PADCTRL_LOCK : R/W; bitpos: [8]; default: 0;
 *  Set 1 to lock hp_mspi_padctrl peri_apm configuration
 */
#define HP_PERI1_PMS_HP_MSPI_PADCTRL_LOCK    (BIT(8))
#define HP_PERI1_PMS_HP_MSPI_PADCTRL_LOCK_M  (HP_PERI1_PMS_HP_MSPI_PADCTRL_LOCK_V << HP_PERI1_PMS_HP_MSPI_PADCTRL_LOCK_S)
#define HP_PERI1_PMS_HP_MSPI_PADCTRL_LOCK_V  0x00000001U
#define HP_PERI1_PMS_HP_MSPI_PADCTRL_LOCK_S  8

/** HP_PERI1_PMS_HP_INTRMTX_CTRL_REG register
 *  hp_intrmtx read/write control register
 */
#define HP_PERI1_PMS_HP_INTRMTX_CTRL_REG (DR_REG_HP_PERI1_PMS_BASE + 0x84)
/** HP_PERI1_PMS_READ_TEE_HP_INTRMTX : R/W; bitpos: [0]; default: 1;
 *  Configures hp_intrmtx registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_TEE_HP_INTRMTX    (BIT(0))
#define HP_PERI1_PMS_READ_TEE_HP_INTRMTX_M  (HP_PERI1_PMS_READ_TEE_HP_INTRMTX_V << HP_PERI1_PMS_READ_TEE_HP_INTRMTX_S)
#define HP_PERI1_PMS_READ_TEE_HP_INTRMTX_V  0x00000001U
#define HP_PERI1_PMS_READ_TEE_HP_INTRMTX_S  0
/** HP_PERI1_PMS_READ_REE0_HP_INTRMTX : R/W; bitpos: [1]; default: 0;
 *  Configures hp_intrmtx registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_REE0_HP_INTRMTX    (BIT(1))
#define HP_PERI1_PMS_READ_REE0_HP_INTRMTX_M  (HP_PERI1_PMS_READ_REE0_HP_INTRMTX_V << HP_PERI1_PMS_READ_REE0_HP_INTRMTX_S)
#define HP_PERI1_PMS_READ_REE0_HP_INTRMTX_V  0x00000001U
#define HP_PERI1_PMS_READ_REE0_HP_INTRMTX_S  1
/** HP_PERI1_PMS_READ_REE1_HP_INTRMTX : R/W; bitpos: [2]; default: 0;
 *  Configures hp_intrmtx registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_REE1_HP_INTRMTX    (BIT(2))
#define HP_PERI1_PMS_READ_REE1_HP_INTRMTX_M  (HP_PERI1_PMS_READ_REE1_HP_INTRMTX_V << HP_PERI1_PMS_READ_REE1_HP_INTRMTX_S)
#define HP_PERI1_PMS_READ_REE1_HP_INTRMTX_V  0x00000001U
#define HP_PERI1_PMS_READ_REE1_HP_INTRMTX_S  2
/** HP_PERI1_PMS_READ_REE2_HP_INTRMTX : R/W; bitpos: [3]; default: 0;
 *  Configures hp_intrmtx registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_REE2_HP_INTRMTX    (BIT(3))
#define HP_PERI1_PMS_READ_REE2_HP_INTRMTX_M  (HP_PERI1_PMS_READ_REE2_HP_INTRMTX_V << HP_PERI1_PMS_READ_REE2_HP_INTRMTX_S)
#define HP_PERI1_PMS_READ_REE2_HP_INTRMTX_V  0x00000001U
#define HP_PERI1_PMS_READ_REE2_HP_INTRMTX_S  3
/** HP_PERI1_PMS_WRITE_TEE_HP_INTRMTX : R/W; bitpos: [4]; default: 1;
 *  Configures hp_intrmtx registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_TEE_HP_INTRMTX    (BIT(4))
#define HP_PERI1_PMS_WRITE_TEE_HP_INTRMTX_M  (HP_PERI1_PMS_WRITE_TEE_HP_INTRMTX_V << HP_PERI1_PMS_WRITE_TEE_HP_INTRMTX_S)
#define HP_PERI1_PMS_WRITE_TEE_HP_INTRMTX_V  0x00000001U
#define HP_PERI1_PMS_WRITE_TEE_HP_INTRMTX_S  4
/** HP_PERI1_PMS_WRITE_REE0_HP_INTRMTX : R/W; bitpos: [5]; default: 0;
 *  Configures hp_intrmtx registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_REE0_HP_INTRMTX    (BIT(5))
#define HP_PERI1_PMS_WRITE_REE0_HP_INTRMTX_M  (HP_PERI1_PMS_WRITE_REE0_HP_INTRMTX_V << HP_PERI1_PMS_WRITE_REE0_HP_INTRMTX_S)
#define HP_PERI1_PMS_WRITE_REE0_HP_INTRMTX_V  0x00000001U
#define HP_PERI1_PMS_WRITE_REE0_HP_INTRMTX_S  5
/** HP_PERI1_PMS_WRITE_REE1_HP_INTRMTX : R/W; bitpos: [6]; default: 0;
 *  Configures hp_intrmtx registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_REE1_HP_INTRMTX    (BIT(6))
#define HP_PERI1_PMS_WRITE_REE1_HP_INTRMTX_M  (HP_PERI1_PMS_WRITE_REE1_HP_INTRMTX_V << HP_PERI1_PMS_WRITE_REE1_HP_INTRMTX_S)
#define HP_PERI1_PMS_WRITE_REE1_HP_INTRMTX_V  0x00000001U
#define HP_PERI1_PMS_WRITE_REE1_HP_INTRMTX_S  6
/** HP_PERI1_PMS_WRITE_REE2_HP_INTRMTX : R/W; bitpos: [7]; default: 0;
 *  Configures hp_intrmtx registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_REE2_HP_INTRMTX    (BIT(7))
#define HP_PERI1_PMS_WRITE_REE2_HP_INTRMTX_M  (HP_PERI1_PMS_WRITE_REE2_HP_INTRMTX_V << HP_PERI1_PMS_WRITE_REE2_HP_INTRMTX_S)
#define HP_PERI1_PMS_WRITE_REE2_HP_INTRMTX_V  0x00000001U
#define HP_PERI1_PMS_WRITE_REE2_HP_INTRMTX_S  7
/** HP_PERI1_PMS_HP_INTRMTX_LOCK : R/W; bitpos: [8]; default: 0;
 *  Set 1 to lock hp_intrmtx peri_apm configuration
 */
#define HP_PERI1_PMS_HP_INTRMTX_LOCK    (BIT(8))
#define HP_PERI1_PMS_HP_INTRMTX_LOCK_M  (HP_PERI1_PMS_HP_INTRMTX_LOCK_V << HP_PERI1_PMS_HP_INTRMTX_LOCK_S)
#define HP_PERI1_PMS_HP_INTRMTX_LOCK_V  0x00000001U
#define HP_PERI1_PMS_HP_INTRMTX_LOCK_S  8

