espressif/esp-idf/components/soc/esp32s31/register/soc/hp_peri1_pms_reg.h
/** HP_PERI1_PMS_HP_SYS_REG_CTRL_REG register
 *  hp_sys_reg read/write control register
 */
#define HP_PERI1_PMS_HP_SYS_REG_CTRL_REG (DR_REG_HP_PERI1_PMS_BASE + 0x88)
/** HP_PERI1_PMS_READ_TEE_HP_SYS_REG : R/W; bitpos: [0]; default: 1;
 *  Configures hp_sys_reg registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_TEE_HP_SYS_REG    (BIT(0))
#define HP_PERI1_PMS_READ_TEE_HP_SYS_REG_M  (HP_PERI1_PMS_READ_TEE_HP_SYS_REG_V << HP_PERI1_PMS_READ_TEE_HP_SYS_REG_S)
#define HP_PERI1_PMS_READ_TEE_HP_SYS_REG_V  0x00000001U
#define HP_PERI1_PMS_READ_TEE_HP_SYS_REG_S  0
/** HP_PERI1_PMS_READ_REE0_HP_SYS_REG : R/W; bitpos: [1]; default: 0;
 *  Configures hp_sys_reg registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_REE0_HP_SYS_REG    (BIT(1))
#define HP_PERI1_PMS_READ_REE0_HP_SYS_REG_M  (HP_PERI1_PMS_READ_REE0_HP_SYS_REG_V << HP_PERI1_PMS_READ_REE0_HP_SYS_REG_S)
#define HP_PERI1_PMS_READ_REE0_HP_SYS_REG_V  0x00000001U
#define HP_PERI1_PMS_READ_REE0_HP_SYS_REG_S  1
/** HP_PERI1_PMS_READ_REE1_HP_SYS_REG : R/W; bitpos: [2]; default: 0;
 *  Configures hp_sys_reg registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_REE1_HP_SYS_REG    (BIT(2))
#define HP_PERI1_PMS_READ_REE1_HP_SYS_REG_M  (HP_PERI1_PMS_READ_REE1_HP_SYS_REG_V << HP_PERI1_PMS_READ_REE1_HP_SYS_REG_S)
#define HP_PERI1_PMS_READ_REE1_HP_SYS_REG_V  0x00000001U
#define HP_PERI1_PMS_READ_REE1_HP_SYS_REG_S  2
/** HP_PERI1_PMS_READ_REE2_HP_SYS_REG : R/W; bitpos: [3]; default: 0;
 *  Configures hp_sys_reg registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_REE2_HP_SYS_REG    (BIT(3))
#define HP_PERI1_PMS_READ_REE2_HP_SYS_REG_M  (HP_PERI1_PMS_READ_REE2_HP_SYS_REG_V << HP_PERI1_PMS_READ_REE2_HP_SYS_REG_S)
#define HP_PERI1_PMS_READ_REE2_HP_SYS_REG_V  0x00000001U
#define HP_PERI1_PMS_READ_REE2_HP_SYS_REG_S  3
/** HP_PERI1_PMS_WRITE_TEE_HP_SYS_REG : R/W; bitpos: [4]; default: 1;
 *  Configures hp_sys_reg registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_TEE_HP_SYS_REG    (BIT(4))
#define HP_PERI1_PMS_WRITE_TEE_HP_SYS_REG_M  (HP_PERI1_PMS_WRITE_TEE_HP_SYS_REG_V << HP_PERI1_PMS_WRITE_TEE_HP_SYS_REG_S)
#define HP_PERI1_PMS_WRITE_TEE_HP_SYS_REG_V  0x00000001U
#define HP_PERI1_PMS_WRITE_TEE_HP_SYS_REG_S  4
/** HP_PERI1_PMS_WRITE_REE0_HP_SYS_REG : R/W; bitpos: [5]; default: 0;
 *  Configures hp_sys_reg registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_REE0_HP_SYS_REG    (BIT(5))
#define HP_PERI1_PMS_WRITE_REE0_HP_SYS_REG_M  (HP_PERI1_PMS_WRITE_REE0_HP_SYS_REG_V << HP_PERI1_PMS_WRITE_REE0_HP_SYS_REG_S)
#define HP_PERI1_PMS_WRITE_REE0_HP_SYS_REG_V  0x00000001U
#define HP_PERI1_PMS_WRITE_REE0_HP_SYS_REG_S  5
/** HP_PERI1_PMS_WRITE_REE1_HP_SYS_REG : R/W; bitpos: [6]; default: 0;
 *  Configures hp_sys_reg registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_REE1_HP_SYS_REG    (BIT(6))
#define HP_PERI1_PMS_WRITE_REE1_HP_SYS_REG_M  (HP_PERI1_PMS_WRITE_REE1_HP_SYS_REG_V << HP_PERI1_PMS_WRITE_REE1_HP_SYS_REG_S)
#define HP_PERI1_PMS_WRITE_REE1_HP_SYS_REG_V  0x00000001U
#define HP_PERI1_PMS_WRITE_REE1_HP_SYS_REG_S  6
/** HP_PERI1_PMS_WRITE_REE2_HP_SYS_REG : R/W; bitpos: [7]; default: 0;
 *  Configures hp_sys_reg registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_REE2_HP_SYS_REG    (BIT(7))
#define HP_PERI1_PMS_WRITE_REE2_HP_SYS_REG_M  (HP_PERI1_PMS_WRITE_REE2_HP_SYS_REG_V << HP_PERI1_PMS_WRITE_REE2_HP_SYS_REG_S)
#define HP_PERI1_PMS_WRITE_REE2_HP_SYS_REG_V  0x00000001U
#define HP_PERI1_PMS_WRITE_REE2_HP_SYS_REG_S  7
/** HP_PERI1_PMS_HP_SYS_REG_LOCK : R/W; bitpos: [8]; default: 0;
 *  Set 1 to lock hp_sys_reg peri_apm configuration
 */
#define HP_PERI1_PMS_HP_SYS_REG_LOCK    (BIT(8))
#define HP_PERI1_PMS_HP_SYS_REG_LOCK_M  (HP_PERI1_PMS_HP_SYS_REG_LOCK_V << HP_PERI1_PMS_HP_SYS_REG_LOCK_S)
#define HP_PERI1_PMS_HP_SYS_REG_LOCK_V  0x00000001U
#define HP_PERI1_PMS_HP_SYS_REG_LOCK_S  8

/** HP_PERI1_PMS_HP_CLKRST_CTRL_REG register
 *  hp_clkrst read/write control register
 */
#define HP_PERI1_PMS_HP_CLKRST_CTRL_REG (DR_REG_HP_PERI1_PMS_BASE + 0x8c)
/** HP_PERI1_PMS_READ_TEE_HP_CLKRST : R/W; bitpos: [0]; default: 1;
 *  Configures hp_clkrst registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_TEE_HP_CLKRST    (BIT(0))
#define HP_PERI1_PMS_READ_TEE_HP_CLKRST_M  (HP_PERI1_PMS_READ_TEE_HP_CLKRST_V << HP_PERI1_PMS_READ_TEE_HP_CLKRST_S)
#define HP_PERI1_PMS_READ_TEE_HP_CLKRST_V  0x00000001U
#define HP_PERI1_PMS_READ_TEE_HP_CLKRST_S  0
/** HP_PERI1_PMS_READ_REE0_HP_CLKRST : R/W; bitpos: [1]; default: 0;
 *  Configures hp_clkrst registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_REE0_HP_CLKRST    (BIT(1))
#define HP_PERI1_PMS_READ_REE0_HP_CLKRST_M  (HP_PERI1_PMS_READ_REE0_HP_CLKRST_V << HP_PERI1_PMS_READ_REE0_HP_CLKRST_S)
#define HP_PERI1_PMS_READ_REE0_HP_CLKRST_V  0x00000001U
#define HP_PERI1_PMS_READ_REE0_HP_CLKRST_S  1
/** HP_PERI1_PMS_READ_REE1_HP_CLKRST : R/W; bitpos: [2]; default: 0;
 *  Configures hp_clkrst registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_REE1_HP_CLKRST    (BIT(2))
#define HP_PERI1_PMS_READ_REE1_HP_CLKRST_M  (HP_PERI1_PMS_READ_REE1_HP_CLKRST_V << HP_PERI1_PMS_READ_REE1_HP_CLKRST_S)
#define HP_PERI1_PMS_READ_REE1_HP_CLKRST_V  0x00000001U
#define HP_PERI1_PMS_READ_REE1_HP_CLKRST_S  2
/** HP_PERI1_PMS_READ_REE2_HP_CLKRST : R/W; bitpos: [3]; default: 0;
 *  Configures hp_clkrst registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_REE2_HP_CLKRST    (BIT(3))
#define HP_PERI1_PMS_READ_REE2_HP_CLKRST_M  (HP_PERI1_PMS_READ_REE2_HP_CLKRST_V << HP_PERI1_PMS_READ_REE2_HP_CLKRST_S)
#define HP_PERI1_PMS_READ_REE2_HP_CLKRST_V  0x00000001U
#define HP_PERI1_PMS_READ_REE2_HP_CLKRST_S  3
/** HP_PERI1_PMS_WRITE_TEE_HP_CLKRST : R/W; bitpos: [4]; default: 1;
 *  Configures hp_clkrst registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_TEE_HP_CLKRST    (BIT(4))
#define HP_PERI1_PMS_WRITE_TEE_HP_CLKRST_M  (HP_PERI1_PMS_WRITE_TEE_HP_CLKRST_V << HP_PERI1_PMS_WRITE_TEE_HP_CLKRST_S)
#define HP_PERI1_PMS_WRITE_TEE_HP_CLKRST_V  0x00000001U
#define HP_PERI1_PMS_WRITE_TEE_HP_CLKRST_S  4
/** HP_PERI1_PMS_WRITE_REE0_HP_CLKRST : R/W; bitpos: [5]; default: 0;
 *  Configures hp_clkrst registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_REE0_HP_CLKRST    (BIT(5))
#define HP_PERI1_PMS_WRITE_REE0_HP_CLKRST_M  (HP_PERI1_PMS_WRITE_REE0_HP_CLKRST_V << HP_PERI1_PMS_WRITE_REE0_HP_CLKRST_S)
#define HP_PERI1_PMS_WRITE_REE0_HP_CLKRST_V  0x00000001U
#define HP_PERI1_PMS_WRITE_REE0_HP_CLKRST_S  5
/** HP_PERI1_PMS_WRITE_REE1_HP_CLKRST : R/W; bitpos: [6]; default: 0;
 *  Configures hp_clkrst registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_REE1_HP_CLKRST    (BIT(6))
#define HP_PERI1_PMS_WRITE_REE1_HP_CLKRST_M  (HP_PERI1_PMS_WRITE_REE1_HP_CLKRST_V << HP_PERI1_PMS_WRITE_REE1_HP_CLKRST_S)
#define HP_PERI1_PMS_WRITE_REE1_HP_CLKRST_V  0x00000001U
#define HP_PERI1_PMS_WRITE_REE1_HP_CLKRST_S  6
/** HP_PERI1_PMS_WRITE_REE2_HP_CLKRST : R/W; bitpos: [7]; default: 0;
 *  Configures hp_clkrst registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_REE2_HP_CLKRST    (BIT(7))
#define HP_PERI1_PMS_WRITE_REE2_HP_CLKRST_M  (HP_PERI1_PMS_WRITE_REE2_HP_CLKRST_V << HP_PERI1_PMS_WRITE_REE2_HP_CLKRST_S)
#define HP_PERI1_PMS_WRITE_REE2_HP_CLKRST_V  0x00000001U
#define HP_PERI1_PMS_WRITE_REE2_HP_CLKRST_S  7
/** HP_PERI1_PMS_HP_CLKRST_LOCK : R/W; bitpos: [8]; default: 0;
 *  Set 1 to lock hp_clkrst peri_apm configuration
 */
#define HP_PERI1_PMS_HP_CLKRST_LOCK    (BIT(8))
#define HP_PERI1_PMS_HP_CLKRST_LOCK_M  (HP_PERI1_PMS_HP_CLKRST_LOCK_V << HP_PERI1_PMS_HP_CLKRST_LOCK_S)
#define HP_PERI1_PMS_HP_CLKRST_LOCK_V  0x00000001U
#define HP_PERI1_PMS_HP_CLKRST_LOCK_S  8

/** HP_PERI1_PMS_CNNT_PAD_CTRL_CTRL_REG register
 *  cnnt_pad_ctrl read/write control register
 */
#define HP_PERI1_PMS_CNNT_PAD_CTRL_CTRL_REG (DR_REG_HP_PERI1_PMS_BASE + 0x90)
/** HP_PERI1_PMS_READ_TEE_CNNT_PAD_CTRL : R/W; bitpos: [0]; default: 1;
 *  Configures cnnt_pad_ctrl registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_TEE_CNNT_PAD_CTRL    (BIT(0))
#define HP_PERI1_PMS_READ_TEE_CNNT_PAD_CTRL_M  (HP_PERI1_PMS_READ_TEE_CNNT_PAD_CTRL_V << HP_PERI1_PMS_READ_TEE_CNNT_PAD_CTRL_S)
#define HP_PERI1_PMS_READ_TEE_CNNT_PAD_CTRL_V  0x00000001U
#define HP_PERI1_PMS_READ_TEE_CNNT_PAD_CTRL_S  0
/** HP_PERI1_PMS_READ_REE0_CNNT_PAD_CTRL : R/W; bitpos: [1]; default: 0;
 *  Configures cnnt_pad_ctrl registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_REE0_CNNT_PAD_CTRL    (BIT(1))
#define HP_PERI1_PMS_READ_REE0_CNNT_PAD_CTRL_M  (HP_PERI1_PMS_READ_REE0_CNNT_PAD_CTRL_V << HP_PERI1_PMS_READ_REE0_CNNT_PAD_CTRL_S)
#define HP_PERI1_PMS_READ_REE0_CNNT_PAD_CTRL_V  0x00000001U
#define HP_PERI1_PMS_READ_REE0_CNNT_PAD_CTRL_S  1
/** HP_PERI1_PMS_READ_REE1_CNNT_PAD_CTRL : R/W; bitpos: [2]; default: 0;
 *  Configures cnnt_pad_ctrl registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_REE1_CNNT_PAD_CTRL    (BIT(2))
#define HP_PERI1_PMS_READ_REE1_CNNT_PAD_CTRL_M  (HP_PERI1_PMS_READ_REE1_CNNT_PAD_CTRL_V << HP_PERI1_PMS_READ_REE1_CNNT_PAD_CTRL_S)
#define HP_PERI1_PMS_READ_REE1_CNNT_PAD_CTRL_V  0x00000001U
#define HP_PERI1_PMS_READ_REE1_CNNT_PAD_CTRL_S  2
/** HP_PERI1_PMS_READ_REE2_CNNT_PAD_CTRL : R/W; bitpos: [3]; default: 0;
 *  Configures cnnt_pad_ctrl registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_REE2_CNNT_PAD_CTRL    (BIT(3))
#define HP_PERI1_PMS_READ_REE2_CNNT_PAD_CTRL_M  (HP_PERI1_PMS_READ_REE2_CNNT_PAD_CTRL_V << HP_PERI1_PMS_READ_REE2_CNNT_PAD_CTRL_S)
#define HP_PERI1_PMS_READ_REE2_CNNT_PAD_CTRL_V  0x00000001U
#define HP_PERI1_PMS_READ_REE2_CNNT_PAD_CTRL_S  3
/** HP_PERI1_PMS_WRITE_TEE_CNNT_PAD_CTRL : R/W; bitpos: [4]; default: 1;
 *  Configures cnnt_pad_ctrl registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_TEE_CNNT_PAD_CTRL    (BIT(4))
#define HP_PERI1_PMS_WRITE_TEE_CNNT_PAD_CTRL_M  (HP_PERI1_PMS_WRITE_TEE_CNNT_PAD_CTRL_V << HP_PERI1_PMS_WRITE_TEE_CNNT_PAD_CTRL_S)
#define HP_PERI1_PMS_WRITE_TEE_CNNT_PAD_CTRL_V  0x00000001U
#define HP_PERI1_PMS_WRITE_TEE_CNNT_PAD_CTRL_S  4
/** HP_PERI1_PMS_WRITE_REE0_CNNT_PAD_CTRL : R/W; bitpos: [5]; default: 0;
 *  Configures cnnt_pad_ctrl registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_REE0_CNNT_PAD_CTRL    (BIT(5))
#define HP_PERI1_PMS_WRITE_REE0_CNNT_PAD_CTRL_M  (HP_PERI1_PMS_WRITE_REE0_CNNT_PAD_CTRL_V << HP_PERI1_PMS_WRITE_REE0_CNNT_PAD_CTRL_S)
#define HP_PERI1_PMS_WRITE_REE0_CNNT_PAD_CTRL_V  0x00000001U
#define HP_PERI1_PMS_WRITE_REE0_CNNT_PAD_CTRL_S  5
/** HP_PERI1_PMS_WRITE_REE1_CNNT_PAD_CTRL : R/W; bitpos: [6]; default: 0;
 *  Configures cnnt_pad_ctrl registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_REE1_CNNT_PAD_CTRL    (BIT(6))
#define HP_PERI1_PMS_WRITE_REE1_CNNT_PAD_CTRL_M  (HP_PERI1_PMS_WRITE_REE1_CNNT_PAD_CTRL_V << HP_PERI1_PMS_WRITE_REE1_CNNT_PAD_CTRL_S)
#define HP_PERI1_PMS_WRITE_REE1_CNNT_PAD_CTRL_V  0x00000001U
#define HP_PERI1_PMS_WRITE_REE1_CNNT_PAD_CTRL_S  6
/** HP_PERI1_PMS_WRITE_REE2_CNNT_PAD_CTRL : R/W; bitpos: [7]; default: 0;
 *  Configures cnnt_pad_ctrl registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_REE2_CNNT_PAD_CTRL    (BIT(7))
#define HP_PERI1_PMS_WRITE_REE2_CNNT_PAD_CTRL_M  (HP_PERI1_PMS_WRITE_REE2_CNNT_PAD_CTRL_V << HP_PERI1_PMS_WRITE_REE2_CNNT_PAD_CTRL_S)
#define HP_PERI1_PMS_WRITE_REE2_CNNT_PAD_CTRL_V  0x00000001U
#define HP_PERI1_PMS_WRITE_REE2_CNNT_PAD_CTRL_S  7
/** HP_PERI1_PMS_CNNT_PAD_CTRL_LOCK : R/W; bitpos: [8]; default: 0;
 *  Set 1 to lock cnnt_pad_ctrl peri_apm configuration
 */
#define HP_PERI1_PMS_CNNT_PAD_CTRL_LOCK    (BIT(8))
#define HP_PERI1_PMS_CNNT_PAD_CTRL_LOCK_M  (HP_PERI1_PMS_CNNT_PAD_CTRL_LOCK_V << HP_PERI1_PMS_CNNT_PAD_CTRL_LOCK_S)
#define HP_PERI1_PMS_CNNT_PAD_CTRL_LOCK_V  0x00000001U
#define HP_PERI1_PMS_CNNT_PAD_CTRL_LOCK_S  8

/** HP_PERI1_PMS_HP_ALIVE_SYS_REG_CTRL_REG register
 *  hp_alive_sys_reg read/write control register
 */
#define HP_PERI1_PMS_HP_ALIVE_SYS_REG_CTRL_REG (DR_REG_HP_PERI1_PMS_BASE + 0x94)
/** HP_PERI1_PMS_READ_TEE_HP_ALIVE_SYS_REG : R/W; bitpos: [0]; default: 1;
 *  Configures hp_alive_sys_reg registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_TEE_HP_ALIVE_SYS_REG    (BIT(0))
#define HP_PERI1_PMS_READ_TEE_HP_ALIVE_SYS_REG_M  (HP_PERI1_PMS_READ_TEE_HP_ALIVE_SYS_REG_V << HP_PERI1_PMS_READ_TEE_HP_ALIVE_SYS_REG_S)
#define HP_PERI1_PMS_READ_TEE_HP_ALIVE_SYS_REG_V  0x00000001U
#define HP_PERI1_PMS_READ_TEE_HP_ALIVE_SYS_REG_S  0
/** HP_PERI1_PMS_READ_REE0_HP_ALIVE_SYS_REG : R/W; bitpos: [1]; default: 0;
 *  Configures hp_alive_sys_reg registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_REE0_HP_ALIVE_SYS_REG    (BIT(1))
#define HP_PERI1_PMS_READ_REE0_HP_ALIVE_SYS_REG_M  (HP_PERI1_PMS_READ_REE0_HP_ALIVE_SYS_REG_V << HP_PERI1_PMS_READ_REE0_HP_ALIVE_SYS_REG_S)
#define HP_PERI1_PMS_READ_REE0_HP_ALIVE_SYS_REG_V  0x00000001U
#define HP_PERI1_PMS_READ_REE0_HP_ALIVE_SYS_REG_S  1
/** HP_PERI1_PMS_READ_REE1_HP_ALIVE_SYS_REG : R/W; bitpos: [2]; default: 0;
 *  Configures hp_alive_sys_reg registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_REE1_HP_ALIVE_SYS_REG    (BIT(2))
#define HP_PERI1_PMS_READ_REE1_HP_ALIVE_SYS_REG_M  (HP_PERI1_PMS_READ_REE1_HP_ALIVE_SYS_REG_V << HP_PERI1_PMS_READ_REE1_HP_ALIVE_SYS_REG_S)
#define HP_PERI1_PMS_READ_REE1_HP_ALIVE_SYS_REG_V  0x00000001U
#define HP_PERI1_PMS_READ_REE1_HP_ALIVE_SYS_REG_S  2
/** HP_PERI1_PMS_READ_REE2_HP_ALIVE_SYS_REG : R/W; bitpos: [3]; default: 0;
 *  Configures hp_alive_sys_reg registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_REE2_HP_ALIVE_SYS_REG    (BIT(3))
#define HP_PERI1_PMS_READ_REE2_HP_ALIVE_SYS_REG_M  (HP_PERI1_PMS_READ_REE2_HP_ALIVE_SYS_REG_V << HP_PERI1_PMS_READ_REE2_HP_ALIVE_SYS_REG_S)
#define HP_PERI1_PMS_READ_REE2_HP_ALIVE_SYS_REG_V  0x00000001U
#define HP_PERI1_PMS_READ_REE2_HP_ALIVE_SYS_REG_S  3
/** HP_PERI1_PMS_WRITE_TEE_HP_ALIVE_SYS_REG : R/W; bitpos: [4]; default: 1;
 *  Configures hp_alive_sys_reg registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_TEE_HP_ALIVE_SYS_REG    (BIT(4))
#define HP_PERI1_PMS_WRITE_TEE_HP_ALIVE_SYS_REG_M  (HP_PERI1_PMS_WRITE_TEE_HP_ALIVE_SYS_REG_V << HP_PERI1_PMS_WRITE_TEE_HP_ALIVE_SYS_REG_S)
#define HP_PERI1_PMS_WRITE_TEE_HP_ALIVE_SYS_REG_V  0x00000001U
#define HP_PERI1_PMS_WRITE_TEE_HP_ALIVE_SYS_REG_S  4
/** HP_PERI1_PMS_WRITE_REE0_HP_ALIVE_SYS_REG : R/W; bitpos: [5]; default: 0;
 *  Configures hp_alive_sys_reg registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_REE0_HP_ALIVE_SYS_REG    (BIT(5))
#define HP_PERI1_PMS_WRITE_REE0_HP_ALIVE_SYS_REG_M  (HP_PERI1_PMS_WRITE_REE0_HP_ALIVE_SYS_REG_V << HP_PERI1_PMS_WRITE_REE0_HP_ALIVE_SYS_REG_S)
#define HP_PERI1_PMS_WRITE_REE0_HP_ALIVE_SYS_REG_V  0x00000001U
#define HP_PERI1_PMS_WRITE_REE0_HP_ALIVE_SYS_REG_S  5
/** HP_PERI1_PMS_WRITE_REE1_HP_ALIVE_SYS_REG : R/W; bitpos: [6]; default: 0;
 *  Configures hp_alive_sys_reg registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_REE1_HP_ALIVE_SYS_REG    (BIT(6))
#define HP_PERI1_PMS_WRITE_REE1_HP_ALIVE_SYS_REG_M  (HP_PERI1_PMS_WRITE_REE1_HP_ALIVE_SYS_REG_V << HP_PERI1_PMS_WRITE_REE1_HP_ALIVE_SYS_REG_S)
#define HP_PERI1_PMS_WRITE_REE1_HP_ALIVE_SYS_REG_V  0x00000001U
#define HP_PERI1_PMS_WRITE_REE1_HP_ALIVE_SYS_REG_S  6
/** HP_PERI1_PMS_WRITE_REE2_HP_ALIVE_SYS_REG : R/W; bitpos: [7]; default: 0;
 *  Configures hp_alive_sys_reg registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_REE2_HP_ALIVE_SYS_REG    (BIT(7))
#define HP_PERI1_PMS_WRITE_REE2_HP_ALIVE_SYS_REG_M  (HP_PERI1_PMS_WRITE_REE2_HP_ALIVE_SYS_REG_V << HP_PERI1_PMS_WRITE_REE2_HP_ALIVE_SYS_REG_S)
#define HP_PERI1_PMS_WRITE_REE2_HP_ALIVE_SYS_REG_V  0x00000001U
#define HP_PERI1_PMS_WRITE_REE2_HP_ALIVE_SYS_REG_S  7
/** HP_PERI1_PMS_HP_ALIVE_SYS_REG_LOCK : R/W; bitpos: [8]; default: 0;
 *  Set 1 to lock hp_alive_sys_reg peri_apm configuration
 */
#define HP_PERI1_PMS_HP_ALIVE_SYS_REG_LOCK    (BIT(8))
#define HP_PERI1_PMS_HP_ALIVE_SYS_REG_LOCK_M  (HP_PERI1_PMS_HP_ALIVE_SYS_REG_LOCK_V << HP_PERI1_PMS_HP_ALIVE_SYS_REG_LOCK_S)
#define HP_PERI1_PMS_HP_ALIVE_SYS_REG_LOCK_V  0x00000001U
#define HP_PERI1_PMS_HP_ALIVE_SYS_REG_LOCK_S  8

