espressif/esp-idf/components/soc/esp32s31/register/soc/hp_peri1_pms_reg.h
/** HP_PERI1_PMS_HP_PERI1_PMS_CTRL_REG register
 *  hp_peri1_pms read/write control register
 */
#define HP_PERI1_PMS_HP_PERI1_PMS_CTRL_REG (DR_REG_HP_PERI1_PMS_BASE + 0x98)
/** HP_PERI1_PMS_READ_TEE_HP_PERI1_PMS : R/W; bitpos: [0]; default: 1;
 *  Configures hp_peri1_pms registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_TEE_HP_PERI1_PMS    (BIT(0))
#define HP_PERI1_PMS_READ_TEE_HP_PERI1_PMS_M  (HP_PERI1_PMS_READ_TEE_HP_PERI1_PMS_V << HP_PERI1_PMS_READ_TEE_HP_PERI1_PMS_S)
#define HP_PERI1_PMS_READ_TEE_HP_PERI1_PMS_V  0x00000001U
#define HP_PERI1_PMS_READ_TEE_HP_PERI1_PMS_S  0
/** HP_PERI1_PMS_READ_REE0_HP_PERI1_PMS : HRO; bitpos: [1]; default: 0;
 *  Configures hp_peri1_pms registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_REE0_HP_PERI1_PMS    (BIT(1))
#define HP_PERI1_PMS_READ_REE0_HP_PERI1_PMS_M  (HP_PERI1_PMS_READ_REE0_HP_PERI1_PMS_V << HP_PERI1_PMS_READ_REE0_HP_PERI1_PMS_S)
#define HP_PERI1_PMS_READ_REE0_HP_PERI1_PMS_V  0x00000001U
#define HP_PERI1_PMS_READ_REE0_HP_PERI1_PMS_S  1
/** HP_PERI1_PMS_READ_REE1_HP_PERI1_PMS : HRO; bitpos: [2]; default: 0;
 *  Configures hp_peri1_pms registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_REE1_HP_PERI1_PMS    (BIT(2))
#define HP_PERI1_PMS_READ_REE1_HP_PERI1_PMS_M  (HP_PERI1_PMS_READ_REE1_HP_PERI1_PMS_V << HP_PERI1_PMS_READ_REE1_HP_PERI1_PMS_S)
#define HP_PERI1_PMS_READ_REE1_HP_PERI1_PMS_V  0x00000001U
#define HP_PERI1_PMS_READ_REE1_HP_PERI1_PMS_S  2
/** HP_PERI1_PMS_READ_REE2_HP_PERI1_PMS : HRO; bitpos: [3]; default: 0;
 *  Configures hp_peri1_pms registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI1_PMS_READ_REE2_HP_PERI1_PMS    (BIT(3))
#define HP_PERI1_PMS_READ_REE2_HP_PERI1_PMS_M  (HP_PERI1_PMS_READ_REE2_HP_PERI1_PMS_V << HP_PERI1_PMS_READ_REE2_HP_PERI1_PMS_S)
#define HP_PERI1_PMS_READ_REE2_HP_PERI1_PMS_V  0x00000001U
#define HP_PERI1_PMS_READ_REE2_HP_PERI1_PMS_S  3
/** HP_PERI1_PMS_WRITE_TEE_HP_PERI1_PMS : R/W; bitpos: [4]; default: 1;
 *  Configures hp_peri1_pms registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_TEE_HP_PERI1_PMS    (BIT(4))
#define HP_PERI1_PMS_WRITE_TEE_HP_PERI1_PMS_M  (HP_PERI1_PMS_WRITE_TEE_HP_PERI1_PMS_V << HP_PERI1_PMS_WRITE_TEE_HP_PERI1_PMS_S)
#define HP_PERI1_PMS_WRITE_TEE_HP_PERI1_PMS_V  0x00000001U
#define HP_PERI1_PMS_WRITE_TEE_HP_PERI1_PMS_S  4
/** HP_PERI1_PMS_WRITE_REE0_HP_PERI1_PMS : HRO; bitpos: [5]; default: 0;
 *  Configures hp_peri1_pms registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_REE0_HP_PERI1_PMS    (BIT(5))
#define HP_PERI1_PMS_WRITE_REE0_HP_PERI1_PMS_M  (HP_PERI1_PMS_WRITE_REE0_HP_PERI1_PMS_V << HP_PERI1_PMS_WRITE_REE0_HP_PERI1_PMS_S)
#define HP_PERI1_PMS_WRITE_REE0_HP_PERI1_PMS_V  0x00000001U
#define HP_PERI1_PMS_WRITE_REE0_HP_PERI1_PMS_S  5
/** HP_PERI1_PMS_WRITE_REE1_HP_PERI1_PMS : HRO; bitpos: [6]; default: 0;
 *  Configures hp_peri1_pms registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_REE1_HP_PERI1_PMS    (BIT(6))
#define HP_PERI1_PMS_WRITE_REE1_HP_PERI1_PMS_M  (HP_PERI1_PMS_WRITE_REE1_HP_PERI1_PMS_V << HP_PERI1_PMS_WRITE_REE1_HP_PERI1_PMS_S)
#define HP_PERI1_PMS_WRITE_REE1_HP_PERI1_PMS_V  0x00000001U
#define HP_PERI1_PMS_WRITE_REE1_HP_PERI1_PMS_S  6
/** HP_PERI1_PMS_WRITE_REE2_HP_PERI1_PMS : HRO; bitpos: [7]; default: 0;
 *  Configures hp_peri1_pms registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI1_PMS_WRITE_REE2_HP_PERI1_PMS    (BIT(7))
#define HP_PERI1_PMS_WRITE_REE2_HP_PERI1_PMS_M  (HP_PERI1_PMS_WRITE_REE2_HP_PERI1_PMS_V << HP_PERI1_PMS_WRITE_REE2_HP_PERI1_PMS_S)
#define HP_PERI1_PMS_WRITE_REE2_HP_PERI1_PMS_V  0x00000001U
#define HP_PERI1_PMS_WRITE_REE2_HP_PERI1_PMS_S  7
/** HP_PERI1_PMS_HP_PERI1_PMS_LOCK : R/W; bitpos: [8]; default: 0;
 *  Set 1 to lock hp_peri1_pms peri_apm configuration
 */
#define HP_PERI1_PMS_HP_PERI1_PMS_LOCK    (BIT(8))
#define HP_PERI1_PMS_HP_PERI1_PMS_LOCK_M  (HP_PERI1_PMS_HP_PERI1_PMS_LOCK_V << HP_PERI1_PMS_HP_PERI1_PMS_LOCK_S)
#define HP_PERI1_PMS_HP_PERI1_PMS_LOCK_V  0x00000001U
#define HP_PERI1_PMS_HP_PERI1_PMS_LOCK_S  8

/** HP_PERI1_PMS_HP_PERI1_0_REG register
 *  HP_PERI1 PMS configuration & info register
 */
#define HP_PERI1_PMS_HP_PERI1_0_REG (DR_REG_HP_PERI1_PMS_BASE + 0x200)
/** HP_PERI1_PMS_HP_PERI1_PMS_EXCEPTION_CLR : WT; bitpos: [0]; default: 0;
 *  Configures whether or not to clear hp_peri1 peri_pms_record_reg.
 *  0: No clear
 *  1: Clear peri_pms_record_reg
 */
#define HP_PERI1_PMS_HP_PERI1_PMS_EXCEPTION_CLR    (BIT(0))
#define HP_PERI1_PMS_HP_PERI1_PMS_EXCEPTION_CLR_M  (HP_PERI1_PMS_HP_PERI1_PMS_EXCEPTION_CLR_V << HP_PERI1_PMS_HP_PERI1_PMS_EXCEPTION_CLR_S)
#define HP_PERI1_PMS_HP_PERI1_PMS_EXCEPTION_CLR_V  0x00000001U
#define HP_PERI1_PMS_HP_PERI1_PMS_EXCEPTION_CLR_S  0
/** HP_PERI1_PMS_HP_PERI1_PMS_EXCEPTION_DET : RO; bitpos: [1]; default: 0;
 *  Represents whether the hp_peri1 pms has been triggered.
 *  0: No triggered
 *  1: Has been triggered
 */
#define HP_PERI1_PMS_HP_PERI1_PMS_EXCEPTION_DET    (BIT(1))
#define HP_PERI1_PMS_HP_PERI1_PMS_EXCEPTION_DET_M  (HP_PERI1_PMS_HP_PERI1_PMS_EXCEPTION_DET_V << HP_PERI1_PMS_HP_PERI1_PMS_EXCEPTION_DET_S)
#define HP_PERI1_PMS_HP_PERI1_PMS_EXCEPTION_DET_V  0x00000001U
#define HP_PERI1_PMS_HP_PERI1_PMS_EXCEPTION_DET_S  1
/** HP_PERI1_PMS_HP_PERI1_PMS_EXCEPTION_ID : RO; bitpos: [7:2]; default: 0;
 *  Represents the master id when hp_peri1 pms has been triggered.
 */
#define HP_PERI1_PMS_HP_PERI1_PMS_EXCEPTION_ID    0x0000003FU
#define HP_PERI1_PMS_HP_PERI1_PMS_EXCEPTION_ID_M  (HP_PERI1_PMS_HP_PERI1_PMS_EXCEPTION_ID_V << HP_PERI1_PMS_HP_PERI1_PMS_EXCEPTION_ID_S)
#define HP_PERI1_PMS_HP_PERI1_PMS_EXCEPTION_ID_V  0x0000003FU
#define HP_PERI1_PMS_HP_PERI1_PMS_EXCEPTION_ID_S  2
/** HP_PERI1_PMS_HP_PERI1_PMS_EXCEPTION_MODE : RO; bitpos: [9:8]; default: 0;
 *  Represents the security mode when hp_peri1 pms has been triggered.
 */
#define HP_PERI1_PMS_HP_PERI1_PMS_EXCEPTION_MODE    0x00000003U
#define HP_PERI1_PMS_HP_PERI1_PMS_EXCEPTION_MODE_M  (HP_PERI1_PMS_HP_PERI1_PMS_EXCEPTION_MODE_V << HP_PERI1_PMS_HP_PERI1_PMS_EXCEPTION_MODE_S)
#define HP_PERI1_PMS_HP_PERI1_PMS_EXCEPTION_MODE_V  0x00000003U
#define HP_PERI1_PMS_HP_PERI1_PMS_EXCEPTION_MODE_S  8

/** HP_PERI1_PMS_HP_PERI1_1_REG register
 *  HP_PERI1 PMS exception addr record register
 */
#define HP_PERI1_PMS_HP_PERI1_1_REG (DR_REG_HP_PERI1_PMS_BASE + 0x204)
/** HP_PERI1_PMS_HP_PERI1_PMS_EXCEPTION_ADDR : RO; bitpos: [27:0]; default: 0;
 *  Represents the access address (bit27~bit0) when hp_peri1 pms has been triggered.
 */
#define HP_PERI1_PMS_HP_PERI1_PMS_EXCEPTION_ADDR    0x0FFFFFFFU
#define HP_PERI1_PMS_HP_PERI1_PMS_EXCEPTION_ADDR_M  (HP_PERI1_PMS_HP_PERI1_PMS_EXCEPTION_ADDR_V << HP_PERI1_PMS_HP_PERI1_PMS_EXCEPTION_ADDR_S)
#define HP_PERI1_PMS_HP_PERI1_PMS_EXCEPTION_ADDR_V  0x0FFFFFFFU
#define HP_PERI1_PMS_HP_PERI1_PMS_EXCEPTION_ADDR_S  0
/** HP_PERI1_PMS_HP_PERI1_PMS_EXCEPTION_ADDR_CONST : HRO; bitpos: [31:28]; default: 2;
 *  Represents the access address (bit31~bit28) when hp_peri1 pms has been triggered.
 */
#define HP_PERI1_PMS_HP_PERI1_PMS_EXCEPTION_ADDR_CONST    0x0000000FU
#define HP_PERI1_PMS_HP_PERI1_PMS_EXCEPTION_ADDR_CONST_M  (HP_PERI1_PMS_HP_PERI1_PMS_EXCEPTION_ADDR_CONST_V << HP_PERI1_PMS_HP_PERI1_PMS_EXCEPTION_ADDR_CONST_S)
#define HP_PERI1_PMS_HP_PERI1_PMS_EXCEPTION_ADDR_CONST_V  0x0000000FU
#define HP_PERI1_PMS_HP_PERI1_PMS_EXCEPTION_ADDR_CONST_S  28

/** HP_PERI1_PMS_INT_EN_REG register
 *  APM interrupt enable register
 */
#define HP_PERI1_PMS_INT_EN_REG (DR_REG_HP_PERI1_PMS_BASE + 0x300)
/** HP_PERI1_PMS_HP_PERI1_PMS_INT_EN : R/W; bitpos: [0]; default: 0;
 *  Configures to enable hp_peri1 pms interrupt.
 *  0: disable
 *  1: enable
 */
#define HP_PERI1_PMS_HP_PERI1_PMS_INT_EN    (BIT(0))
#define HP_PERI1_PMS_HP_PERI1_PMS_INT_EN_M  (HP_PERI1_PMS_HP_PERI1_PMS_INT_EN_V << HP_PERI1_PMS_HP_PERI1_PMS_INT_EN_S)
#define HP_PERI1_PMS_HP_PERI1_PMS_INT_EN_V  0x00000001U
#define HP_PERI1_PMS_HP_PERI1_PMS_INT_EN_S  0

