espressif/esp-idf/components/soc/esp32s31/register/soc/hp_peri1_pms_reg.h
/** HP_PERI1_PMS_BUS_ERR_CONF_REG register
 *  Clock gating register
 */
#define HP_PERI1_PMS_BUS_ERR_CONF_REG (DR_REG_HP_PERI1_PMS_BASE + 0xff0)
/** HP_PERI1_PMS_BUS_ERR_RESP_EN : R/W; bitpos: [0]; default: 0;
 *  Configures whether return error response to cpu when access blocked
 *  0: disable error response
 *  1: enable error response
 */
#define HP_PERI1_PMS_BUS_ERR_RESP_EN    (BIT(0))
#define HP_PERI1_PMS_BUS_ERR_RESP_EN_M  (HP_PERI1_PMS_BUS_ERR_RESP_EN_V << HP_PERI1_PMS_BUS_ERR_RESP_EN_S)
#define HP_PERI1_PMS_BUS_ERR_RESP_EN_V  0x00000001U
#define HP_PERI1_PMS_BUS_ERR_RESP_EN_S  0

/** HP_PERI1_PMS_CLOCK_GATE_REG register
 *  Clock gating register
 */
#define HP_PERI1_PMS_CLOCK_GATE_REG (DR_REG_HP_PERI1_PMS_BASE + 0xff8)
/** HP_PERI1_PMS_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  Configures whether to keep the clock always on.
 *  0: enable automatic clock gating
 *  1: keep the clock always on
 */
#define HP_PERI1_PMS_CLK_EN    (BIT(0))
#define HP_PERI1_PMS_CLK_EN_M  (HP_PERI1_PMS_CLK_EN_V << HP_PERI1_PMS_CLK_EN_S)
#define HP_PERI1_PMS_CLK_EN_V  0x00000001U
#define HP_PERI1_PMS_CLK_EN_S  0

/** HP_PERI1_PMS_DATE_REG register
 *  Version control register
 */
#define HP_PERI1_PMS_DATE_REG (DR_REG_HP_PERI1_PMS_BASE + 0xffc)
/** HP_PERI1_PMS_DATE : R/W; bitpos: [27:0]; default: 38834720;
 *  Version control register
 */
#define HP_PERI1_PMS_DATE    0x0FFFFFFFU
#define HP_PERI1_PMS_DATE_M  (HP_PERI1_PMS_DATE_V << HP_PERI1_PMS_DATE_S)
#define HP_PERI1_PMS_DATE_V  0x0FFFFFFFU
#define HP_PERI1_PMS_DATE_S  0

#ifdef __cplusplus
}
#endif
